Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: [Descriptors](https://github.com/bitcoin/bitcoin/blob/master/doc/descriptors.md) describe the ways that wallets generate private keys and public keys.
nl: [Descriptors](https://github.com/bitcoin/bitcoin/blob/master/doc/descriptors.md) beschrijven de manieren waarop wallets privésleutels en publieke sleutels genereren.

source: You should only import descriptors into Bitcoin Core for your wallet's public keys, not its private keys.
ar: يجب عليك استيراد الوصفات فقط في بيتكوين كور للمفاتيح العامة لمحفظتك، وليس لمفاتيحها الخاصة.
nl: Je moet alleen descriptors van de publieke sleutels van je wallet importeren in Bitcoin Core, niet van de privésleutels.

source: If your wallet's public key descriptor is compromised, an attacker will be able to see your wallet's addresses, but your funds will be safe.
ar: إذا تم التعرض للخطر واكتشاف وصف المفتاح العام الخاص بمحفظتك، فإن الهاجم سيكون قادرًا على رؤية عناوين محفظتك، ولكن أموالك ستكون آمنة.
nl: Als de publieke sleutel descriptor van je wallet is gecompromitteerd, kan een aanvaller de adressen van je wallet zien, maar je fondsen blijven veilig.

source: If your wallet's private key descriptor is compromised, an attacker can drain your wallet of funds.
ar: إذا تم التعرض للخطر واكتشاف وصف المفتاح الخاص بمحفظتك، فإن الهاجم قد يستولي على أموال محفظتك.
nl: Als de privésleutel descriptor van je wallet is gecompromitteerd, kan een aanvaller je wallet leegroven.

source: Get the wallet descriptor from the wallet whose UTXOs you want to search for rare ordinals. It will look something like this:
ar: قم بالحصول على وصف المحفظة من المحفظة التي ترغب في البحث في أموالها عن الأرقام الترتيبية النادرة. سيبدو هذا التوصيف مشابهًا لهذا:
nl: Haal de wallet descriptor op van de wallet waarvan je de UTXO's wilt doorzoeken op zeldzame ordinals. Het zal er ongeveer zo uitzien:

source: Create a watch-only wallet named `foo-watch-only`:
ar: أنشئ محفظة رصدية باسم `foo-watch-only`:
nl: Maak een watch-only wallet aan met de naam `foo-watch-only`:

source: Feel free to give it a better name than `foo-watch-only`!
ar: لا تتردد في إعطائه اسمًا أفضل من `foo-watch-only` إذا كنت ترغب!
nl: Voel je vrij om het een betere naam te geven dan `foo-watch-only`!

source: Load the `foo-watch-only` wallet:
ar: قم بتحميل محفظة "foo-watch-only" باستخدام الأمر التالي:
nl: Laad de `foo-watch-only` wallet:

source: Import your wallet descriptors into `foo-watch-only`:
ar: قم بتحميل واجهات محفظتك إلى المحفظة "foo-watch-only" باستخدام الأمر التالي:
nl: Importeer je wallet descriptors in `foo-watch-only`:

source: If you know the Unix timestamp when your wallet first started receive transactions, you may use it for the value of `"timestamp"` instead of `0`. This will reduce the time it takes for Bitcoin Core to search for your wallet's UTXOs.
ar: إذا كنت تعرف الطابع الزمني لنظام Unix عندما بدأت محفظتك في استقبال المعاملات لأول مرة، فيمكنك استخدامه كقيمة لـ "timestamp" بدلاً من 0. سيساعد ذلك في تقليل الوقت اللازم لبحث Bitcoin Core عن UTXOs في محفظتك.
nl: Als je de Unix-timestamp weet wanneer je wallet voor het eerst transacties begon te ontvangen, kun je deze gebruiken voor de waarde van `"timestamp"` in plaats van `0`. Dit verkort de tijd die Bitcoin Core nodig heeft om de UTXO's van je wallet te doorzoeken.

source: Check that everything worked:
ar: تحقق مما إذا كان كل شيء عمل بشكل صحيح:
nl: Controleer of alles goed werkt:

source: Display your wallet's rare ordinals:
ar: عرض أوردينالس في محفظتك:
nl: Toon de zeldzame ordinals van je wallet:

source: Searching for Rare Ordinals in a Wallet that Exports Multi-path Descriptors
ar: البحث عن الأوردينال النادرة في محفظة تصدر وصفوف مسار متعددة
nl: Zoeken naar zeldzame ordinals in een wallet die multi-path descriptors exporteert

source: Some descriptors describe multiple paths in one descriptor using angle brackets, e.g., `<0;1>`. Multi-path descriptors are not yet supported by Bitcoin Core, so you'll first need to convert them into multiple descriptors, and then import those multiple descriptors into Bitcoin Core.
ar: بعض الوصوف تصف مسارات متعددة في وصف واحد باستخدام الزوايا الزوجية، مثل `<0;1>`. الوصوف متعددة المسارات لا تزال غير مدعومة بواسطة Bitcoin Core حتى الآن، لذا ستحتاج أولاً إلى تحويلها إلى وصوف متعددة، ثم استيراد تلك الوصوف المتعددة إلى Bitcoin Core.
nl: Sommige descriptors beschrijven meerdere paden in één descriptor met behulp van haakjes, bijv. `<0;1>`. Multi-path descriptors worden nog niet ondersteund door Bitcoin Core, dus je moet ze eerst omzetten in meerdere descriptors en vervolgens die meerdere descriptors importeren in Bitcoin Core.

source: First get the multi-path descriptor from your wallet. It will look something like this:
ar: أولاً، قم بالحصول على الوصف المتعدد المسارات من محفظتك. سيبدو هذا على النحو التالي:
nl: Haal eerst de multi-path descriptor op van je wallet. Het zal er ongeveer zo uitzien:

source: Create a descriptor for the receive address path:
ar: أنشئ وصفًا لمسار عنوان الاستلام:
nl: Maak een descriptor voor het ontvangstadres-pad:

source: And the change address path:
ar: وأيضًا مسار عنوان التغيير:
nl: En het wisseladres-pad:

source: Get and note the checksum for the receive address descriptor, in this case `tpnxnxax`:
ar: احصل على وادرِ الفحص لوصف عنوان الاستلام وقم بتسجيله، في هذه الحالة هو `tpnxnxax`:
nl: Haal de checksum op voor de ontvangstadres descriptor en noteer deze, in dit geval `tpnxnxax`:

source: And for the change address descriptor, in this case `64k8wnd7`:
ar: وكذلك لوصف عنوان التغيير، في هذه الحالة هو `64k8wnd7`:
nl: En voor de wisseladres descriptor, in dit geval `64k8wnd7`:

source: Load the wallet you want to import the descriptors into:
ar: قم بتحميل المحفظة التي تريد استيراد الوصفات إليها:
nl: Laad de wallet waarin je de descriptors wilt importeren:

source: Now import the descriptors, with the correct checksums, into Bitcoin Core.
ar: الآن قم ب استيراد الوصفات، مع التحقق الصحيح، إلى Bitcoin Core.
nl: Importeer nu de descriptors, met de juiste checksums, in Bitcoin Core.

source: If you know the Unix timestamp when your wallet first started receive transactions, you may use it for the value of the `"timestamp"` fields instead of `0`. This will reduce the time it takes for Bitcoin Core to search for your wallet's UTXOs.
ar: إذا كنت تعرف الطابع الزمني (Unix timestamp) الذي بدأت فيه محفظتك استقبال المعاملات، يمكنك استخدامه كقيمة في حقول `"timestamp"` بدلاً من القيمة `0`. سيساعد ذلك في تقليل الوقت الذي يحتاجه Bitcoin Core للبحث عن UTXOs الخاصة بمحفظتك.
nl: Als je de Unix-timestamp weet wanneer je wallet voor het eerst transacties begon te ontvangen, kun je deze gebruiken voor de waarde van de `"timestamp"`-velden in plaats van `0`. Dit verkort de tijd die Bitcoin Core nodig heeft om de UTXO's van je wallet te doorzoeken.

source: Exporting Descriptors
nl: Descriptors exporteren

source: Navigate to the `Settings` tab, then to `Script Policy`, and press the edit button to display the descriptor.
ar: انتقل إلى علامة التبويب "الإعدادات" `Settings` ثم انتقل إلى "سياسة النص" `Script Policy` واضغط على زر التحرير (Edit) لعرض الوصف (descriptor).
nl: Navigeer naar het tabblad `Instellingen`, vervolgens naar `Scriptbeleid`, en druk op de bewerkknop om de descriptor weer te geven.

source: Transferring Ordinals
ar: إرسال الأوردينالس
nl: Ordinals overdragen

source: The `ord` wallet supports transferring specific satoshis by using the name of the satoshi. To send the satoshi `zonefruits`, do:
nl: De `ord` wallet ondersteunt het overdragen van specifieke satoshi's door de naam van de satoshi te gebruiken. Om de satoshi `zonefruits` te verzenden, doe je:

source: You can also use the `bitcoin-cli` commands `createrawtransaction`, `signrawtransactionwithwallet`, and `sendrawtransaction`, but this method can be complex and is outside the scope of this guide.
nl: Je kunt ook de `bitcoin-cli`-commando's `createrawtransaction`, `signrawtransactionwithwallet` en `sendrawtransaction` gebruiken, maar deze methode kan complex zijn en valt buiten het bereik van deze gids.

source: `ord` can be configured with the command line, environment variables, a configuration file, and default values.
nl: `ord` kan worden geconfigureerd met de opdrachtregel, omgevingsvariabelen, een configuratiebestand en standaardwaarden.

source: The command line takes precedence over environment variables, which take precedence over the configuration file, which takes precedence over defaults.
nl: De opdrachtregel heeft voorrang boven omgevingsvariabelen, die weer voorrang hebben boven het configuratiebestand, dat voorrang heeft boven de standaardwaarden.

source: The path to the configuration file can be given with `--config <CONFIG_PATH>`. `ord` will error if `<CONFIG_PATH>` doesn't exist.
nl: Het pad naar het configuratiebestand kan worden opgegeven met `--config <CONFIG_PATH>`. `ord` zal een foutmelding geven als `<CONFIG_PATH>` niet bestaat.

source: The path to a directory containing a configuration file name named `ord.yaml` can be given with `--config-dir <CONFIG_DIR_PATH>` or `--datadir <DATA_DIR_PATH>` in which case the config path is `<CONFIG_DIR_PATH>/ord.yaml` or `<DATA_DIR_PATH>/ord.yaml`. It is not an error if it does not exist.
nl: Het pad naar een map met een configuratiebestand genaamd `ord.yaml` kan worden opgegeven met `--config-dir <CONFIG_DIR_PATH>` of `--datadir <DATA_DIR_PATH>`, waarbij het configuratiepad `<CONFIG_DIR_PATH>/ord.yaml` of `<DATA_DIR_PATH>/ord.yaml` is. Het is geen fout als het bestand niet bestaat.

source: If none of `--config`, `--config-dir`, or `--datadir` are given, and a file named `ord.yaml` exists in the default data directory, it will be loaded.
nl: Als geen van `--config`, `--config-dir` of `--datadir` is opgegeven, en er bestaat een bestand genaamd `ord.yaml` in de standaardgegevensmap, zal dit bestand worden geladen.

source: For a setting named `--setting-name` on the command line, the environment variable will be named `ORD_SETTING_NAME`, and the config file field will be named `setting_name`. For example, the data directory can be configured with `--datadir` on the command line, the `ORD_DATA_DIR` environment variable, or `data_dir` in the config file.
nl: Voor een instelling genaamd `--setting-name` op de opdrachtregel, zal de omgevingsvariabele `ORD_SETTING_NAME` heten en het configuratiebestandveld `setting_name`. Bijvoorbeeld, de gegevensmap kan worden geconfigureerd met `--datadir` op de opdrachtregel, de omgevingsvariabele `ORD_DATA_DIR`, of `data_dir` in het configuratiebestand.

source: See `ord --help` for documentation of all the settings.
nl: Zie `ord --help` voor documentatie van alle instellingen.

source: `ord`'s current configuration can be viewed as JSON with the `ord settings` command.
nl: De huidige configuratie van `ord` kan als JSON worden bekeken met het commando `ord settings`.

source: Example Configuration
nl: Voorbeeldconfiguratie

source: # example config
nl: # voorbeeld config

source: # see `ord --help` for setting documentation
nl: # zie `ord --help` voor documentatie over instellingen

source: first_inscription_height
nl: eerste_inscription_hoogte

source: height_limit
nl: hoogte_limiet

source: server_password
nl: server_wachtwoord

source: Hiding Inscription Content
nl: Inscriptie-inhoud verbergen

source: Inscription content can be selectively prevented from being served by `ord server`.
nl: Inscriptie-inhoud kan selectief worden verhinderd om te worden aangeboden door `ord server`.

source: Unlike other settings, this can only be configured with the configuration file or environment variables.
nl: In tegenstelling tot andere instellingen, kan dit alleen worden geconfigureerd met het configuratiebestand of omgevingsvariabelen.

source: To hide inscriptions with an environment variable:
nl: Om inscripties te verbergen met een omgevingsvariabele:

source: Or with the configuration file:
nl: Of met het configuratiebestand:

source: Teleburn addresses can be used to burn assets on other blockchains, leaving behind in the smoking rubble a sort of forwarding address pointing to an inscription on Bitcoin.
nl: Teleburn-adressen kunnen worden gebruikt om activa op andere blockchains te verbranden, waarbij in de rook een soort doorverwijsadres achterblijft dat wijst naar een inscriptie op Bitcoin.

source: Teleburning an asset means something like, "I'm out. Find me on Bitcoin."
nl: Teleburning van een activum betekent iets als: "Ik ben weg. Zoek me op Bitcoin."

source: Teleburn addresses are derived from inscription IDs. They have no corresponding private key, so assets sent to a teleburn address are burned. Currently, only Ethereum teleburn addresses are supported. Pull requests adding teleburn addresses for other chains are welcome.
nl: Teleburn-adressen zijn afgeleid van inscriptie-ID's. Ze hebben geen bijbehorende privésleutel, dus activa die naar een teleburn-adres worden gestuurd, worden verbrand. Momenteel worden alleen Ethereum-teleburn-adressen ondersteund. Pull requests die teleburn-adressen voor andere chains toevoegen zijn welkom.

source: Ethereum teleburn addresses are derived by taking the first 20 bytes of the SHA-256 hash of the inscription ID, serialized as 36 bytes, with the first 32 bytes containing the transaction ID, and the last four bytes containing big-endian inscription index, and interpreting it as an Ethereum address.
nl: Ethereum-teleburn-adressen worden afgeleid door de eerste 20 bytes van de SHA-256-hash van de inscriptie-ID te nemen, geserialiseerd als 36 bytes, waarbij de eerste 32 bytes de transactie-ID bevatten en de laatste vier bytes de big-endian inscriptie-index, en dit te interpreteren als een Ethereum-adres.

source: The ENS domain name [rodarmor.eth](https://app.ens.domains/rodarmor.eth), was teleburned to [inscription zero](https://ordinals.com/inscription/6fb976ab49dcec017f1e201e84395983204ae1a7c2abf7ced0a85d692e442799i0).
nl: De ENS-domeinnaam [rodarmor.eth](https://app.ens.domains/rodarmor.eth) werd teleburned naar [inscriptie nul](https://ordinals.com/inscription/6fb976ab49dcec017f1e201e84395983204ae1a7c2abf7ced0a85d692e442799i0).

source: The inscription ID of inscription zero is `6fb976ab49dcec017f1e201e84395983204ae1a7c2abf7ced0a85d692e442799i0`.
nl: De inscriptie-ID van inscriptie nul is `6fb976ab49dcec017f1e201e84395983204ae1a7c2abf7ced0a85d692e442799i0`.

source: Passing `6fb976ab49dcec017f1e201e84395983204ae1a7c2abf7ced0a85d692e442799i0` to the teleburn command:
nl: Het doorgeven van `6fb976ab49dcec017f1e201e84395983204ae1a7c2abf7ced0a85d692e442799i0` aan het teleburn-commando:

source: Returns:
nl: Geeft terug (Returns):

source: Indicating that `0xe43A06530BdF8A4e067581f48Fae3b535559dA9e` is the Ethereum teleburn address for inscription zero, which is, indeed, the current owner, on Ethereum, of `rodarmor.eth`.
nl: Dit geeft aan dat `0xe43A06530BdF8A4e067581f48Fae3b535559dA9e` het Ethereum-teleburn-adres is voor inscriptie nul, wat inderdaad de huidige eigenaar op Ethereum is van `rodarmor.eth`.

source: Test Environment
nl: Test Omgeving

source: `ord env <DIRECTORY>` creates a test environment in `<DIRECTORY>`, spins up `bitcoind` and `ord server` instances, prints example commands for interacting with the test `bitcoind` and `ord server` instances, waits for `CTRL-C`, and then shuts down `bitcoind` and `ord server`.
nl: `ord env <DIRECTORY>` maakt een testomgeving aan in `<DIRECTORY>`, start `bitcoind`- en `ord server`-instellingen op, drukt voorbeeldcommando's af voor interactie met de test-`bitcoind`- en `ord server`-instellingen, wacht op `CTRL-C`, en schakelt vervolgens `bitcoind` en `ord server` uit.

source: `ord env` tries to use port 9000 for `bitcoind`'s RPC interface, and port `9001` for `ord`'s RPC interface, but will fall back to random unused ports.
nl: `ord env` probeert poort 9000 te gebruiken voor de RPC-interface van `bitcoind`, en poort 9001 voor de RPC-interface van `ord`, maar valt terug op willekeurige ongebruikte poorten als deze bezet zijn.

source: Inside of the env directory, `ord env` will write `bitcoind`'s configuration to `bitcoin.conf`, `ord`'s configuration to `ord.yaml`, and the env configuration to `env.json`.
nl: Binnen de env-directory schrijft `ord env` de configuratie van `bitcoind` naar `bitcoin.conf`, de configuratie van `ord` naar `ord.yaml`, en de env-configuratie naar `env.json`.

source: `env.json` contains the commands needed to invoke `bitcoin-cli` and `ord wallet`, as well as the ports `bitcoind` and `ord server` are listening on.
nl: `env.json` bevat de commando's die nodig zijn om `bitcoin-cli` en `ord wallet` aan te roepen, evenals de poorten waarop `bitcoind` en `ord server` luisteren.

source: These can be extracted into shell commands using `jq`:
nl: Deze kunnen worden omgezet in shell-commando's met behulp van `jq`:

source: If `ord` is in the `$PATH` and the env directory is `env`, the `bitcoin-cli` command will be:
nl: Als `ord` in de `$PATH` staat en de env-directory `env` is, zal het `bitcoin-cli`-commando zijn:

source: And the `ord` will be:
nl: En het `ord`-commando zal zijn:

source: Test Networks
nl: Test Netwerken

source: Ord can be tested using the following flags to specify the test network. For more information on running Bitcoin Core for testing, see [Bitcoin's developer documentation](https://developer.bitcoin.org/examples/testing.html).
ar: يمكن اختبار Ord باستخدام الأعلام التالية لتحديد شبكة الاختبار. لمزيد من المعلومات حول تشغيل Bitcoin Core لأغراض الاختبار، انظر [Bitcoin's developer documentation](https://developer.bitcoin.org/examples/testing.html).
nl: Ord kan worden getest met de volgende vlaggen om het testnetwerk op te geven. Voor meer informatie over het draaien van Bitcoin Core voor tests, zie de [ontwikkelaarsdocumentatie van Bitcoin](https://developer.bitcoin.org/examples/testing.html).

source: Most `ord` commands in [wallet](wallet.md) and [explorer](explorer.md) can be run with the following network flags:
nl: De meeste `ord`-commando's in [wallet](wallet.md) en [explorer](explorer.md) kunnen worden uitgevoerd met de volgende netwerkvlaggen:

source: Network
nl: Netwerk

source: Flag
nl: Vlag (Flag)

source: Regtest doesn't require downloading the blockchain since you create your own private blockchain, so indexing `ord` is almost instantaneous.
nl: Regtest vereist niet het downloaden van de blockchain, omdat je je eigen privé-blockchain creëert, waardoor het indexeren van `ord` bijna onmiddellijk is.

source: Run `bitcoind` in regtest with:
nl: Voer `bitcoind` uit in regtest met:

source: Run `ord server` in regtest with:
nl: Voer `ord server` uit in regtest met:

source: Create a wallet in regtest with:
ar: أنشئ محفظة جديدة باستخدام الأمر:
nl: Maak een wallet aan in regtest met:

source: Get a regtest receive address with:
ar: أنشئ عوان للاستقبال باستخدام الأمر:
nl: Haal een regtest ontvangstadres op met:

source: Mine 101 blocks (to unlock the coinbase) with:
ar: إبدا بتعدين البلوكس باستخدام الأمر:
nl: Mijn 101 blokken (om de coinbase te ontgrendelen) met:

source: Inscribe in regtest with:
ar: إنسكرايب بوسطه الريغيست باستخدام الأمر:
nl: Inscribe in regtest met:

source: Mine the inscription with:
ar: عدن الإنسكريبشين باستخدام الأمر:
nl: Mijn de inscriptie met:

source: By default, browsers don't support compression over HTTP. To test compressed content over HTTP, use the `--decompress` flag:
nl: Standaard ondersteunen browsers geen compressie via HTTP. Om gecomprimeerde inhoud via HTTP te testen, gebruik je de `--decompress` vlag:

source: Testing Recursion
ar: اختبار التكرار
nl: Het Testen van Recursie

source: When testing out [recursion](../inscriptions/recursion.md), inscribe the dependencies first (example with [p5.js](https://p5js.org)):
nl: Bij het testen van [recursie](../inscriptions/recursion.md), inscribeer eerst de afhankelijkheden (voorbeeld met [p5.js](https://p5js.org)):

source: This will return the inscription ID of the dependency which you can then reference in your inscription.
nl: Dit zal de inscriptie-ID van de afhankelijkheid teruggeven, die je vervolgens kunt gebruiken in je inscriptie.

source: However, inscription IDs differ between mainnet and test chains, so you must change the inscription IDs in your inscription to the mainnet inscription IDs of your dependencies before making the final inscription on mainnet.
nl: Inscriptie-ID's verschillen echter tussen mainnet en testnetwerken, dus je moet de inscriptie-ID's in je inscriptie vervangen door de mainnet-inscriptie-ID's van je afhankelijkheden voordat je de definitieve inscriptie op mainnet maakt.

source: Then you can inscribe your recursive inscription with:
ar: ثم يمكنك تسجيل السجل التكراري الخاص بك باستخدام الأمر:
nl: Vervolgens kun je je recursieve inscriptie inschrijven met:

source: Finally you will have to mine some blocks and start the server:
ar: أخيرًا، ستحتاج إلى تعدين بعض الكتل وبدء الخادم باستخدام الأمر:
nl: Tot slot moet je enkele blokken mijnen en de server starten:

source: Mainnet Dependencies
nl: Mainnet Afhankelijkheden

source: To avoid having to change dependency inscription IDs to mainnet inscription IDs, you may utilize a content proxy when testing. `ord server` accepts a `--proxy` option, which takes the URL of a another `ord server` instance. When making a request to `/content/<INSCRIPTION_ID>` when a content proxy is set and the inscription is not found, `ord server` will forward the request to the content proxy. This allows you to run a test `ord server` instance with a mainnet content proxy. You can then use mainnet inscription IDs in your test inscription, which will then return the content of the mainnet inscriptions.
nl: Om te voorkomen dat je afhankelijkheidsinscriptie-ID's naar mainnet-inscriptie-ID's moet wijzigen, kun je een contentproxy gebruiken tijdens het testen. `ord server` accepteert een `--proxy` optie, die de URL van een andere `ord server`-instantie vereist. Wanneer je een verzoek indient bij `/content/<INSCRIPTION_ID>` met een ingestelde contentproxy en de inscriptie niet wordt gevonden, zal `ord server` het verzoek doorsturen naar de contentproxy. Dit stelt je in staat om een test-`ord server`-instantie te draaien met een mainnet contentproxy. Je kunt dan mainnet-inscriptie-ID's gebruiken in je testinscriptie, wat de inhoud van de mainnet-inscripties zal retourneren.

source: Ordinal Bounty Hunting Hints
ar: نصائح لصيد جوائز أوردينال
nl: Hints voor het jagen op ordinals-bounty

source: The `ord` wallet can send and receive specific satoshis. Additionally, ordinal theory is extremely simple. A clever hacker should be able to write code from scratch to manipulate satoshis using ordinal theory in no time.
ar: محفظة `أورد` يمكنها إرسال واستقبال ساتوشي محددة. بالإضافة إلى ذلك، نظرية أوردينال بسيطة للغاية. يجب أن يكون لدى الهاكرز الذكيين القدرة على كتابة الشيفرات من البداية للتلاعب بالساتوشي باستخدام النظرية في وقت قصير جدا.
nl: De `ord` wallet kan specifieke satoshi's verzenden en ontvangen. Bovendien is de ordinal-theorie uiterst eenvoudig. Een slimme hacker zou in staat moeten zijn om code vanaf nul te schrijven om satoshi's te manipuleren met behulp van de ordinal-theorie in een mum van tijd.
