Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: The payload buffer is assembled by concatenating data pushes, after `OP_13`, in the matching script pubkey.
nl: Het payloadbuffer wordt samengesteld door de datastukken na `OP_13` in de overeenkomende script pubkey aan elkaar te koppelen.

source: Data pushes are opcodes 0 through 78 inclusive. If a non-data push opcode is encountered, i.e., any opcode equal to or greater than opcode 79, the deciphered runestone is a cenotaph with no etching, mint, or edicts.
nl: De datastukken zijn opcodes 0 tot en met 78 inclusief. Als een niet-data push opcode wordt aangetroffen, dat wil zeggen een opcode gelijk aan of groter dan opcode 79, dan is de ontcijferde runestone een cenotaaf zonder etching, mint of edicts.

source: Decoding the Integer Sequence
nl: Decoderen van de gehele reeks van 128-bit LEB128-getallen uit de payloadbuffer

source: A sequence of 128-bit integers are decoded from the payload as LEB128 varints.
nl: Een reeks van 128-bit gehele getallen wordt uit de payload gedecodeerd als LEB128 varints.

source: LEB128 varints are encoded as sequence of bytes, each of which has the most-significant bit set, except for the last.
nl: LEB128 varints worden gecodeerd als een reeks bytes, waarvan elke byte het meest significante bit ingesteld heeft, behalve de laatste.

source: If a LEB128 varint contains more than 18 bytes, would overflow a u128, or is truncated, meaning that the end of the payload buffer is reached before encountering a byte with the continuation bit not set, the decoded runestone is a cenotaph with no etching, mint, or edicts.
nl: Als een LEB128 varint meer dan 18 bytes bevat, een `u128` zou overlopen, of wordt afgekapt, wat betekent dat het einde van de payloadbuffer is bereikt voordat een byte met het voortzettingsbit niet ingesteld is wordt aangetroffen, is de gedecodeerde runestone een cenotaph zonder etching, mint of edicts.

source: Parsing the Message
nl: Het ontleden van de boodschap

source: The integer sequence is parsed into an untyped message:
nl: De reeks gehele getallen wordt ontleed in een ongetypte boodschap:

source: The integers are interpreted as a sequence of tag/value pairs, with duplicate tags appending their value to the field value.
nl: De gehele getallen worden geïnterpreteerd als een reeks tag/waarde-paren, waarbij dubbele tags hun waarde toevoegen aan de veldwaarde.

source: If a tag with value zero is encountered, all following integers are interpreted as a series of four-integer edicts, each consisting of a rune ID block height, rune ID transaction index, amount, and output.
nl: Als een tag met de waarde nul wordt aangetroffen, worden alle volgende gehele getallen geïnterpreteerd als een reeks van vier-integer edicts, elk bestaande uit een rune-ID blockhoogte, rune-ID transactienummer, hoeveelheid en uitvoer.

source: Rune ID block heights and transaction indices in edicts are delta encoded.
nl: De blockhoogtes en transactienummers van rune-ID's in edicts zijn delta-gecodeerd.

source: Edict rune ID decoding starts with a base block height and transaction index of zero. When decoding each rune ID, first the encoded block height delta is added to the base block height. If the block height delta is zero, the next integer is a transaction index delta. If the block height delta is greater than zero, the next integer is instead an absolute transaction index.
nl: Decodering van edict rune-ID's begint met een basis blockhoogte en transactienummer van nul. Bij het decoderen van elke rune-ID wordt eerst de gecodeerde blockhoogte-delta bij de basis blockhoogte opgeteld. Als de blockhoogte-delta nul is, is het volgende geheel getal een transactienummer-delta. Als de blockhoogte-delta groter is dan nul, is het volgende geheel getal in plaats daarvan een absoluut transactienummer.

source: This implies that edicts must first be sorted by rune ID before being encoded in a runestone.
nl: Dit houdt in dat edicts eerst gesorteerd moeten worden op rune-ID voordat ze worden gecodeerd in een runestone.

source: For example, to encode the following edicts:
nl: Bijvoorbeeld, om de volgende edicts te coderen:

source: amount
nl: aantal

source: They are first sorted by block height and transaction index:
nl: Ze worden eerst gesorteerd op blokhoogte en transactie-index:

source: And then delta encoded as:
nl: En daarna delta-gecodeerd als:

source: If an edict output is greater than the number of outputs of the transaction, an edict rune ID is encountered with block zero and nonzero transaction index, or a field is truncated, meaning a tag is encountered without a value, the decoded runestone is a cenotaph.
nl: Als een edictoutput groter is dan het aantal outputs van de transactie, wordt een edict-rune-ID aangetroffen met block nul en een niet-nul transactieverwijzing, of een veld is afgebroken, wat betekent dat een tag zonder waarde wordt aangetroffen, dan is de gedecodeerde runestone een cenotaaf.

source: Note that if a cenotaph is produced here, the cenotaph is not empty, meaning that it contains the fields and edicts, which may include an etching and mint.
nl: Houd er rekening mee dat als hier een cenotaaf wordt geproduceerd, de cenotaaf niet leeg is, wat betekent dat deze de velden en edicts bevat, die een etching en mint kunnen omvatten.

source: Parsing the Runestone
nl: Het Ontcijferen van de Runestone

source: The runestone:
nl: De runestone:

source: Is parsed from the unsigned message using the following tags:
nl: Wordt ontcijferd uit het ongetekende bericht met behulp van de volgende tags:

source: Note that tags are grouped by parity, i.e., whether they are even or odd. Unrecognized odd tags are ignored. Unrecognized even tags produce a cenotaph.
nl: Let op dat tags worden gegroepeerd op pariteit, d.w.z. of ze even of oneven zijn. Onbekende oneven tags worden genegeerd. Onbekende even tags produceren een cenotaaf.

source: All unused tags are reserved for use by the protocol, may be assigned at any time, and must not be used.
nl: Alle ongebruikte tags zijn gereserveerd voor gebruik door het protocol, kunnen op elk moment worden toegewezen en mogen niet worden gebruikt.

source: Body
nl: Lichaam (Body)

source: Flags
nl: Vlag (Flag)

source: The `Flag` field contains a bitmap of flags, whose position is `1 << FLAG_VALUE`:
nl: Het `Flag`-veld bevat een bitmap van vlaggen, waarvan de positie `1 << FLAG_VALUE` is:

source: The `Etching` flag marks this transaction as containing an etching.
nl: De `Etching`-vlag markeert deze transactie als een etching.

source: The `Terms` flag marks this transaction's etching as having open mint terms.
nl: De `Terms`-vlag markeert de etching van deze transactie als het hebben van open mint-voorwaarden.

source: The `Turbo` flag marks this transaction's etching as opting into future protocol changes. These protocol changes may increase light client validation costs, or just be highly degenerate.
nl: De `Turbo`-vlag markeert de etching van deze transactie als meewerkend aan toekomstige protocolwijzigingen. Deze protocolwijzigingen kunnen de validatiekosten voor lichte clients verhogen, of gewoon sterk afwijkend zijn.

source: The `Cenotaph` flag is unrecognized.
nl: De `Cenotaph`-vlag wordt niet herkend.

source: If the value of the flags field after removing recognized flags is nonzero, the runestone is a cenotaph.
nl: Als de waarde van het `Flags`-veld, na het verwijderen van erkende vlaggen, niet nul is, wordt de runestone beschouwd als een cenotaaf.

source: The `Rune` field contains the name of the rune being etched. If the `Etching` flag is set but the `Rune` field is omitted, a reserved rune name is allocated.
nl: Het `Rune`-veld bevat de naam van de rune die wordt geëtst. Als de `Etching`-vlag is ingesteld maar het `Rune`-veld ontbreekt, wordt een gereserveerde rune-naam toegewezen.

source: The `Premine` field contains the amount of premined runes.
nl: Het `Premine`-veld bevat het aantal voorgemijnde runes.

source: The `Cap` field contains the allowed number of mints.
nl: Het `Cap`-veld bevat het toegestane aantal mints.

source: The `Amount` field contains the amount of runes each mint transaction receives.
nl: Het `Amount`-veld bevat het aantal runes dat elke mint-transactie ontvangt.

source: HeightStart and HeightEnd
nl: HeightStart en HeightEnd

source: The `HeightStart` and `HeightEnd` fields contain the mint's starting and ending absolute block heights, respectively. The mint is open starting in the block with height `HeightStart`, and closes in the block with height `HeightEnd`.
nl: De velden `HeightStart` en `HeightEnd` bevatten respectievelijk de absolute blokhoogtes waarop de mint begint en eindigt. De mint is open vanaf het blok met hoogte `HeightStart` en sluit in het blok met hoogte `HeightEnd`.

source: OffsetStart and OffsetEnd
nl: OffsetStart en OffsetEnd

source: The `OffsetStart` and `OffsetEnd` fields contain the mint's starting and ending block heights, relative to the block in which the etching is mined. The mint is open starting in the block with height `OffsetStart` + `ETCHING_HEIGHT`, and closes in the block with height `OffsetEnd` + `ETCHING_HEIGHT`.
nl: De velden `OffsetStart` en `OffsetEnd` bevatten de relatieve start- en eindblokhoogtes van de mint, ten opzichte van het blok waarin de etching wordt gemined. De mint is open vanaf het blok met hoogte `OffsetStart` + `ETCHING_HEIGHT`, en sluit in het blok met hoogte `OffsetEnd` + `ETCHING_HEIGHT`.

source: The `Mint` field contains the Rune ID of the rune to be minted in this transaction.
nl: Het veld `Mint` bevat de Rune ID van de rune die in deze transactie gemint moet worden.

source: The `Pointer` field contains the index of the output to which runes unallocated by edicts should be transferred. If the `Pointer` field is absent, unallocated runes are transferred to the first non-`OP_RETURN` output.
nl: Het veld `Pointer` bevat de index van de output waaraan runes die niet door edicts zijn toegewezen, moeten worden overgedragen. Als het veld `Pointer` ontbreekt, worden niet-toegewezen runes overgedragen naar de eerste niet-`OP_RETURN` output.

source: Cenotaph
nl: Cenotaaf

source: The `Cenotaph` field is unrecognized.
nl: Het veld `Cenotaph` is niet herkend.

source: The `Divisibility` field, raised to the power of ten, is the number of subunits in a super unit of runes.
nl: Het veld `Divisibility`, verheven tot de macht van tien, is het aantal subeenheden in een supereenheid van runes.

source: For example, the amount `1234` of different runes with divisibility 0 through 3 is displayed as follows:
nl: Bijvoorbeeld, het bedrag van `1234` runes met een divisibility van 0 tot 3 wordt als volgt weergegeven:

source: Display
nl: Weergave

source: Spacers
nl: Spaties

source: The `Spacers` field is a bitfield of `•` spacers that should be displayed between the letters of the rune's name.
nl: Het veld `Spacers` is een bitveld van `•` spaties die moeten worden weergegeven tussen de letters van de naam van de rune.

source: The Nth field of the bitfield, starting from the least significant, determines whether or not a spacer should be displayed between the Nth and N+1th character, starting from the left of the rune's name.
nl: Het N-de veld van het bitveld, beginnend bij de minst significante bit, bepaalt of er al dan niet een spatie moet worden weergegeven tussen de N-de en de N+1-de karakter, beginnend vanaf de linkerkant van de naam van de rune.

source: For example, the rune name `AAAA` rendered with different spacers:
nl: Bijvoorbeeld, de rune-naam `AAAA` weergegeven met verschillende spaties:

source: Trailing spacers are ignored.
nl: Achteraf geplaatste spaties worden genegeerd.

source: The `Symbol` field is the Unicode codepoint of the Rune's currency symbol, which should be displayed after amounts of that rune. If a rune does not have a currency symbol, the generic currency character `¤` should be used.
nl: Het veld `Symbol` is de Unicode-codepunt van het valuta-symbool van de Rune, dat na de bedragen van die rune moet worden weergegeven. Als een rune geen valuta-symbool heeft, moet het algemene valutateken `¤` worden gebruikt.

source: For example, if the `Symbol` is `#` and the divisibility is 2, the amount of `1234` units should be displayed as `12.34 #`.
nl: Bijvoorbeeld, als het `Symbol` `#` is en de deelbaarheid 2 is, zou het bedrag van `1234` eenheden worden weergegeven als `12.34 #`.

source: The `Nop` field is unrecognized.
nl: Het `Nop`-veld is niet herkend.

source: Cenotaphs have the following effects:
nl: Cenotafen hebben de volgende effecten:

source: All runes input to a transaction containing a cenotaph are burned.
nl: Alle runes die worden ingevoerd in een transactie die een cenotaph bevat, worden verbrand.

source: If the runestone that produced the cenotaph contained an etching, the etched rune has supply zero and is unmintable.
nl: Als de runestone die de cenotaph heeft geproduceerd een etching bevatte, heeft de geëtste rune een aanbod van nul en kan deze niet worden gemint.

source: If the runestone that produced the cenotaph is a mint, the mint counts against the mint cap and the minted runes are burned.
nl: Als de runestone die de cenotaph heeft geproduceerd een mint is, telt de mint mee voor de mint cap en worden de geminte runes verbrand.

source: Cenotaphs may be created if a runestone contains an unrecognized even tag, an unrecognized flag, an edict with an output number greater than the number of inputs, a rune ID with block zero and nonzero transaction index, a malformed varint, a non-datapush instruction in the runestone output script pubkey, a tag without a following value, or trailing integers not part of an edict.
nl: Cenotaphs kunnen worden gemaakt als een runestone een niet-herkenbaar even tag bevat, een niet-herkenbaar vlag, een edict met een outputnummer groter dan het aantal inputs, een rune ID met blok nul en een niet-nul transactienummer, een verkeerd geformatteerde varint, een niet-datapush-instructie in het runestone outputscript pubkey, een tag zonder een volgende waarde, of achterblijvende gehele getallen die geen deel uitmaken van een edict.

source: Executing the Runestone
nl: Uitvoeren van de Runestone

source: Runestones are executed in the order their transactions are included in blocks.
nl: Runestones worden uitgevoerd in de volgorde waarin hun transacties in blokken zijn opgenomen.

source: A runestone may contain an etching:
nl: Een runestone kan een etching bevatten:

source: `rune` is the name of the rune to be etched, encoded as modified base-26 integer.
nl: `rune` is de naam van de rune die geëtst moet worden, gecodeerd als een gemodificeerde base-26 integer.

source: Rune names consist of the letters A through Z, with the following encoding:
nl: Rune-namen bestaan uit de letters A tot Z, met de volgende codering:

source: Encoding
nl: Codering

source: And so on and so on.
nl: Enzovoort, enzovoort.

source: Rune names `AAAAAAAAAAAAAAAAAAAAAAAAAAA` and above are reserved.
nl: Rune-namen `AAAAAAAAAAAAAAAAAAAAAAAAAAA` en hoger zijn gereserveerd.

source: If `rune` is omitted a reserved rune name is allocated as follows:
nl: Als `rune` wordt weggelaten, wordt een gereserveerde runenaam toegewezen als volgt:

source: `6402364363415443603228541259936211926` corresponds to the rune name `AAAAAAAAAAAAAAAAAAAAAAAAAAA`.
nl: `6402364363415443603228541259936211926` reageert op de naam van de rune `AAAAAAAAAAAAAAAAAAAAAAAAAAA`.

source: If `rune` is present, it must be unlocked as of the block in which the etching appears.
nl: Als `rune` aanwezig is, moet deze worden ontgrendeld vanaf de block waarin de etching verschijnt.

source: Initially, all rune names of length thirteen and longer, up until the first reserved rune name, are unlocked.
nl: Aanvankelijk worden alle runenamen met een lengte van dertien tekens en langer, tot aan de eerste gereserveerde runenaam, ontgrendeld.

source: Runes begin unlocking in block 840,000, the block in which the runes protocol activates.
nl: Runen beginnen te ontgrendelen in blok 840.000, het blok waarin het runes-protocol wordt geactiveerd.

source: Thereafter, every 17,500 block period, the next shortest length of rune names is continuously unlocked. So, between block 840,000 and block 857,500, the twelve-character rune names are unlocked, between block 857,500 and block 875,000 the eleven character rune names are unlocked, and so on and so on, until the one-character rune names are unlocked between block 1,032,500 and block 1,050,000. See the `ord` codebase for the precise unlocking schedule.
nl: Daarna wordt in elke periode van 17.500 blokken de volgende kortste lengte van runenamen continu ontgrendeld. Dus, tussen blok 840.000 en blok 857.500 worden de runenamen van twaalf tekens ontgrendeld, tussen blok 857.500 en blok 875.000 worden de runenamen van elf tekens ontgrendeld, enzovoort, totdat de runenamen van één teken worden ontgrendeld tussen blok 1.032.500 en blok 1.050.000. Zie de `ord` codebase voor het exacte ontgrendelingsschema.

source: To prevent front running an etching that has been broadcast but not mined, if a non-reserved rune name is being etched, the etching transaction must contain a valid commitment to the name being etched.
nl: Om frontrunning van een etching die is uitgezonden maar nog niet gemined is te voorkomen, moet de etching-transactie, indien een niet-gereserveerde runenaam wordt geëtst, een geldige toewijding aan de te etsen naam bevatten.

source: A commitment consists of a data push of the rune name, encoded as a little-endian integer with trailing zero bytes elided, present in an input witness tapscript where the output being spent has at least six confirmations.
nl: Een toewijding bestaat uit een datapush van de runenaam, gecodeerd als een little-endian geheel getal waarbij de achteraan geplaatste nullen zijn weggelaten, aanwezig in een input witness tapscript waarbij de output die wordt uitgegeven minstens zes bevestigingen heeft.

source: If a valid commitment is not present, the etching is ignored.
nl: Als een geldige toewijding niet aanwezig is, wordt het etsen genegeerd.

source: A runestone may mint a rune by including the rune's ID in the `Mint` field.
nl: Een runestone kan een rune slaan door de ID van de rune op te nemen in het `Mint`-veld.

source: If the mint is open, the mint amount is added to the unallocated runes in the transaction's inputs. These runes may be transferred using edicts, and will otherwise be transferred to the first non-`OP_RETURN` output, or the output designated by the `Pointer` field.
nl: Als de mint open is, wordt het mintbedrag toegevoegd aan de niet-toegewezen runes in de inputs van de transactie. Deze runes kunnen worden overgedragen met behulp van edicten en worden anders overgedragen naar de eerste niet-`OP_RETURN` output of naar de output die is aangewezen door het `Pointer`-veld.

source: Mints may be made in any transaction after an etching, including in the same block.
nl: Mints kunnen in elke transactie worden uitgevoerd na een etching, inclusief in hetzelfde blok.

source: A runestone may contain any number of edicts, which are processed in sequence.
nl: Een runestone kan een onbeperkt aantal edicten bevatten, die in volgorde worden verwerkt.

source: Before edicts are processed, input runes, as well as minted or premined runes, if any, are unallocated.
nl: Voordat edicten worden verwerkt, zijn de invoerrunes, evenals geminte of vooraf gemijnde runes, indien aanwezig, niet toegewezen.

source: Each edict decrements the unallocated balance of rune `id` and increments the balance allocated to transaction outputs of rune `id`.
nl: Elke edict verlaagt de niet-toegewezen balans van rune `id` en verhoogt de balans die is toegewezen aan de transactievermeldingen van rune `id`.

source: If an edict would allocate more runes than are currently unallocated, the `amount` is reduced to the number of currently unallocated runes. In other words, the edict allocates all remaining unallocated units of rune `id`.
nl: Als een edict meer runes zou toewijzen dan er momenteel niet-toegewezen zijn, wordt het `amount` verlaagd tot het aantal momenteel niet-toegewezen runes. Met andere woorden, de edict wijst alle resterende niet-toegewezen eenheden van rune `id` toe.

source: Because the ID of an etched rune is not known before it is included in a block, ID `0:0` is used to mean the rune being etched in this transaction, if any.
nl: Omdat de ID van een gegraveerde rune niet bekend is voordat deze in een blok is opgenomen, wordt ID `0:0` gebruikt om de rune aan te duiden die in deze transactie wordt gegraveerd, indien aanwezig.

source: An edict with `amount` zero allocates all remaining units of rune `id`.
nl: Een edict met een `amount` van nul wijst alle resterende eenheden van rune `id` toe.

source: An edict with `output` equal to the number of transaction outputs allocates `amount` runes to each non-`OP_RETURN` output in order.
nl: Een edict met `output` gelijk aan het aantal transactie-uitgangen wijst `amount` runes toe aan elke niet-`OP_RETURN` uitgang in volgorde.

source: An edict with `amount` zero and `output` equal to the number of transaction outputs divides all unallocated units of rune `id` between each non-`OP_RETURN` output. If the number of unallocated runes is not divisible by the number of non-`OP_RETURN` outputs, 1 additional rune is assigned to the first `R` non-`OP_RETURN` outputs, where `R` is the remainder after dividing the balance of unallocated units of rune `id` by the number of non-`OP_RETURN` outputs.
nl: Een edict met `amount` nul en `output` gelijk aan het aantal transactie-uitgangen verdeelt alle niet-toegewezen eenheden van rune `id` over elke niet-`OP_RETURN` uitgang. Als het aantal niet-toegewezen runes niet deelbaar is door het aantal niet-`OP_RETURN` uitgangen, wordt 1 extra rune toegewezen aan de eerste `R` niet-`OP_RETURN` uitgangen, waarbij `R` de rest is na deling van het saldo van niet-toegewezen eenheden van rune `id` door het aantal niet-`OP_RETURN` uitgangen.

source: If any edict in a runestone has a rune ID with `block` zero and `tx` greater than zero, or `output` greater than the number of transaction outputs, the runestone is a cenotaph.
nl: Als een edict in een runestone een rune-ID heeft met `block` nul en `tx` groter dan nul, of `output` groter dan het aantal transactie-uitgangen, is de runestone een cenotaph.

source: Note that edicts in cenotaphs are not processed, and all input runes are burned.
nl: Let op dat edicts in cenotaphs niet worden verwerkt en alle invoerrunes worden verbrand.

source: What is ordinal theory?
ar: ما هي نظرية أوردينال؟
nl: Wat is Ordinal Theory?

source: Ordinal theory is a protocol for assigning serial numbers to satoshis, the smallest subdivision of a bitcoin, and tracking those satoshis as they are spent by transactions.
ar: نظرية أوردينال هي بروتوكول لتخصيص أرقام تسلسلية للساتوشي، وهي أصغر وحدة فرعية من البيتكوين، ويمكن تتبع تلك الساتوشي أثناء استعمالها من خلال المعاملات.
nl: Ordinal Theory is een protocol voor het toewijzen van serienummers aan satoshi's, de kleinste onderverdeling van een bitcoin, en het volgen van die satoshi's naarmate ze worden uitgegeven door transacties.

source: These serial numbers are large numbers, like this 804766073970493. Every satoshi, which is ¹⁄₁₀₀₀₀₀₀₀₀ of a bitcoin, has an ordinal number.
ar: تلك الأرقام التسلسلية هي أرقام كبيرة، مثل هذا الرقم 804766073970493. كل ساتوشي، والذي هو واحد من أصل مليون من بيتكوين واحد، لديه رقم ترتيبي.
nl: Deze serienummers zijn grote getallen, zoals 804766073970493. Elke satoshi, die ¹⁄₁₀₀₀₀₀₀₀₀ van een bitcoin is, heeft een ordinaal nummer.
