Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: Such satoshis are termed "exotic". Which satoshis are exotic and what makes them so is subjective. Ordinal theorists are encouraged to seek out exotics based on criteria of their own devising.
ar: تُعرف هذه الساتوشيات بـ "الأنواع النادرة". أي الساتوشيات التي تُعتبر غير عادية وما يجعلها كذلك هو موضوعي. يُشجع المنظرين Ordinals على البحث عن الساتوشيات الغريبة بناءً على معايير محددة.
nl: Dergelijke satoshis worden "exoten" genoemd. Welke satoshis exotisch zijn en wat hen bijzonder maakt, is subjectief. Ordinal theoretici worden aangemoedigd om op zoek te gaan naar exoten op basis van zelfgekozen criteria.

source: Satoshis can be inscribed with arbitrary content, creating Bitcoin-native digital artifacts. Inscribing is done by sending the satoshi to be inscribed in a transaction that reveals the inscription content on-chain. This content is then inextricably linked to that satoshi, turning it into an immutable digital artifact that can be tracked, transferred, hoarded, bought, sold, lost, and rediscovered.
ar: يمكن تحديد الساتوشيات بمحتوى تقني بما يخلق القطع الفنية الرقمية الأصلية digital artifacts للبيتكوين. يتم ذلك من خلال إرسال الساتوشي المراد الكتابة عليه في عملية تداول تكشف عن محتوى الكتابة على الشبكة. يتم ربط هذا المحتوى بشكل لا يمكن فصله بالساتوشي، مما يحوله إلى قطعة فنية رقمية لا يمكن تغييرها يمكن تتبعها وتداولها وتخزينها وشرائها وبيعها ووفقدها واكتشافها مرة أخرى.
nl: Satoshis kunnen worden ingeschreven met willekeurige inhoud, waardoor Bitcoin-native digitale artefacten ontstaan. Inschrijven gebeurt door de satoshi die moet worden ingeschreven te verzenden in een transactie die de inschrijvingsinhoud on-chain onthult. Deze inhoud wordt dan onlosmakelijk verbonden met die satoshi, waardoor het een onveranderlijk digitaal artefact wordt dat kan worden gevolgd, overgedragen, opgeslagen, gekocht, verkocht, verloren en herontdekt.

source: Archaeology
ar: الآثار
nl: Archeologie

source: A lively community of archaeologists devoted to cataloging and collecting early NFTs has sprung up. [Here's a great summary of historical NFTs by Chainleft.](https://mirror.xyz/chainleft.eth/MzPWRsesC9mQflxlLo-N29oF4iwCgX3lacrvaG9Kjko)
ar: قد ظهر مجتمع نشط من علماء الآثار المكرسين لتصنيف وجمع العملات الفنية الرقمية المبكرة (NFTs) مؤخرًا. [ها هو ملخص رائع لـ NFTs التاريخية من قبل Chainleft.](https://mirror.xyz/chainleft.eth/MzPWRsesC9mQflxlLo-N29oF4iwCgX3lacrvaG9Kjko)
nl: Een levendige gemeenschap van archeologen, toegewijd aan het catalogiseren en verzamelen van vroege NFT's, is ontstaan. [Hier is een uitstekend overzicht van historische NFT's door Chainleft.](https://mirror.xyz/chainleft.eth/MzPWRsesC9mQflxlLo-N29oF4iwCgX3lacrvaG9Kjko).

source: A commonly accepted cut-off for early NFTs is March 19th, 2018, the date the first ERC-721 contract, [SU SQUARES](https://tenthousandsu.com/), was deployed on Ethereum.
ar: تاريخ معروف عمومًا للـ NFTs المبكرة هو 19 مارس 2018، وهو تاريخ نشر أول عقد ERC-721، وهو عقد [SU SQUARES](https://tenthousandsu.com/)، على منصة إيثيريوم.
nl: Een algemeen geaccepteerde grens voor vroege NFT's is 19 maart 2018, de datum waarop het eerste ERC-721-contract, SU SQUARES [SU SQUARES] (https://tenthousandsu.com/), werd geïmplementeerd op Ethereum.

source: Whether or not ordinals are of interest to NFT archaeologists is an open question! In one sense, ordinals were created in early 2022, when the Ordinals specification was finalized. In this sense, they are not of historical interest.
ar: سواء كانت أوردينال مثيرة لاهتمام علماء الآثار لـ NFTs او لا فهو سؤال مفتوح! من ناحية، تم إنشاء أوردينالس في أوائل عام 2022، عندما تم تحديد مواصفاتها. من هذا المعنى، فهي ليست ذات أهمية تاريخية.
nl: Of ordinals interessant zijn voor NFT-archeologen is een open vraag! In zekere zin werden ordinals gecreëerd begin 2022, toen de Ordinals-specificatie werd voltooid. In deze zin zijn ze niet van historisch belang.

source: In another sense though, ordinals were in fact created by Satoshi Nakamoto in 2009 when he mined the Bitcoin genesis block. In this sense, ordinals, and especially early ordinals, are certainly of historical interest.
ar: من ناحية أخرى، تم إنشاء أوردينالس في الواقع من قبل ساتوشي ناكاموتو في عام 2009 عندما قام بتعدين genesis block للبيتكوين. من هذا المعنى، تكون أوردينالس ، وخصوصا المبكرة، من ذوي الاهتمام التاريخي بالتأكيد.
nl: In een andere zin echter, werden ordinals in feite gecreëerd door Satoshi Nakamoto in 2009 toen hij het Bitcoin-genesisblok mijnbouwde. In deze zin zijn ordinals, en vooral vroege ordinals, zeker van historisch belang.

source: Many ordinal theorists favor the latter view. This is not least because the ordinals were independently discovered on at least two separate occasions, long before the era of modern NFTs began.
ar: العديد من نظريات أوردينالس تفضل الرأي الأخير. ويكون ذلك ليس على الأقل لأن تم اكتشافها بشكل مستقل في مرتين على الأقل في مناسبتين منفصلتين، وذلك قبل عصر NFTs الحديث.
nl: Veel ordinale theoretici geven de voorkeur aan deze laatste opvatting. Dit is niet in de laatste plaats omdat de ordinals op minstens twee afzonderlijke gelegenheden onafhankelijk zijn ontdekt, lang voordat het tijdperk van moderne NFT's begon.

source: On August 21st, 2012, Charlie Lee [posted a proposal to add proof-of-stake to Bitcoin to the Bitcoin Talk forum](https://bitcointalk.org/index.php?topic=102355.0). This wasn't an asset scheme, but did use the ordinal algorithm, and was implemented but never deployed.
ar: في 21 أغسطس 2012، قام تشارلي لي [بنشر اقتراح لإضافة إثبات حصة إلى بيتكوين](https://bitcointalk.org/index.php?topic=102355.0) على موقع Bitcoin Talk. لم يكن هذا مخطط له، ولكنه استخدم خوارزمية ordinal ، وتم تنفيذها ولكن لم يتم نشرها.
nl: Op 21 augustus 2012 plaatste Charlie Lee een voorstel om proof-of-stake aan Bitcoin toe te voegen op het Bitcoin Talk-forum. Dit was geen activa-schema, maar gebruikte wel het ordinale algoritme en werd geïmplementeerd, maar nooit ingezet.

source: On October 8th, 2012, jl2012 [posted a scheme to the same forum](https://bitcointalk.org/index.php?topic=117224.0) which uses decimal notation and has all the important properties of ordinals. The scheme was discussed but never implemented.
ar: في 8 أكتوبر 2012، قام jl2012 بنشر [خطة على نفس الموقع تستخدم تدوين العددي ولديها جميع الخصائص المهمة](https://bitcointalk.org/index.php?topic=117224.0) ل أوردينال. تم مناقشة الخطة ولكن لم يتم تنفيذها.
nl: Op 8 oktober 2012 [plaatste jl2012 een schema op hetzelfde forum](https://bitcointalk.org/index.php?topic=117224.0) dat gebruikmaakt van decimale notatie en alle belangrijke eigenschappen van ordinals heeft. Het schema werd besproken maar nooit geïmplementeerd.

source: These independent inventions of ordinals indicate in some way that ordinals were discovered, or rediscovered, and not invented. The ordinals are an inevitability of the mathematics of Bitcoin, stemming not from their modern documentation, but from their ancient genesis. They are the culmination of a sequence of events set in motion with the mining of the first block, so many years ago.
ar: هذه الاختراعات المستقلة ل أوردينال تشير بطريقة ما إلى أن تم اكتشافها أو اكتشافها مرة أخرى، وليس اختراعها. إن أوردينال نتيجة حتمية لرياضيات البيتكوين، وذلك لا يعود إلى وثائقها الحديثة، ولكن من نشأتهم القديمة. إنها ذروة تسلسل من الأحداث التي تم تشغيلها مع البلوك الأول، منذ سنوات عديدة.
nl: Deze onafhankelijke uitvindingen van ordinals geven op een bepaalde manier aan dat ordinals zijn ontdekt, of herontdekt, en niet uitgevonden. De ordinals zijn een onvermijdelijkheid van de wiskunde van Bitcoin, niet voortkomend uit hun moderne documentatie, maar uit hun oude oorsprong. Ze zijn het resultaat van een reeks gebeurtenissen die in gang zijn gezet met het mijnen van het eerste blok, zoveel jaren geleden.

source: Imagine a physical artifact. A rare coin, say, held safe for untold years in the dark, secret clutch of a Viking hoard, now dug from the earth by your grasping hands. It…
ar: تخيل تحفه أثرية في الواقع. عملة نادرة، على سبيل المثال، عمله سرية للفايكنج محفوظة بأمان لسنوات طويله و مخبأة ، ثم عثرت عليها أنت. فهي...
nl: Stel je een fysiek artefact voor. Een zeldzame munt bijvoorbeeld, jarenlang veilig bewaard in de donkere, geheime schat van een Vikingbuit, nu opgegraven door jouw handen. Het…

source: …has an owner. You. As long as you keep it safe, nobody can take it from you.
ar: ...لديها مالك. وهو أنت. طالما أنك تحتفظ بها بأمان، لا يمكن لأحد أن يأخذها منك.
nl: …heeft een eigenaar. Jij. Zolang je het veilig houdt, kan niemand het van je afnemen.

source: …is complete. It has no missing parts.
ar: ... كاملة. ليس لديها أجزاء ناقصة.
nl: …is compleet. Het mist geen onderdelen.

source: …can only be changed by you. If you were a trader, and you made your way to 18th century China, none but you could stamp it with your chop-mark.
ar: ... يمكن تغييرها فقط بواسطتك. إذا كنت تاجرًا، ووصلت إلى الصين في القرن الثامن عشر، لا يمكن لأحد سواك أن يختمها بعلامتك التجارية.
nl: …kan alleen door jou worden veranderd. Als je een handelaar was en je zou naar het 18e-eeuwse China reizen, dan zou niemand anders dan jij het met jouw merkteken kunnen stempelen.

source: …can only be disposed of by you. The sale, trade, or gift is yours to make, to whomever you wish.
ar: ...مكن التخلص منها فقط بواسطتك. البيع، التبادل، أو الهدية لمن تشاء هو قرارك وحدك.
nl: …kan alleen door jou worden weggedaan. De verkoop, ruil of schenking is aan jou om te doen, aan wie je maar wilt.

source: What are digital artifacts? Simply put, they are the digital equivalent of physical artifacts.
ar: ما هي الأصول/التحف الرقمية؟ ببساطة، إنها المعادلة الرقمية للتحفة الفعلية.
nl: Wat zijn digitale artefacten? Simpel gezegd, ze zijn het digitale equivalent van fysieke artefacten.

source: For a digital thing to be a digital artifact, it must be like that coin of yours:
ar: لكي يكون الشيء الرقمي تحفة رقمية، يجب أن يكون مثل تلك العملة التي لديك:
nl: Voor een digitaal object om een digitaal artefact te zijn, moet het zijn zoals die munt van jou:

source: Digital artifacts can have owners. A number is not a digital artifact, because nobody can own it.
ar: التحفه الرقمية يمكن أن تمتلك أصحابًا. الرقم ليس تحفة رقمية، لأنه لا يمكن لأحد أن يمتلكه.
nl: Digitale artefacten kunnen eigenaren hebben. Een getal is geen digitaal artefact, omdat niemand het kan bezitten.

source: Digital artifacts are complete. An NFT that points to off-chain content on IPFS or Arweave is incomplete, and thus not a digital artifact.
ar: التحف الرقمية هي كاملة. ال NFT الذي يشير إلى محتوى خارج الشبكة على IPFS أو Arweave غير كامل، وبالتالي ليس تحفة رقمية.
nl: Digitale artefacten zijn compleet. Een NFT die verwijst naar off-chain content op IPFS of Arweave is incompleet en dus geen digitaal artefact.

source: Digital artifacts are permissionless. An NFT which cannot be sold without paying a royalty is not permissionless, and thus not a digital artifact.
ar: التحف الرقمية هي غير مقيدة بأذونات. ال NFT لا يمكن بيعها بدون دفع عمولة وبذالك هي مقيدة بأذونات، وبالتالي ليست تحفة رقمية.
nl: Digitale artefacten zijn toestemmingloos. Een NFT die niet verkocht kan worden zonder het betalen van een royalty is niet toestemmingloos en dus geen digitaal artefact.

source: Digital artifacts are uncensorable. Perhaps you can change a database entry on a centralized ledger today, but maybe not tomorrow, and thus one cannot be a digital artifact.
ar: التحف الرقمية غير قابلة للرقابة. قد يكون لديك الإمكانية بتغيير قاعدة البيانات المركزي على ledger اليوم، ولكن ربما لا يمكن ذلك غدًا، وبالتالي لا يمكن أن تكون تحفه رقمية.
nl: Digitale artefacten zijn oncensureerbaar. Misschien kun je vandaag een database-invoer op een gecentraliseerde grootboek wijzigen, maar misschien morgen niet meer, en dus kan dat geen digitaal artefact zijn.

source: Digital artifacts are immutable. An NFT with an upgrade key is not a digital artifact.
ar: التحف الرقمية لا تتغير. NFT مع قابليه الترقية لا تعد تحفة رقمية.
nl: Digitale artefacten zijn onveranderlijk. Een NFT met een upgrade-sleutel is geen digitaal artefact.

source: The definition of a digital artifact is intended to reflect what NFTs _should_ be, sometimes are, and what inscriptions _always_ are, by their very nature.
ar: تعريف التحف الرقمية يهدف إلى اثبات ما يجب أن يكون ال NFTs، وفي بعض الأحيان ما هي عليه، والتحف هي _دائمًا_ كذلك بالطبيعة التامة.
nl: De definitie van een digitaal artefact is bedoeld om te weerspiegelen wat NFT's zouden moeten zijn, soms zijn, en wat inscriptions altijd zijn, door hun aard.

source: Inscriptions inscribe sats with arbitrary content, creating bitcoin-native digital artifacts, more commonly known as NFTs. Inscriptions do not require a sidechain or separate token.
ar: الأنسكريبشين توصف الساتوشي بمحتوى تعسفي، مما يخلق محتويات رقمية digital artifacts منشأة في البيتكوين، والمعروفة عادة باسم NFTs. وهي لا تحتاج إلى شبكه جانبية أو عملات منفصله.
nl: Inscripties inscriberen sats met willekeurige inhoud, waardoor bitcoin-native digitale artefacten worden gecreëerd, die beter bekend staan als NFT's. Inscripties vereisen geen sidechain of apart token.

source: These inscribed sats can then be transferred using bitcoin transactions, sent to bitcoin addresses, and held in bitcoin UTXOs. These transactions, addresses, and UTXOs are normal bitcoin transactions, addresses, and UTXOS in all respects, with the exception that in order to send individual sats, transactions must control the order and value of inputs and outputs according to ordinal theory.
ar: هذه الساتوشي يمكن ارسالها عن طريق شبكه بيتكوين والاحتفاظ بها في محافظ البيتكوين على شكل UTXOs (مخرجات المعاملات الغير مُنفقة) في البيتكوين. هذه الصفقات والعناوين ومخرجات الصفقات هي عمليات وعناوين ومخرجات صفقات بيتكوين عادية بكل معنى الكلمة، باستثناء أنه من أجل إرسال ساتوشيات فردية، يجب أن تتحكم الصفقات في ترتيب وقيمة المدخلات والمخرجات وفقًا لنظرية أوردينال.
nl: Deze geïnscribeerde sats kunnen vervolgens worden overgedragen via bitcoin-transacties, verzonden naar bitcoin-adressen en vastgehouden in bitcoin-UTXO's. Deze transacties, adressen en UTXO's zijn in alle opzichten normale bitcoin-transacties, adressen en UTXO's, met als uitzondering dat om individuele sats te verzenden, transacties de volgorde en waarde van inputs en outputs moeten beheren volgens de ordinale theorie.

source: The inscription content model is that of the web. An inscription consists of a content type, also known as a MIME type, and the content itself, which is a byte string. This allows inscription content to be returned from a web server, and for creating HTML inscriptions that use and remix the content of other inscriptions.
ar: نموذج محتوى أوردينال يتبع نمط الويب. يتألف كل انسكريبشين Inscription في نوع المحتوى، والمعروف أيضا باسم MIME، جنبا إلى جنب مع المحتوى نفسه بصيغة سلسلة بايت. يسمح هذا الإعداد يسمح محتوى الأنسكريبشين الى العودة من خادم الويب، مما يتيح إنشاء Inscription HTML تستخدم وتعيد تكوين محتوى Inscription أخرى.
nl: Het inscriptie-inhoudsmodel is dat van het web. Een inscriptie bestaat uit een inhoudstype, ook wel bekend als een MIME-type, en de inhoud zelf, wat een bytestring is. Dit maakt het mogelijk om inscriptie-inhoud van een webserver op te halen en HTML-inscripties te maken die de inhoud van andere inscripties gebruiken en remixen.

source: Inscription content is entirely on-chain, stored in taproot script-path spend scripts. Taproot scripts have very few restrictions on their content, and additionally receive the witness discount, making inscription content storage relatively economical.
ar: جميع محتوى الأنسكريبشين يتم تخزينه بالكامل على الشبكة، وذلك في البرامج النصية الخاصة بسحب مسارات تابروت (Taproot) . تتمتع برامج تابروت بقليل من القيود على محتواها وبالإضافة إلى ذلك تحصل على خصم الشاهد، مما يجعل تخزين المحتوى مكلفًا نسبيًا.
nl: Inscriptie-inhoud bevindt zich volledig on-chain, opgeslagen in taproot script-path spendscripts. Taproot-scripts hebben zeer weinig beperkingen op hun inhoud en krijgen bovendien de getuigenkorting, waardoor het opslaan van inscriptie-inhoud relatief voordelig is.

source: Since taproot script spends can only be made from existing taproot outputs, inscriptions are made using a two-phase commit/reveal procedure. First, in the commit transaction, a taproot output committing to a script containing the inscription content is created. Second, in the reveal transaction, the output created by the commit transaction is spent, revealing the inscription content on-chain.
ar: نظرًا لطبيعة صفقات برامج تابروت، التي يمكن أن تتم فقط من مخرجات تابروت الموجودة بالفعل، يتم إنشاء الأنسكريبشين على مرحليتين باستخدام عملية تأكيد/كشف . في البداية، ينشئ صفقة تأكيد مخرج تابروت يلتزم ببرنامج يحتوي على محتوى الأنسكريبشين. في المرحلة التالية، تنفق عمليه الكشف المخرج الذي تم إنشاؤه في عمليه التأكيد، مما يكشف عن المحتوى على الشبكة البيانية.
nl: Aangezien taproot-scriptspends alleen kunnen worden gedaan vanuit bestaande taproot-uitgangen, worden inscripties gemaakt met behulp van een twee-fasen commit/reveal-procedure. Eerst wordt in de commit-transactie een taproot-uitgang gecreëerd die zich verbindt aan een script dat de inscriptie-inhoud bevat. Ten tweede wordt in de reveal-transactie de output die door de commit-transactie is gecreëerd, besteed, waardoor de inscriptie-inhoud on-chain wordt onthuld.

source: Inscription content is serialized using data pushes within unexecuted conditionals, called "envelopes". Envelopes consist of an `OP_FALSE OP_IF … OP_ENDIF` wrapping any number of data pushes. Because envelopes are effectively no-ops, they do not change the semantics of the script in which they are included, and can be combined with any other locking script.
ar: يتم تسلسل المحتوى باستخدام دفعات بيانات ضمن شروط غير مؤداه، والتي تُعرف بـ "envelopes". تتألف من أمر `OP_FALSE OP_IF … OP_ENDIF` الذي يحيط بأي عدد من دفعات البيانات. نظرًا لأنها تعمل كعمليات فارغة بفعالية، فإنها لا تغير دلالة النص البرمجي الذي يتم تضمينها فيه، ويمكن دمجها مع أي نص برمجي مقفول آخر .
nl: Inscriptie-inhoud wordt geserialiseerd met behulp van datapushes binnen niet-uitgevoerde conditionals, zogenaamde "enveloppen". Enveloppen bestaan uit een `OP_FALSE OP_IF … OP_ENDIF` die een willekeurig aantal datapushes omhult. Omdat enveloppen in feite no-ops zijn, veranderen ze de semantiek van het script waarin ze zijn opgenomen niet, en kunnen ze worden gecombineerd met elk ander vergrendelingsscript.

source: A text inscription containing the string "Hello, world!" is serialized as follows:
ar: على سبيل المثال يوجد نص انسكريبشين يحتوي على جملة : "Hello, world!" يتسلسل على النحو التالي:
nl: Een tekstinscriptie met de string "Hello, world!" wordt als volgt geserialiseerd:

source: First the string `ord` is pushed, to disambiguate inscriptions from other uses of envelopes.
ar: أولاً، يتم دفع سلسلة `ord` للتفريق بين الكتابات وبين استخدامات أخرى للظروف.
nl: Eerst wordt een push uitgevoerd met de string `ord` om aan te geven dat de inscriptie zal worden gebruikt.

source: `OP_PUSH 1` indicates that the next push contains the content type, and `OP_PUSH 0`indicates that subsequent data pushes contain the content itself. Multiple data pushes must be used for large inscriptions, as one of taproot's few restrictions is that individual data pushes may not be larger than 520 bytes.
nl: `OP_PUSH 1` Geeft aan dat de volgende push het type inhoud is, en `OP_PUSH 0` geeft aan dat de volgende gegevens in de push de inhoud bevatten die wordt toegevoegd. Voor grote inscripties moeten meerdere gegevenspushes worden gebruikt, aangezien een van de weinige beperkingen van Taproot is dat een gegevenspush niet groter mag zijn dan 520 bytes.

source: The inscription content is contained within the input of a reveal transaction, and the inscription is made on the first sat of its input if it has no pointer field. This sat can then be tracked using the familiar rules of ordinal theory, allowing it to be transferred, bought, sold, lost to fees, and recovered.
nl: De inhoud van de inscriptie bevindt zich binnen de invoer van een onthullingstransactie, en de inscriptie wordt gecreëerd in de eerste satoshi van zijn invoer, indien deze geen pointer-veld heeft. Deze satoshi kan worden gevolgd volgens de regels van de ordinale theorie, waardoor hij kan worden overgedragen, gekocht, verkocht, verloren in kosten en hersteld.

source: The data model of inscriptions is that of a HTTP response, allowing inscription content to be served by a web server and viewed in a web browser.
ar: نموذج بيانات الكتابات هو نفس نموذج الاستجابة HTTP، مما يتيح لمحتوى انسكريبشين أن يتم تقديمه من خلال خادم ويب وعرضه في متصفح ويب.
nl: Het gegevensmodel van de inscripties is dat van een HTTP-respons, waardoor de inhoud van de inscriptie kan worden verkregen via een webserver en bekeken kan worden in een webbrowser.

source: Fields
ar: الحقول
nl: Velden

source: Inscriptions may include fields before an optional body. Each field consists of two data pushes, a tag and a value.
ar: قد تشمل الأنسكريبشين حقولًا قبل هيكل اختياري. يتألف كل حقل من توجيهين للبيانات، علامة وقيمة.
nl: Inscripties kunnen velden bevatten vóór een optionele body. Elk veld bestaat uit twee gegevenspushes: een label en een waarde.

source: Currently, there are six defined fields:
nl: Momenteel zijn er zes gedefinieerde velden:

source: `content_type`, with a tag of `1`, whose value is the MIME type of the body.
nl: `content_type`, met een label van `1`, waarvan de waarde het MIME-type van de body is.

source: `pointer`, with a tag of `2`, see [pointer docs](inscriptions/pointer.md).
nl: `pointer`, met een label van `2`, zie [documentatie van pointers](inscriptions/pointer.md).

source: `parent`, with a tag of `3`, see [provenance](inscriptions/provenance.md).
nl: `parent`, met een label van `3`, zie [herkomst](inscriptions/provenance.md).

source: `metadata`, with a tag of `5`, see [metadata](inscriptions/metadata.md).
nl: `metadata`, met een label van `5`, zie [metadata](inscriptions/metadata.md).

source: `metaprotocol`, with a tag of `7`, whose value is the metaprotocol identifier.
nl: `metaprotocol`, met een label van `7`, waarvan de waarde de identificator van het metaprotocol is.

source: `content_encoding`, with a tag of `9`, whose value is the encoding of the body.
nl: `content_encoding`, met een label van `9`, waarvan de waarde de codering van de body is.

source: `delegate`, with a tag of `11`, see [delegate](inscriptions/delegate.md).
nl: `delegate`, met een label van `11`, zie [gedelegeerde](inscriptions/delegate.md).

source: The beginning of the body and end of fields is indicated with an empty data push.
ar: يتم توضيح بداية الهيكل ونهاية الحقول باستخدام دفعة بيانات فارغة.
nl: Om het begin van de body en het einde van de velden aan te geven, wordt een lege gegevenspush uitgevoerd.

source: Unrecognized tags are interpreted differently depending on whether they are even or odd, following the "it's okay to be odd" rule used by the Lightning Network.
ar: العلامات غير المعترف بها تفسر بشكل مختلف اعتمادًا على ما إذا كانت زوجية أم فردية، وذلك وفقًا لقاعدة "من الجيد أن تكون فردية" المستخدمة في شبكة Lightning.
nl: Niet-herkende labels worden op verschillende manieren geïnterpreteerd, afhankelijk van of ze even of oneven zijn, volgens de regel "oneven is toegestaan" die wordt gebruikt door het Lightning Network.

source: Even tags are used for fields which may affect creation, initial assignment, or transfer of an inscription. Thus, inscriptions with unrecognized even fields must be displayed as "unbound", that is, without a location.
ar: تُستخدم العلامات الزوجية للحقول التي قد تؤثر على إنشاء الأنسكريبشين، وتعيينه الأولي، أو نقله. بالتالي، يجب عرض الأنسكريبشين ذات الحقول الزوجية غير المعترف بها على أنها "غير مُرتبطة"، أي بدون موقع.
nl: Even labels worden gebruikt voor velden die de creatie, initiële toewijzing of overdracht van een inscriptie kunnen beïnvloeden. Daarom moeten inscripties met niet-herkende even labels worden weergegeven als "niet-gelinkt", dat wil zeggen zonder locatie.
