Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: Does ordinal theory require a side chain, a separate token, or changes to Bitcoin?
ar: هل تتطلب نظرية أوردينال شبكه فرعية (Sidechain) أو عمله منفصله (Token)، أو تغييرات في البيتكوين؟
nl: Vereist ordinale theorie een zij-keten, een aparte token, of veranderingen aan Bitcoin?

source: Nope! Ordinal theory works right now, without a side chain, and the only token needed is bitcoin itself.
ar: لا! نظرية أوردينال تعمل حاليًا دون الحاجة إلى شبكه فرعية أو عمله منفصله، والعملة الوحيدة المطلوبة هي بيتكوين نفسه.
nl: Nee! Ordinale theorie werkt nu al, zonder een zij-keten, en de enige token die nodig is, is bitcoin zelf.

source: What is ordinal theory good for?
ar: ما فائدة نظرية أوردينال؟
nl: Waar is ordinale theorie goed voor?

source: Collecting, trading, and scheming. Ordinal theory assigns identities to individual satoshis, allowing them to be individually tracked and traded, as curios and for numismatic value.
ar: لجمع وتداول والتخطيطات. تعني إعطاء هويه للساتوشيات الفردية Assign identities to individual satoshis، وتسمح لها بأن تتمتع بإمكانية التتبع والتداول بشكل فردي، وذلك لأغراض الفضول والقيمة النقدية.
nl: Verzamelen, handelen en plannen. Ordinale theorie kent identiteiten toe aan individuele satoshis, waardoor ze afzonderlijk kunnen worden gevolgd en verhandeld, als curiosa en voor numismatische waarde.

source: Ordinal theory also enables inscriptions, a protocol for attaching arbitrary content to individual satoshis, turning them into bitcoin-native digital artifacts.
ar: تمكّن نظرية أوردينال أيضًا من الإنسكريبشين، وهو بروتوكول يتيح لربط محتوى تعسفي بالساتوشيس الفردية، مما يحولها إلى فنون رقمية (digital artifacts) من نوع بيتكوين الأصلي.
nl: De ordinale theorie maakt ook inscripties mogelijk, een protocol voor het aanhechten van willekeurige inhoud aan individuele satoshis, waardoor ze digitale artefacten van bitcoin-native aard worden.

source: How does ordinal theory work?
ar: كيف تعمل نظرية أوردينال؟
nl: Hoe werkt de ordinale theorie?

source: Ordinal numbers are assigned to satoshis in the order in which they are mined. The first satoshi in the first block has ordinal number 0, the second has ordinal number 1, and the last satoshi of the first block has ordinal number 4,999,999,999.
ar: تُخصص أرقام أوردينال للساتوشيس بحسب ترتيب تعدينها. أول ساتوشي في البلوك الأول لديها رقم ترتيبي صفر 0، والثانية لها رقم ترتيبي 1، وآخر ساتوشي في البلوك الأول لديها رقم ترتيبي 4,999,999,999.
nl: Ordinale nummers worden toegekend aan satoshis in de volgorde waarin ze worden gemijnd. De eerste satoshi in het eerste blok heeft het ordinale nummer 0, de tweede heeft ordinale nummer 1, en de laatste satoshi van het eerste blok heeft ordinale nummer 4.999.999.999.

source: Satoshis live in outputs, but transactions destroy outputs and create new ones, so ordinal theory uses an algorithm to determine how satoshis hop from the inputs of a transaction to its outputs.
ar: الساتوشيس تعيش في output ، لكن المعاملات تدمر outputs وتصنع outputs جديدة، لذا يستخدم نظرية أوردينال خوارزمية لتحديد كيفية تنقل الساتوشيس من مداخل المعاملة إلى مخرجاتها.
nl: Satoshis bevinden zich in outputs, maar transacties vernietigen outputs en creëren nieuwe. Daarom gebruikt ordinal theory een algoritme om te bepalen hoe satoshis van de inputs van een transactie naar de outputs hoppen.

source: Fortunately, that algorithm is very simple.
ar: لحسن الحظ، هذه الخوارزمية بسيطة جدًا.
nl: Gelukkig is dat algoritme heel eenvoudig.

source: Satoshis transfer in first-in-first-out order. Think of the inputs to a transaction as being a list of satoshis, and the outputs as a list of slots, waiting to receive a satoshi. To assign input satoshis to slots, go through each satoshi in the inputs in order, and assign each to the first available slot in the outputs.
ar: ترسل الساتوشي بترتيب الواصل الأول هو الخارج الأول. اعتبر مداخل المعاملة قائمة بالساتوشيس، والمخرجات قائمة بالفتحات، تنتظر استقبال الساتوشي. لتعيين الساتوشي المدخلة إلى الفتحات، قم بمراجعة كل ساتوشي في المداخل ب بالترتيب، وقم بتعيين كل منها إلى أول فتحة متاحة في المخرجات.
nl: Satoshis worden overgedragen in een first-in-first-out volgorde. Denk aan de invoeren van een transactie als een lijst van satoshi's, en de uitgangen als een lijst van slots die wachten om een satoshi te ontvangen. Om input satoshi's aan slots toe te wijzen, doorloop je elke satoshi in de invoeren in volgorde en wijs je elke toe aan het eerste beschikbare slot in de uitgangen.

source: Let's imagine a transaction with three inputs and two outputs. The inputs are on the left of the arrow and the outputs are on the right, all labeled with their values:
ar: لنتخيل معاملة تحتوي على ثلاثة مداخل ومخرجين. تظهر المداخل على يمين السهم والمخرجات على يساره، وكل منها مُحدد بقيمته:
nl: Stel je een transactie voor met drie invoeren en twee uitgangen. De invoeren staan links van de pijl en de uitgangen staan rechts, allemaal gelabeld met hun waarden:

source: Now let's label the same transaction with the ordinal numbers of the satoshis that each input contains, and question marks for each output slot. Ordinal numbers are large, so let's use letters to represent them:
ar: الآن لنضع علامات على نفس المعاملة باستخدام أرقام ترتيبية للساتوشيس في كل مدخل، وعلامات استفهام لكل فتحة خروج. الأرقام الترتيبية كبيرة، لذلك دعونا نستخدم الحروف لتمثيلها:
nl: Laten we nu dezelfde transactie labelen met de ordinale nummers van de satoshis die elke invoer bevat, en vraagtekens voor elke uitgangsslot. Ordinale nummers zijn groot, dus laten we letters gebruiken om ze te vertegenwoordigen:

source: To figure out which satoshi goes to which output, go through the input satoshis in order and assign each to a question mark:
ar: لمعرفة أي ساتوشي سيذهب إلى أي فتحة، قم بمراجعة الساتوشيس المدخلة بالترتيب وقم بتعيين كل واحد إلى علامة استفهام:
nl: Om te bepalen welke satoshi naar welke output gaat, doorloop je de input-satoshis in volgorde en wijs je er een toe aan elk vraagteken:

source: What about fees, you might ask? Good question! Let's imagine the same transaction, this time with a two satoshi fee. Transactions with fees send more satoshis in the inputs than are received by the outputs, so to make our transaction into one that pays fees, we'll remove the second output:
ar: قد تسأل ماذا عن الرسوم؟ سؤال جيد! لنتخيل نفس المعاملة، وهذه المرة مع اثنان ساتوشي كرسوم. المعاملات ذات الرسوم ترسل مزيدًا من الساتوشي في المداخل مقارنة بما يتم استقباله في المخارج، لذا من أجل تحويل معاملتنا إلى معاملة تدفع رسومًا، سنقوم بإزالة الفتحة الثانية:
nl: Je zou je kunnen afvragen: "Hoe zit het met vergoedingen?" Goede vraag! Laten we ons dezelfde transactie voorstellen, maar deze keer met een vergoeding van twee satoshis. Transacties met vergoedingen sturen meer satoshis in de inputs dan er door de outputs worden ontvangen, dus om onze transactie er een te maken die vergoedingen betaalt, verwijderen we de tweede output:

source: The satoshis <var>e</var> and <var>f</var> now have nowhere to go in the outputs:
nl: De satoshis <var>e</var> en <var>f</var> hebben nu geen plek om naartoe te gaan in de outputs:

source: So they go to the miner who mined the block as fees. [The BIP](https://github.com/ordinals/ord/blob/master/bip.mediawiki) has the details, but in short, fees paid by transactions are treated as extra inputs to the coinbase transaction, and are ordered how their corresponding transactions are ordered in the block. The coinbase transaction of the block might look like this:
ar: لذا سيذهبون إلى عائد العامل الذي قام بتعدين الكتلة كرسوم.[The BIP](https://github.com/ordinals/ord/blob/master/bip.mediawiki) المعيار المعني به هنا يمتلك التفاصيل، لكن بشكل موجز، يتم التعامل مع الرسوم التي يتم دفعها من خلال المعاملات على أنها مداخل إضافية لمعاملة العملة الأساسية، وتتم ترتيبها بناءً على ترتيب معاملاتها المقابلة في الكتلة. قد يبدو معامل العملة الأساسية في البلوك كما يلي:
nl: Dus gaan ze als transactiekosten naar de miner die het blok heeft gemined. [De BIP](https://github.com/ordinals/ord/blob/master/bip.mediawiki) bevat de details, maar kort gezegd worden transactiekosten behandeld als extra inputs voor de coinbase-transactie, en worden ze gerangschikt volgens de volgorde van hun bijbehorende transacties in het blok. De coinbase-transactie van het blok zou er als volgt uit kunnen zien:

source: Where can I find the nitty-gritty details?
ar: أين يمكنني العثور على تفاصيل البنية الدقيقة؟
nl: Waar kan ik de fijne details vinden?

source: [The BIP!](https://github.com/ordinals/ord/blob/master/bip.mediawiki)
nl: [Het BIP!](https://github.com/ordinals/ord/blob/master/bip.mediawiki)

source: Why are sat inscriptions called "digital artifacts" instead of "NFTs"?
ar: لماذا يُطلق على سات إنسكريبشين ديجاتل ارتيفاكت "digital artifact" بدلاً من "الرموز غير القابلة للتماثل" "NFTs"؟
nl: Waarom worden sat-inscripties "digitale artefacten" genoemd in plaats van "NFT's"?

source: An inscription is an NFT, but the term "digital artifact" is used instead, because it's simple, suggestive, and familiar.
ar: الرسوم الرقمية digital artifact هي في الأساس NFTs، ولكن يتم استخدام مصطلح "الآثار الرقمية" بدلاً من ذلك؛ لأنه أكثر بساطة وتلميحيًا وعامًا.
nl: Een inscriptie is een NFT, maar de term "digitaal artefact" wordt in plaats daarvan gebruikt omdat het simpel, suggestief en vertrouwd is.

source: The phrase "digital artifact" is highly suggestive, even to someone who has never heard the term before. In comparison, NFT is an acronym, and doesn't provide any indication of what it means if you haven't heard the term before.
ar: عبارة "الآثار الرقمية" digital artifact تحمل معانٍ قوية حتى لمن لم يسمع بهذا المصطلح من قبل. وعلى عكس ذلك، اختصار NFT هو اختصار، ولا يوفر أي مؤشر على معناه إذا لم تكن قد سمعت بهذا المصطلح من قبل.
nl: De term "digitaal artefact" is zeer suggestief, zelfs voor iemand die de term nog nooit heeft gehoord. Daarentegen is NFT een acroniem en geeft het geen aanwijzing over wat het betekent als je de term nog niet eerder hebt gehoord.

source: Additionally, "NFT" feels like financial terminology, and the both word "fungible" and sense of the word "token" as used in "NFT" is uncommon outside of financial contexts.
ar: بالإضافة إلى ذلك، يبدو "NFT" كمصطلح مالي، وكلمتا "غير قابلة للتماثل" و"رمز" كما يُستخدمان في "NFT" غير شائعتين خارج السياقات المالية.
nl: Daarnaast voelt "NFT" aan als financiële terminologie, en zowel het woord "fungible" als de betekenis van het woord "token" zoals gebruikt in "NFT" zijn ongebruikelijk buiten financiële contexten.

source: How do sat inscriptions compare to…
ar: كيف تقارن سات إنسكريبشين مع…
nl: Hoe verhouden sat-inscripties zich tot…

source: _Inscriptions are always immutable._
ar: _الأنسكريبشين غير قابلة للتغيير_
nl: _Inscripties zijn altijd onveranderlijk._

source: There is simply no way to for the creator of an inscription, or the owner of an inscription, to modify it after it has been created.
ar: لا يوجد أي طريقة لصانع الإنسكريبشين أو مالكها لتعديلها بعد إنشائها.
nl: Er is simpelweg geen manier voor de maker of de eigenaar van een inscriptie om deze te wijzigen nadat deze is aangemaakt.

source: Ethereum NFTs _can_ be immutable, but many are not, and can be changed or deleted by the NFT contract owner.
ar: قد تكون NFTs في إيثيريوم قابلة للتغيير، ويمكن تغييرها أو حذفها من قبل صاحب العقد نفسه.
nl: Ethereum NFT's _kunnen_ immuut zijn, maar veel zijn dat niet en kunnen worden gewijzigd of verwijderd door de eigenaar van het NFT-contract.

source: In order to make sure that a particular Ethereum NFT is immutable, the contract code must be audited, which requires detailed knowledge of the EVM and Solidity semantics.
ar: من أجل التأكد من أن NFT معين في إيثيريوم غير قابل للتغيير، يجب مراجعة الكود الموجود في العقد، والذي يتطلب معرفة تفصيلية بشبكة EVM وسياقات Solidity.
nl: Om ervoor te zorgen dat een bepaald Ethereum NFT immuut is, moet de contractcode worden gecontroleerd, wat gedetailleerde kennis van de EVM en Solidity-semantiek vereist.

source: It is very hard for a non-technical user to determine whether or not a given Ethereum NFT is mutable or immutable, and Ethereum NFT platforms make no effort to distinguish whether an NFT is mutable or immutable, and whether the contract source code is available and has been audited.
ar: من الصعب جدًا على المستخدم الغير الفني تحديد ما إذا كان NFT الإيثيريوم قابلًا للتغيير أم لا، ومنصات NFT في إيثيريوم لا تبذل جهدًا للتمييز بين NFT اذا هي قابلة للتغيير أو لا ، وإذا كان كود المصدر قد تمت مراجعته.
nl: Het is erg moeilijk voor een niet-technische gebruiker om te bepalen of een gegeven Ethereum NFT wijzigbaar of immuut is, en Ethereum NFT-platforms doen geen moeite om te onderscheiden of een NFT wijzigbaar of immuut is, en of de contractbroncode beschikbaar is en gecontroleerd is.

source: _Inscription content is always on-chain._
ar: _محتوى الإنسكريبشين دائماً على السلسلة الرئيسية._
nl: _Inscriptie-inhoud staat altijd op de blockchain._

source: There is no way for an inscription to refer to off-chain content. This makes inscriptions more durable, because content cannot be lost, and scarcer, because inscription creators must pay fees proportional to the size of the content.
ar: لا يوجد طريقة للإشارة إلى محتوى خارج السلسلة. هذا يجعل الإنسكريبشين أكثر دوامًا، لأن المحتوى لا يمكن أن يتم فقده، وأكثر ندرة، لأن صانعيه الإنسكريبشين يجب أن يدفعوا رسومًا تتناسب مع حجم المحتوى.
nl: Een inscriptie kan op geen enkele manier naar inhoud buiten de blockchain verwijzen. Dit maakt inscripties duurzamer, omdat de inhoud niet verloren kan gaan, en schaarser, omdat makers van inscripties kosten moeten betalen die evenredig zijn aan de omvang van de inhoud.

source: Some Ethereum NFT content is on-chain, but much is off-chain, and is stored on platforms like IPFS or Arweave, or on traditional, fully centralized web servers. Content on IPFS is not guaranteed to continue to be available, and some NFT content stored on IPFS has already been lost. Platforms like Arweave rely on weak economic assumptions, and will likely fail catastrophically when these economic assumptions are no longer met. Centralized web servers may disappear at any time.
ar: بعض محتوى NFT في إيثيريوم على الشبكة، ولكن الكثير منها خارجها، ويتم تخزينها على منصات مثل IPFS أو Arweave، أو على خوادم ويب تقليدية مركزية تمامًا. ليس هناك ضمان لاستمرارية المحتوى على IPFS، وبعض محتوى NFT المخزن على IPFS قد تم فقدانه بالفعل. تعتمد منصات مثل Arweave على افتراضات اقتصادية ضعيفة، ومن المحتمل أن تفشل بشكل كارثي عندما لا تُلبى هذه الافتراضات الاقتصادية بعد الآن. يمكن أن تختفي الخوادم المركزية في أي وقت.
nl: Sommige Ethereum NFT-inhoud is on-chain, maar veel is off-chain en wordt opgeslagen op platforms zoals IPFS of Arweave, of op traditionele, volledig gecentraliseerde webservers. Inhoud op IPFS is niet gegarandeerd beschikbaar, en sommige NFT-inhoud opgeslagen op IPFS is al verloren gegaan. Platforms zoals Arweave zijn afhankelijk van zwakke economische aannames en zullen waarschijnlijk catastrofaal falen wanneer deze economische aannames niet langer worden voldaan. Gecentraliseerde webservers kunnen op elk moment verdwijnen.

source: It is very hard for a non-technical user to determine where the content of a given Ethereum NFT is stored.
ar: من الصعب جدًا على المستخدم الغير الفني تحديد مكان تخزين محتوى NFT معين في إيثيريوم.
nl: Het is voor een niet-technische gebruiker zeer moeilijk om te bepalen waar de inhoud van een gegeven Ethereum NFT is opgeslagen.

source: _Inscriptions are much simpler._
ar: _الإنسكريبشين بسيط جدا_
nl: _Inscriptions zijn veel eenvoudiger._

source: Ethereum NFTs depend on the Ethereum network and virtual machine, which are highly complex, constantly changing, and which introduce changes via backwards-incompatible hard forks.
ar: إيثيريوم NFT تعتمد على شبكة إيثيريوم والجهاز الظاهري للماكينات (EVM)، والتي هي معقدة للغاية ومتغيرة باستمرار، والتي تقوم بإدخال التغييرات من خلال تشعبات صعبة غير متوافقة مع الإصدارات السابقة.
nl: Ethereum NFT's zijn afhankelijk van het Ethereum-netwerk en de virtuele machine, die uiterst complex, voortdurend veranderend zijn en veranderingen introduceren via backwards-incompatibele hard forks.

source: Inscriptions, on the other hand, depend on the Bitcoin blockchain, which is relatively simple and conservative, and which introduces changes via backwards-compatible soft forks.
ar: على الجانب الآخر، تعتمد الإنسكريبشين على شبكه البيتكوين، والتي تعتبر بسيطة ومحافظة، والتي تدخل التغييرات من خلال تفرعات ناعمة متوافقة مع الإصدارات السابقة.
nl: Inscriptions daarentegen zijn afhankelijk van de Bitcoin-blockchain, die relatief eenvoudig en conservatief is, en veranderingen introduceert via backwards-compatibele soft forks.

source: _Inscriptions are more secure._
ar: _الإنسكريبشين أكثر أمان_
nl: _Inscriptions zijn veiliger._

source: Inscriptions inherit Bitcoin's transaction model, which allow a user to see exactly which inscriptions are being transferred by a transaction before they sign it. Inscriptions can be offered for sale using partially signed transactions, which don't require allowing a third party, such as an exchange or marketplace, to transfer them on the user's behalf.
ar: الإنسكريبشين ترث نموذج المعاملات الخاص بيتكوين، الذي يتيح للمستخدم رؤية الإنسكريبشين التي يتم نقلها بالمعاملة قبل أن يوقعوها. يمكن عرضها للبيع باستخدام معاملات موقعة جزئيًا، التي لا تتطلب من المستخدم السماح لجهة ثالثة، مثل البورصة أو سوق، بنقلها نيابة عن المستخدم.
nl: Inscriptions erven het transactie-model van Bitcoin, waarmee een gebruiker precies kan zien welke inscriptions worden overgedragen door een transactie voordat deze wordt ondertekend. Inscriptions kunnen te koop worden aangeboden met behulp van gedeeltelijk ondertekende transacties, die geen toestemming vereisen van een derde partij, zoals een beurs of marktplaats, om ze namens de gebruiker over te dragen.

source: By comparison, Ethereum NFTs are plagued with end-user security vulnerabilities. It is commonplace to blind-sign transactions, grant third-party apps unlimited permissions over a user's NFTs, and interact with complex and unpredictable smart contracts. This creates a minefield of hazards for Ethereum NFT users which are simply not a concern for ordinal theorists.
ar: بالمقارنة، تواجه NFTs في إيثيريوم مشاكل أمان للمستخدم النهائي. من الشائع أن تُوقع عمليات موقعة ضمنية، وتُمنح لتطبيقات الطرف الثالث أذونات غير محدودة على NFTs للمستخدم، والتفاعل مع عقود ذكية معقدة وغير متوقعة. هذا يخلق ساحة ملغومة بمخاطر لمستخدمي NFT في إيثيريوم، والتي ليست هذه هي الحالة بالنسبة لمؤيدي نظرية أوردينال.
nl: Ter vergelijking, Ethereum NFT's worden gekenmerkt door beveiligingsproblemen voor eindgebruikers. Het is gebruikelijk om transacties blindo te ondertekenen, derden onbeperkte machtigingen over de NFT's van een gebruiker te geven en te interageren met complexe en onvoorspelbare slimme contracten. Dit creëert een mijnenveld van risico's voor Ethereum NFT-gebruikers, wat eenvoudigweg geen probleem is voor ordinal theoristen.

source: _Inscriptions are scarcer._
ar: _الإنسكريبشين أكثر ندره_
nl: _Inscriptions zijn schaarser._

source: Inscriptions require bitcoin to mint, transfer, and store. This seems like a downside on the surface, but the raison d'etre of digital artifacts is to be scarce and thus valuable.
ar: الإنسكريبشين تتطلب بيتكوين للضبط والنقل والتخزين. قد يبدو ذلك سلبيا من الخارج، ولكن الهدف الأساسي من digital artifacts هو أن تكون نادرة وبالتالي قيمة.
nl: Inscriptions vereisen bitcoin om te minten, over te dragen en op te slaan. Dit lijkt op het eerste gezicht een nadeel, maar de reden van bestaan van digitale artefacten is om schaars en dus waardevol te zijn.

source: Ethereum NFTs, on the other hand, can be minted in virtually unlimited qualities with a single transaction, making them inherently less scarce, and thus, potentially less valuable.
ar: بالمقابل، يمكن إصدار NFTs في إيثيريوم بكميات لا حصر لها بمعاملة واحدة فقط، مما يجعلها أقل ندرة من طبيعتها، وبالتالي، ربما تكون أقل قيمة.
nl: Ethereum NFT's daarentegen kunnen in vrijwel onbeperkte hoeveelheden worden gemint met een enkele transactie, waardoor ze van nature minder schaars en daardoor mogelijk minder waardevol zijn.

source: _Inscriptions do not pretend to support on-chain royalties._
ar: _الإنسكريبشين لا تُظهر دعمًا كبيرًا للفوائد على الشبكة._
nl: _Inscriptions doen niet alsof ze on-chain royalty's ondersteunen._

source: On-chain royalties are a good idea in theory but not in practice. Royalty payment cannot be enforced on-chain without complex and invasive restrictions. The Ethereum NFT ecosystem is currently grappling with confusion around royalties, and is collectively coming to grips with the reality that on-chain royalties, which were messaged to artists as an advantage of NFTs, are not possible, while platforms race to the bottom and remove royalty support.
ar: الفوائد على الشبكة فكرة جيدة نظريًا وليست عمليًا. لا يمكن تنفيذ دفع الفوائد على الشبكة دون قيود معقدة ومُعضِلة. يواجه نظام NFTs في إيثيريوم الآن ارتباكًا حول العوائد، ويأتي معه فيساق كل منصة إلى القاع ويزيل دعم الفوائد.
nl: On-chain royalty’s zijn een goed idee in theorie, maar niet in de praktijk. Royaltybetalingen kunnen niet op de blockchain worden afgedwongen zonder complexe en ingrijpende beperkingen. Het Ethereum NFT-ecosysteem worstelt momenteel met verwarring rond royalty's en komt collectief tot het besef dat on-chain royalty's, die aan artiesten werden gepresenteerd als een voordeel van NFT's, niet mogelijk zijn, terwijl platforms race naar beneden maken en royalty-ondersteuning verwijderen.

source: Inscriptions avoid this situation entirely by making no false promises of supporting royalties on-chain, thus avoiding the confusion, chaos, and negativity of the Ethereum NFT situation.
ar: تجنب الإنسكريبشين هذا الوضع بالكامل من خلال عدم إصدار وعود كاذبة بدعم العوائد على السلسلة، وبالتالي تجنب الارتباك والفوضى والسلبية المرتبطة بالوضع الحالي لـ NFTs في إيثيريوم.
nl: Inscriptions vermijden deze situatie volledig door geen valse beloftes te doen over het ondersteunen van royalty's op de blockchain, en vermijden zo de verwarring, chaos en negativiteit van de Ethereum NFT-situatie.

source: _Inscriptions unlock new markets._
ar: _الإنسكريبشين تفتح أسواقًا جديدة._
nl: _Inscriptions ontgrendelen nieuwe markten._

source: Bitcoin's market capitalization and liquidity are greater than Ethereum's by a large margin. Much of this liquidity is not available to Ethereum NFTs, since many Bitcoiners prefer not to interact with the Ethereum ecosystem due to concerns related to simplicity, security, and decentralization.
ar: رأس المال السوقي والسيولة للبيتكوين أكبر بكثير من إيثيريوم بفارق كبير. والكثير من هذه السيولة غير متاحة لـ NFTs في إيثيريوم، حيث يفضل كثيرون من مالكي بيتكوين عدم التفاعل مع بيئة إيثيريوم بسبب مخاوف تتعلق بالبساطة والأمان واللامركزية.
nl: De marktkapitalisatie en liquiditeit van Bitcoin zijn veel groter dan die van Ethereum. Een groot deel van deze liquiditeit is niet beschikbaar voor Ethereum NFT's, aangezien veel Bitcoin-gebruikers liever niet met het Ethereum-ecosysteem omgaan vanwege bezorgdheden over eenvoud, beveiliging en decentralisatie.

source: Such Bitcoiners may be more interested in inscriptions than Ethereum NFTs, unlocking new classes of collector.
ar: قد يكون هؤلاء المالكون أكثر اهتمامًا بال قد يكون هؤلاء المالكون أكثر اهتمامًا ب الإنسكريبشين مقارنةً بـ NFTs في إيثيريوم، مما يفتح أصنافًا جديدة من المجمعين. مقارنةً بـ NFTs في إيثيريوم، مما يفتح أصنافًا جديدة من المجمعين.
nl: Zo'n Bitcoiners kunnen meer geïnteresseerd zijn in inscripties dan in Ethereum NFT's, waardoor nieuwe klassen van verzamelaars worden ontsloten.

source: _Inscriptions have a richer data model._
ar: _الإنسكريبشين لديها نموذج بيانات أكثر غنى._
nl: _Inscriptions hebben een rijker datamodel._
