Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: Revise the PR as needed.
ar: قم بمراجعة ال PR حسب الحاجة.
nl: Herzie de PR indien nodig.

source: And finally, mergies!
ar: وأخيراً، دمج ال PRs!
nl: En tot slot, versmelten!

source: Start small
ar: ابدأ بشكل صغير
nl: Begin klein

source: Small changes will allow you to make an impact quickly, and if you take the wrong tack, you won't have wasted much time.
ar: التغييرات الصغيرة ستسمح لك بإحداث تأثير بسرعة، وإذا اتخذت الطريقة الخاطئة، فلن تكون قد أضعت الكثير من الوقت.
nl: Kleine veranderingen stellen je in staat om snel impact te maken, en als je de verkeerde richting inslaat, heb je niet veel tijd verspild.

source: Ideas for small issues:
ar: أفكار لمشكلات صغيرة:
nl: Ideeën voor kleine uitgaves:

source: Add a new test or test case that increases test coverage
ar: أضف اختبارًا جديدًا أو اختبر حاله زياده نطاك الاختبار
nl: Voeg een nieuwe test of testcase toe die de testdekking vergroot

source: Add or improve documentation
ar: أضف أو قم بتحسين الوثائق
nl: Voeg documentatie toe of verbeter het

source: Find an issue that needs more research, and do that research and summarize it in a comment
ar: ابحث عن مشكلة تحتاج إلى مزيد من البحث، وقم بذلك البحث وخصصه بإضافة تعليق
nl: Zoek een issue dat meer onderzoek nodig heeft, doe dat onderzoek en vat het samen in een commentaar

source: Find an out-of-date issue and comment that it can be closed
ar: ابحث عن مشكلة قديمة وأضف تعليق على أنه يمكن إغلاقها
nl: Zoek een verouderd issue en geef in een commentaar aan dat het kan worden gesloten

source: Find an issue that shouldn't be done, and provide constructive feedback detailing why you think that is the case
ar: ابحث عن مشكلة يجب ألا تتم، وقدم ملاحظات مرتبه بناءً على اعتقادك
nl: Zoek een issue dat niet uitgevoerd zou moeten worden en geef constructieve feedback waarin je uitlegt waarom je dat denkt

source: Merge early and often
ar: قم بالدمج بشكل مبكر ومتكرر
nl: Merge vroeg en vaak

source: Break up large tasks into multiple smaller steps that individually make progress. If there's a bug, you can open a PR that adds a failing ignored test. This can be merged, and the next step can be to fix the bug and unignore the test. Do research or testing, and report on your results. Break a feature into small sub-features, and implement them one at a time.
ar: قم بتقسيم المهام الكبيرة إلى خطوات صغيرة متعددة تساهم بشكل فردي في التقدم. إذا كان هناك خطأ، يمكنك فتح PR الذي يضيف اختبار فاشل تم تجاوزه. هذا يمكن دمجه ، والخطوة التالية يمكن أن تكون إصلاح الخطأ وإلغاء تجاوز الاختبار. قم بالبحث أو الاختبار، وأبلغ عن حاله نتائجك. قم بتقسيم ميزة إلى ميزات فرعية صغيرة، وقم بتنفيذها واحدة تلو الأخرى.
nl: Verdeel grote taken in meerdere kleinere stappen die afzonderlijk vooruitgang boeken. Als er een bug is, kun je een PR openen die een falende, genegeerde test toevoegt. Dit kan worden samengevoegd, en de volgende stap kan zijn om de bug te verhelpen en de test niet langer te negeren. Doe onderzoek of testwerk, en rapporteer je resultaten. Verdeel een functie in kleine subfuncties en implementeer ze één voor één.

source: Figuring out how to break down a larger PR into smaller PRs where each can be merged is an art form well-worth practicing. The hard part is that each PR must itself be an improvement.
ar: معرفة كيفية تقسيم PR أكبر إلى PRs أصغر حيث يمكن دمج كل منها بشكل فردي هو فن يستحق الممارسة والتعلم. الجزء الصعب هو أن كل PR يجب أن يكون في حد ذاته تحسينًا.
nl: Uitzoeken hoe je een grotere PR kunt opsplitsen in kleinere PR's, waarbij elke PR kan worden samengevoegd, is een kunstvorm die het waard is om te oefenen. Het moeilijke is dat elke PR op zichzelf een verbetering moet zijn.

source: I strive to follow this advice myself, and am always better off when I do.
ar: أسعى دائمًا لاتباع هذه النصائح بنفسي، وأكون دائمًا في وضع أفضل عندما أفعل ذلك.
nl: Ik streef er zelf naar om dit advies op te volgen, en ik ben altijd beter af wanneer ik dat doe.

source: Small changes are fast to write, review, and merge, which is much more fun than laboring over a single giant PR that takes forever to write, review, and merge. Small changes don't take much time, so if you need to stop working on a small change, you won't have wasted much time as compared to a larger change that represents many hours of work. Getting a PR in quickly improves the project a little bit immediately, instead of having to wait a long time for larger improvement. Small changes are less likely to accumulate merge conflict. As the Athenians said: _The fast commit what they will, the slow merge what they must._
ar: التغييرات الصغيرة تكون سريعة الكتابة والمراجعة والدمج، مما يعزز المرح أكثر من العمل على PR كبير واحد يستغرق وقتًا طويلاً للكتابة والمراجعة والدمج. التغييرات الصغيرة لا تأخذ وقتًا كبيرًا، لذا إذا كنت بحاجة للتوقف عن العمل على تغيير صغير، فلن تكون قد أضعت الكثير من الوقت مقارنة بتغيير أكبر الذي يحتاج للعديد من الساعات للعمل. الحصول على PR بسرعة يحسن المشروع بشكل سريع بعض الأحيان مباشرة ، بدلاً من الانتظار لفترة طويلة من الزمن لتحسين أكبر. التغييرات الصغيرة أقل عرضة لتراكم الأخطاء في عمليه الدمج. كما قال الأثينيون: _الذين يتماشون بسرعة ما يشاؤون، والذين يدمجون ببطء ما يجب عليهم._
nl: Kleine wijzigingen zijn snel te schrijven, te beoordelen en te mergen, wat veel leuker is dan het ploeteren over een enkele grote PR die een eeuwigheid duurt om te schrijven, beoordelen en mergen. Kleine wijzigingen nemen niet veel tijd in beslag, dus als je moet stoppen met werken aan een kleine wijziging, heb je niet veel tijd verspild in vergelijking met een grotere wijziging die vele uren werk vertegenwoordigt. Het snel indienen van een PR verbetert het project onmiddellijk een beetje, in plaats van te wachten op een grotere verbetering. Kleine wijzigingen zijn minder waarschijnlijk om mergeconflicten op te lopen. Zoals de Atheners zeiden: _De snelle committen wat ze willen, de langzame mergen wat ze moeten._

source: Get help
ar: اطلب المساعدة
nl: Vraag om hulp

source: If you're stuck for more than 15 minutes, ask for help, like a Rust Discord, Stack Exchange, or in a project issue or discussion.
ar: إذا علقت لأكثر من 15 دقيقة، اطلب المساعدة، مثل ديسكورد أو Stack Exchange أو في المشروع في قسم الاقتراحات أو المناقشة.
nl: Als je meer dan 15 minuten vastzit, vraag dan om hulp, bijvoorbeeld in een Rust Discord, Stack Exchange, of in een projectissue of discussie.

source: Practice hypothesis-driven debugging
ar: ممارسة تصحيح الأخطاء المبنية على الفرضيات
nl: Oefen hypothesegestuurd debuggen

source: Formulate a hypothesis as to what is causing the problem. Figure out how to test that hypothesis. Perform that tests. If it works, great, you fixed the issue or now you know how to fix the issue. If not, repeat with a new hypothesis.
ar: صيغ فرضية بشأن ما الذي يتسبب في المشكلة. اكتشف كيفية اختبار تلك الفرضية. قم بأداء هذه الاختبارات. إذا نجحت، فهذا رائع، لقد حلت المشكلة و الآن تعرف كيفية حل المشكلة. إذا لم ينجح، كرر العملية مع فرضية جديدة.
nl: Stel een hypothese op over wat het probleem veroorzaakt. Bedenk hoe je die hypothese kunt testen. Voer de tests uit. Als het werkt, geweldig, je hebt het probleem opgelost of weet nu hoe je het probleem kunt oplossen. Als dat niet het geval is, herhaal dan met een nieuwe hypothese.

source: Pay attention to error messages
ar: أعطي الانتباه لرسائل الخطأ
nl: Let op foutmeldingen

source: Read all error messages and don't tolerate warnings.
ar: اقرأ جميع رسائل الخطأ ولا تتسامح مع التحذيرات.
nl: Lees alle foutmeldingen en tolereer geen waarschuwingen.

source: Ordinals is open-source and community funded. The current lead maintainer of `ord` is [raphjaph](https://github.com/raphjaph/). Raph's work on `ord` is entirely funded by donations. If you can, please consider donating!
ar: أوردينال مشروعًا مفتوح المصدر وممولًا من قبل المجتمع. المشرف الرئيسي الحالي لـ `Ord` هو [raphjaph](https://github.com/raphjaph/). يتم تمويل عمل Raph في مشروع `Ord` بالكامل من خلال التبرعات. إذا كان بإمكانك، يُرجى النظر في التبرع!
nl: Ordinals is open-source and community-funded. De huidige hoofdonderhouder van `ord` is [raphjaph](https://github.com/raphjaph/). Raph's werk aan `ord` wordt volledig gefinancierd door donaties. Als je kunt, overweeg dan alstublieft een donatie!

source: The donation address for Bitcoin is [bc1q8kt9pyd6r27k2840l8g5d7zshz3cg9v6rfda0m248lva3ve5072q3sxelt](https://mempool.space/address/bc1q8kt9pyd6r27k2840l8g5d7zshz3cg9v6rfda0m248lva3ve5072q3sxelt). The donation address for inscriptions is [bc1qn3map8m9hmk5jyqdkkwlwvt335g94zvxwd9aql7q3vdkdw9r5eyqvlvec0](https://mempool.space/address/bc1qn3map8m9hmk5jyqdkkwlwvt335g94zvxwd9aql7q3vdkdw9r5eyqvlvec0).
ar: التبرع بعمله البيتكوين:[bc1q8kt9pyd6r27k2840l8g5d7zshz3cg9v6rfda0m248lva3ve5072q3sxelt](https://mempool.space/address/bc1q8kt9pyd6r27k2840l8g5d7zshz3cg9v6rfda0m248lva3ve5072q3sxelt) التبرع بواسطه الأنسكريبشين : [bc1qn3map8m9hmk5jyqdkkwlwvt335g94zvxwd9aql7q3vdkdw9r5eyqvlvec0](https://mempool.space/address/bc1qn3map8m9hmk5jyqdkkwlwvt335g94zvxwd9aql7q3vdkdw9r5eyqvlvec0)
nl: Het donatieadres voor Bitcoin is [bc1q8kt9pyd6r27k2840l8g5d7zshz3cg9v6rfda0m248lva3ve5072q3sxelt](https://mempool.space/address/bc1q8kt9pyd6r27k2840l8g5d7zshz3cg9v6rfda0m248lva3ve5072q3sxelt). Het donatieadres voor inscripties is [bc1qn3map8m9hmk5jyqdkkwlwvt335g94zvxwd9aql7q3vdkdw9r5eyqvlvec0](https://mempool.space/address/bc1qn3map8m9hmk5jyqdkkwlwvt335g94zvxwd9aql7q3vdkdw9r5eyqvlvec0).

source: Both addresses are in a 2 of 4 multisig wallet with keys held by [raphjaph](https://twitter.com/raphjaph), [erin](https://twitter.com/realizingerin), [rodarmor](https://twitter.com/rodarmor), and [ordinally](https://twitter.com/veryordinally).
ar: كلا العنوانين موجودين في محفظة متعددة التوقيع 2 من 4، ويتم الاحتفاظ بهذه المفاتيح بواسطة [raphjaph](https://twitter.com/raphjaph) و [erin](https://twitter.com/realizingerin) و [rodarmor](https://twitter.com/rodarmor) و [ordinally](https://twitter.com/veryordinally).
nl: Beide adressen bevinden zich in een 2 van 4 multisig-portemonnee met sleutels beheerd door [raphjaph](https://twitter.com/raphjaph), [erin](https://twitter.com/realizingerin), [rodarmor](https://twitter.com/rodarmor) en [ordinally](https://twitter.com/veryordinally).

source: Donations received will go towards funding maintenance and development of `ord`, as well as hosting costs for [ordinals.com](https://ordinals.com).
ar: سيتم استخدام التبرعات المستلمة لتمويل صيانة وتطوير `ord`، بالإضافة إلى تكاليف موقع [ordinals.com](https://ordinals.com).
nl: Ontvangen donaties zullen worden gebruikt voor het financieren van het onderhoud en de ontwikkeling van `ord`, evenals voor de hostingkosten van [ordinals.com](https://ordinals.com).

source: Thank you for donating!
ar: شكرًا لك على التبرع!
nl: Bedankt voor het doneren!

source: Ordinal Theory Guides
ar: دليل نظرية أوردينال
nl: Gidsen voor Ordinal Theory

source: See the table of contents for a list of guides, including a guide to the explorer, a guide for sat hunters, and a guide to inscriptions.
ar: جدول المحتويات للحصول على قائمة في بعض المحتوى بما في ذلك دليل للموقع، ودليل لصيادي الساتوشي، ودليل الإنسكريبشين.
nl: Zie de inhoudsopgave voor een lijst van gidsen, inclusief een gids voor de verkenner, een gids voor sat hunters en een gids voor inscripties.

source: The `ord` binary includes a block explorer. We host an instance of the block explorer on mainnet at [ordinals.com](https://ordinals.com), on signet at [signet.ordinals.com](https://signet.ordinals.com), and on testnet at [testnet.ordinals.com](https://testnet.ordinals.com). As of version 0.16.0 the wallet needs `ord server` running in the background. This is analogous to how `bitcoin-cli` needs `bitcoind` running in the background.
nl: De `ord`-binaire bevat een block explorer. We hosten een instantie van de block explorer op mainnet op [ordinals.com](https://ordinals.com), op signet op [signet.ordinals.com](https://signet.ordinals.com), en op testnet op [testnet.ordinals.com](https://testnet.ordinals.com). Sinds versie 0.16.0 moet de wallet `ord server` op de achtergrond draaien. Dit is vergelijkbaar met hoe `bitcoin-cli` `bitcoind` op de achtergrond nodig heeft.]

source: Running The Explorer
ar: تشغيل المتصفح
nl: De Explorer draaien

source: The server can be run locally with:
ar: يمكن تشغيل المتصفح محليا على:
nl: De server kan lokaal worden uitgevoerd met:

source: To specify a port add the `--http-port` flag:
ar: لتحديد البورت `http-port-- `حدد:
nl: Om een poort op te geven, voeg je de `--http-port` vlag toe:

source: The JSON-API endpoints are enabled by default, to disable them add the `--disable-json-api` flag (see [here](#json-api) for more info):
nl: De JSON-API-eindpunten zijn standaard ingeschakeld. Om ze uit te schakelen, voeg je de `--disable-json-api` vlag toe (zie [hier](#json-api) voor meer informatie):

source: Search
ar: البحث
nl: Zoeken

source: The search box accepts a variety of object representations.
ar: صندوق البحث يقبل مجموعة متنوعة من تمثيلات.
nl: Het zoekvak accepteert een verscheidenheid aan objectrepresentaties.

source: Blocks can be searched by hash, for example, the genesis block:
ar: يمكن البحث عن البلوكس عبر الهاش، على سبيل المثال، block genesis :
nl: Blokken kunnen worden gezocht op hash, bijvoorbeeld, het genesisblok:

source: Transactions
ar: المعاملات
nl: Transacties

source: Transactions can be searched by hash, for example, the genesis block coinbase transaction:
ar: يمكن البحث عن المعاملات عبر الهاش، على سبيل المثال، معاملة العملات النقدية في block genesis :
nl: Transacties kunnen worden gezocht op hash, bijvoorbeeld, de coinbase-transactie van het genesisblok:

source: Transaction outputs can be searched by outpoint, for example, the only output of the genesis block coinbase transaction:
nl: Transactie-uitgangen kunnen worden gezocht op outpoint, bijvoorbeeld, de enige uitgang van de coinbase-transactie van het genesisblok:

source: Sats can be searched by integer, their position within the entire bitcoin supply:
ar: يمكن البحث عن الساتس (Sats) عبر العدد الصحيح، وموقعها ضمن إجمالي إمدادات البيتكوين:
nl: Sats kunnen worden gezocht op integer, hun positie binnen de gehele bitcoin-aanvoer:

source: By decimal, their block and offset within that block:
ar: بالعشري، وموقعها في البلوك والإزاحة ضمن ذلك البلوك:
nl: Op decimale waarde, hun block en offset binnen dat block:

source: By degree, their cycle, blocks since the last halving, blocks since the last difficulty adjustment, and offset within their block:
ar: بالزاوية، والدورة، بلوكس منذ آخر تقسيم و بلوكس منذ آخر تعديل للصعوبة، والإزاحة ضمن البلوك:
nl: Op graad, hun cyclus, blocks sinds de laatste halvering, blocks sinds de laatste moeilijkheidsaanpassing, en offset binnen hun block:

source: By name, their base 26 representation using the letters "a" through "z":
ar: بالاسم، والتمثيل الأساسي الـ 26 باستخدام الأحرف "a" حتى "z":
nl: Op naam, hun basis 26 weergave met de letters "a" tot "z":

source: Or by percentile, the percentage of bitcoin's supply that has been or will have been issued when they are mined:
ar: أو بالنسبة المئوية، نسبة إمداد بيتكوين التي تم إصدارها أو سيتم إصدارها عندما يتم تعدينها:
nl: Of door percentiel, het percentage van de bitcoinvoorraad dat is of zal zijn uitgegeven wanneer ze worden gemijnd:

source: By default the `ord server` gives access to endpoints that return JSON instead of HTML if you set the HTTP `Accept: application/json` header. The structure of these objects closely follows what is shown in the HTML. These endpoints are:
nl: Standaard biedt de `ord server` toegang tot eindpunten die JSON retourneren in plaats van HTML als je de HTTP `Accept: application/json` header instelt. De structuur van deze objecten volgt nauwkeurig wat in de HTML wordt weergegeven. Deze eindpunten zijn:

source: To get a list of the latest 100 inscriptions you would do:
nl: Om een lijst van de laatste 100 inscripties te krijgen, zou je het volgende doen:

source: To see information about a UTXO, which includes inscriptions inside it, do:
nl: Om informatie over een UTXO te zien, inclusief inscripties die erin zitten, doe je het volgende:

source: Which returns:
nl: Wat teruggeeft:

source: Individual sats can be inscribed with arbitrary content, creating Bitcoin-native digital artifacts that can be held in a Bitcoin wallet and transferred using Bitcoin transactions. Inscriptions are as durable, immutable, secure, and decentralized as Bitcoin itself.
ar: يمكن أن تُرسم العملات الفردية بمحتوى تعسفي، مما يُنشئ قطع فنية رقمية متناسبة مع بيتكوين يمكن الاحتفاظ بها في محفظة بيتكوين ونقلها باستخدام المعاملات المالية في بيتكوين. إن النقوش متينة وثابتة وآمنة ولامركزية تمامًا مثل بيتكوين نفسه.
nl: Individuele sats kunnen worden ingeschreven met willekeurige inhoud, waardoor Bitcoin-native digitale artefacten ontstaan die kunnen worden bewaard in een Bitcoin-portemonnee en overgedragen kunnen worden met Bitcoin-transacties. Inschrijvingen zijn net zo duurzaam, onveranderlijk, veilig en gedecentraliseerd als Bitcoin zelf.

source: Working with inscriptions requires a Bitcoin full node, to give you a view of the current state of the Bitcoin blockchain, and a wallet that can create inscriptions and perform sat control when constructing transactions to send inscriptions to another wallet.
ar: العمل مع الأنسكريبشين يتطلب وجود نود بيتكوين كاملة لمنحك نظرة على الحالة الحالية لسلسلة كتل بيتكوين، ومحفظة قادرة على إنشاء الأنسكريبشين وأداء التحكم في العملات عند بناء المعاملات لإرسالها إلى محفظة أخرى.
nl: Werken met inschrijvingen vereist een Bitcoin full node, die je een overzicht geeft van de huidige staat van de Bitcoin-blockchain, en een portemonnee die inschrijvingen kan maken en satoshis kan beheren bij het opstellen van transacties om inschrijvingen naar een andere portemonnee te verzenden.

source: Bitcoin Core provides both a Bitcoin full node and wallet. However, the Bitcoin Core wallet cannot create inscriptions and does not perform sat control.
ar: توفر Bitcoin Core كل من نود بيتكوين كاملة ومحفظة. ومع ذلك، لا يمكن لمحفظة Bitcoin Core إنشاء النقوش ولا تؤدي إلى التحكم في العملات.
nl: Bitcoin Core biedt zowel een Bitcoin full node als een portemonnee. De Bitcoin Core-portemonnee kan echter geen inschrijvingen maken en voert geen sat-beheer uit.

source: This requires [`ord`](https://github.com/ordinals/ord), the ordinal utility. `ord` doesn't implement its own wallet, so `ord wallet` subcommands interact with Bitcoin Core wallets.
ar: هذا يتطلب [`ord`](https://github.com/ordinals/ord), وهو أداة ترتيبية. أورد لا تنفذ محفظة خاصة بها، لذا تفاعل أوامر محفظة أورد مع محافظ Bitcoin Core.
nl: Dit vereist [`ord`](https://github.com/ordinals/ord), de ordinal utility. `ord` implementeert geen eigen portemonnee, dus `ord wallet` subcommando's communiceren met Bitcoin Core-portemonnees.

source: This guide covers:
ar: تشمل هذه الدليل الفقرات التالية:
nl: Deze gids behandelt:

source: Installing Bitcoin Core
ar: تثبيت Bitcoin Core
nl: Bitcoin Core installeren

source: Syncing the Bitcoin blockchain
ar: مزامنة Bitcoin blockchain
nl: De Bitcoin-blockchain synchroniseren

source: Creating a Bitcoin Core wallet
ar: إنشاء محفظة Bitcoin Core
nl: Het Creëren van een Bitcoin Core Wallet

source: Using `ord wallet receive` to receive sats
ar: استخدام `ord wallet receive` لاستقبال العملات
nl: Gebruik `ord wallet receive` om sats te ontvangen

source: Creating inscriptions with `ord wallet inscribe`
ar: إنشاء الأنسكريبشين باستخدام `ord wallet inscribe`
nl: Inschrijvingen maken met `ord wallet inscribe`

source: Sending inscriptions with `ord wallet send`
ar: إرسال الأنسكريبشين باستخدام `ord wallet send`
nl: Inschrijvingen verzenden met `ord wallet send`

source: Receiving inscriptions with `ord wallet receive`
ar: استقبال الأنسكريبشين باستخدام `ord wallet receive`
nl: Inschrijvingen ontvangen met `ord wallet receive`

source: Batch inscribing with `ord wallet inscribe --batch`
nl: Batch-inschrijven met `ord wallet inscribe --batch`

source: Getting Help
ar: الحصول على المساعدة
nl: Hulp Krijgen

source: If you get stuck, try asking for help on the [Ordinals Discord Server](https://discord.com/invite/87cjuz4FYg), or checking GitHub for relevant [issues](https://github.com/ordinals/ord/issues) and [discussions](https://github.com/ordinals/ord/discussions).
ar: إذا واجهتك مشكلة، جرب أن تطلب المساعدة على [الديسكورد](https://discord.com/invite/87cjuz4FYg) ، أو تفقد موقع[issues](https://github.com/ordinals/ord/issues) [discussions](https://github.com/ordinals/ord/discussions) GitHub للقضايا والمناقشات ذات الصلة.
nl: Als je vastloopt, probeer dan hulp te vragen op de [Ordinals Discord Server](https://discord.com/invite/87cjuz4FYg), of kijk op GitHub voor relevante [issues](https://github.com/ordinals/ord/issues) en [discussies](https://github.com/ordinals/ord/discussions).

source: Bitcoin Core is available from [bitcoincore.org](https://bitcoincore.org/) on the [download page](https://bitcoincore.org/en/download/).
ar: يتوفر Bitcoin Core من موقع [bitcoincore.org](https://bitcoincore.org/) على [صفحه التحميل](https://bitcoincore.org/en/download/).
nl: Bitcoin Core is beschikbaar op [bitcoincore.org](https://bitcoincore.org/) op de [downloadpagina](https://bitcoincore.org/en/download/).

source: Making inscriptions requires Bitcoin Core 24 or newer.
ar: إن إجراء الإنسكريبشين يتطلب Bitcoin Core 24 أو الإصدارات الأحدث.
nl: Inschrijvingen maken vereist Bitcoin Core 24 of nieuwer.

source: This guide does not cover installing Bitcoin Core in detail. Once Bitcoin Core is installed, you should be able to run `bitcoind -version` successfully from the command line. Do _NOT_ use `bitcoin-qt`.
nl: Deze gids behandelt de installatie van Bitcoin Core niet in detail. Zodra Bitcoin Core is geïnstalleerd, zou je in staat moeten zijn om `bitcoind -version` succesvol uit te voeren vanaf de opdrachtregel. Gebruik _NIET_ `bitcoin-qt`.

source: Configuring Bitcoin Core
ar: تهيئة Bitcoin Core
nl: Bitcoin Core Configureren

source: `ord` requires Bitcoin Core's transaction index and rest interface.
nl: `ord` vereist de transactie-index en de REST-interface van Bitcoin Core.

source: To configure your Bitcoin Core node to maintain a transaction index, add the following to your `bitcoin.conf`:
ar: لتهيئة نود Bitcoin Core الخاص بك للحفاظ على فهرس المعاملات، أضف ما يلي إلى ملف bitcoin.conf الخاص بك:
nl: Om je Bitcoin Core-node te configureren voor het bijhouden van een transactie-index, voeg je het volgende toe aan je `bitcoin.conf`:

source: Or, run `bitcoind` with `-txindex`:
nl: Of, start bitcoind met -txindex:

source: Details on creating or modifying your `bitcoin.conf` file can be found [here](https://github.com/bitcoin/bitcoin/blob/master/doc/bitcoin-conf.md).
nl: Informatie over het aanmaken of aanpassen van je `bitcoin.conf`-bestand kun je [hier](https://github.com/bitcoin/bitcoin/blob/master/doc/bitcoin-conf.md) vinden.

source: Syncing the Bitcoin Blockchain
ar: مزامنة شبكه البيتكوين
nl: Het synchroniseren van de Bitcoin-blockchain

source: To sync the chain, run:
ar: لبدء مزامنه السلسلة:
nl: Om de keten te synchroniseren, voer je uit:

source: …and leave it running until `getblockcount`:
ar: ...واتركها تعمل حتى يتم استدعاء الأمر `getblockcount`:
nl: ... en laat het draaien totdat `getblockcount` aangeeft:

source: agrees with the block count on a block explorer like [the mempool.space block explorer](https://mempool.space/). `ord` interacts with `bitcoind`, so you should leave `bitcoind` running in the background when you're using `ord`.
ar: يتم قبول عدد البلوكات من خلال المتصفح مثل [the mempool.space block explorer](https://mempool.space/).ال `ord` يتفاعل مع `bitcoind` لذالك يجب أن تبقي النود فعال بلخلفيه عند استعمالك له.
nl: ... en overeenkomt met de blokteller op een block explorer zoals [de mempool.space block explorer](https://mempool.space/). `ord` interacteert met `bitcoind`, dus je moet `bitcoind` op de achtergrond laten draaien wanneer je `ord` gebruikt.
