Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: Inscriptions consist of a content type, also known as a MIME type, and content, which is an arbitrary byte string. This is the same data model used by the web, and allows inscription content to evolve with the web, and come to support any kind of content supported by web browsers, without requiring changes to the underlying protocol.
ar: الإنسكريبشين تتألف من نوع المحتوى، المعروف أيضًا باسم نوع MIME، والمحتوى، وهو سلسلة بايت عشوائية. هذا هو نفس نموذج البيانات المستخدم في الويب، ويسمح بتطور محتوى الإنسكريبشين مع الويب، ودعم أي نوع من المحتوى المدعوم من قبل متصفحات الويب، دون الحاجة إلى تغيير البروتوكول الأساسي.
nl: Inscriptions bestaan uit een inhoudstype, ook bekend als een MIME-type, en inhoud, wat een willekeurige byte-reeks is. Dit is hetzelfde datamodel dat door het web wordt gebruikt, en stelt inhoud van inscripties in staat om mee te evolueren met het web en elke soort inhoud te ondersteunen die door webbrowsers wordt ondersteund, zonder wijzigingen aan het onderliggende protocol te vereisen.

source: RGB and Taro assets?
ar: أصول RGB و Taro ؟
nl: RGB en Taro assets?

source: RGB and Taro are both second-layer asset protocols built on Bitcoin. Compared to inscriptions, they are much more complicated, but much more featureful.
ar: ال RGB وTaro هما بروتوكولين للأصول من الطبقة الثانية تم بناؤهما على بيتكوين. بالمقارنة مع ال inscriptions، فإنهما أكثر تعقيدًا بكثير، ولكنهما يتمتعان بميزات أكثر.
nl: RGB en Taro zijn beide tweede-laag assetprotocollen gebouwd op Bitcoin. In vergelijking met inscripties zijn ze veel gecompliceerder, maar ook veel veelzijdiger.

source: Ordinal theory has been designed from the ground up for digital artifacts, whereas the primary use-case of RGB and Taro are fungible tokens, so the user experience for inscriptions is likely to be simpler and more polished than the user experience for RGB and Taro NFTs.
ar: تم تصميم نظرية أوردينال من الألف إلى الياء digital artifacts، بينما يكمن استخدام RGB وTaro الرئيسي في الرموز المتجانسة، لذا فإن تجربة المستخدم للنقوش من المحتمل أن تكون أبسط وأكثر اتقانًا من تجربة المستخدم لرموز RGB وTaro NFT.
nl: Ordinal theory is vanaf de grond af ontworpen voor digitale artefacten, terwijl de primaire use-case van RGB en Taro fungibele tokens zijn. Daarom is de gebruikerservaring voor inscripties waarschijnlijk eenvoudiger en verfijnder dan de gebruikerservaring voor RGB en Taro NFT's.

source: RGB and Taro both store content off-chain, which requires additional infrastructure, and which may be lost. By contrast, inscription content is stored on-chain, and cannot be lost.
ar: ال RGB وTaro يخزنان كلاهما المحتوى خارج الشبكة الرئيسية، مما يتطلب بنية تحتية إضافية، والتي قد تفقد. على العكس من ذلك، يتم تخزين محتوى الإنسكريبشين داخل الشبكة الرئيسية ولا يمكن فقده.
nl: RGB en Taro slaan beide inhoud off-chain op, wat extra infrastructuur vereist en verloren kan gaan. In tegenstelling hiermee wordt inscriptie-inhoud on-chain opgeslagen en kan deze niet verloren gaan.

source: Ordinal theory, RGB, and Taro are all very early, so this is speculation, but ordinal theory's focus may give it the edge in terms of features for digital artifacts, including a better content model, and features like globally unique symbols.
ar: نظرية أوردينال، RGB، وTaro كلها في مراحل مبكرة جدًا، لذلك هذه مجرد تكهنات، ولكن تركيز نظرية أوردينال قد يمنحها ميزة فيما يتعلق بالميزات المخصصة للأشياء الرقمية، بما في ذلك نموذج المحتوى الأفضل، وميزات مثل الرموز الفريدة عالميًا.
nl: Ordinal theory, RGB en Taro bevinden zich allemaal in een zeer vroege fase, dus dit is speculatie, maar de focus van ordinal theory kan het voordeel geven op het gebied van functies voor digitale artefacten, inclusief een beter inhoudsmodel en functies zoals wereldwijd unieke symbolen.

source: Counterparty has its own token, XCP, which is required for some functionality, which makes most bitcoiners regard it as an altcoin, and not an extension or second layer for bitcoin.
ar: كاونتربارتي Counterparty لديها عملتها الخاصة، XCP، والتي تُطلب لبعض الوظائف، مما يجعل معظم مالكي بيتكوين يعتبرونها عملة رقمية بديلة وليست تمديدًا أو طبقة ثانية للبيتكوين.
nl: Ordinal theory, RGB en Taro bevinden zich allemaal in een zeer vroege fase, dus dit is speculatie, maar de focus van ordinal theory kan het voordeel geven op het gebied van functies voor digitale artefacten, inclusief een beter inhoudsmodel en functies zoals wereldwijd unieke symbolen.

source: Ordinal theory has been designed from the ground up for digital artifacts, whereas Counterparty was primarily designed for financial token issuance.
ar: تم تصميم نظرية أوردينال من البداية digital artifacts، بينما تم تصميم Counterparty أساسًا لإصدار الرموز المالية.
nl: Ordinal theory is vanaf de grond af ontworpen voor digitale artefacten, terwijl Counterparty voornamelijk is ontworpen voor de uitgifte van financiële tokens.

source: Inscriptions for…
ar: الإنسكريبشين هي ل…
nl: Inscriptions voor…

source: _Inscriptions are on Bitcoin._ Bitcoin is the digital currency with the highest status and greatest chance of long-term survival. If you want to guarantee that your art survives into the future, there is no better way to publish it than as inscriptions.
ar: _الإنسكريبشين هي على بيتكوين_ بيتكوين هو العملة الرقمية ذات المكانة الأعلى ومن اعلى الفرص للبقاء على المدى الطويل. إذا كنت ترغب في ضمان بقاء فنك في المستقبل، فلا توجد طريقة أفضل لنشره إلا من خلال الإنسكريبشين.
nl: _Inscriptions zijn op Bitcoin._ Bitcoin is de digitale valuta met de hoogste status en de grootste kans op lange termijn overleving. Als je wilt garanderen dat je kunst de toekomst overleeft, is er geen betere manier om het te publiceren dan als inscripties.

source: _Cheaper on-chain storage._ At $20,000 per BTC and the minimum relay fee of 1 satoshi per vbyte, publishing inscription content costs $50 per 1 million bytes.
ar: _تخزين أرخص على الشبكة._ اذا افترضنا سعر البيتكوين عشرون الف دولار بتكلفه الرسوم تبلغ واحد ساتوشي لكل vbyte، يكلف نشر محتوى الإنسكريبشين خمسون دولار لكل مليون بايت.
nl: _Goedkoper on-chain opslag._ Tegen $20.000 per BTC en de minimum relay fee van 1 satoshi per vbyte, kost het publiceren van inscriptie-inhoud $50 per 1 miljoen bytes.

source: _Inscriptions are early!_ Inscriptions are still in development, and have not yet launched on mainnet. This gives you an opportunity to be an early adopter, and explore the medium as it evolves.
ar: _الإنسكريبشين مبكره جدا!_ الإنسكريبشين مازالت في مرحلة التطوير. هذا يتيح لك فرصة أن تكون من المستخدمين المبكرين، وتستكشف هذه الوسيلة بمجرد أن تتطور.
nl: _Inscripties zijn vroeg!_ Inscripties zijn nog in ontwikkeling en zijn nog niet op de mainnet gelanceerd. Dit biedt je de kans om een vroege gebruiker te zijn en het medium te verkennen terwijl het evolueert.

source: _Inscriptions are simple._ Inscriptions do not require writing or understanding smart contracts.
ar: _الإنسكريبشين بسيطة._ وهي لا تتطلب كتابة أو فهم عقود ذكية.
nl: _Inscripties zijn eenvoudig._ Inscripties vereisen geen slimme contracten te schrijven of te begrijpen.

source: _Inscriptions unlock new liquidity._ Inscriptions are more accessible and appealing to bitcoin holders, unlocking an entirely new class of collector.
ar: _الإنسكريبشين تحرر سيولة الجديدة._ وسهلة الوصول لمالكي عمله بيتكوين، مما يفتح فئة جديده تمامًا من المجمعين.
nl: _Inscripties ontsluiten nieuwe liquiditeit._ Inscripties zijn toegankelijker en aantrekkelijker voor bitcoinhouders, waardoor een geheel nieuwe klasse van verzamelaars wordt ontsloten.

source: _Inscriptions are designed for digital artifacts._ Inscriptions are designed from the ground up to support NFTs, and feature a better data model, and features like globally unique symbols and enhanced provenance.
ar: _الإنسكريبشين صممت لدعم ديجاتيل ارتيفاكت._ تم تصميمها من نقطه الصفر لدعم NFTs، وتتميز بنموذج بيانات أفضل، وميزات مثل الرموز الفريدة عالميًا والأصول بطريقه محسنة.
nl: _Inscripties zijn ontworpen voor digitale artefacten._ Inscripties zijn vanaf de grond opgebouwd om NFT's te ondersteunen en beschikken over een beter datamodel, evenals functies zoals wereldwijd unieke symbolen en verbeterde herkomst.

source: _Inscriptions do not support on-chain royalties._ This is negative, but only depending on how you look at it. On-chain royalties have been a boon for creators, but have also created a huge amount of confusion in the Ethereum NFT ecosystem. The ecosystem now grapples with this issue, and is engaged in a race to the bottom, towards a royalties-optional future. Inscriptions have no support for on-chain royalties, because they are technically infeasible. If you choose to create inscriptions, there are many ways you can work around this limitation: withhold a portion of your inscriptions for future sale, to benefit from future appreciation, or perhaps offer perks for users who respect optional royalties.
ar: _الإنسكريبشين لا تدعم الفوائد على الشبكة_. هذا سلبي، ولكن هذا فقط يعتمد على كيفية نظرتك إليه. الفوائد على الشبكة كانت نعمة للمبدعين، ولكنها أيضًا خلقت كمية كبيرة من الارتباك في بيئة NFTs على الإيثيريوم. البيئة تتعامل الآن مع هذه المسألة، وكل يتشارك في سباق نحو القاع وإزالة دعم الفوائد المفرضه. الإنسكريبشين ليس لها دعم للفوائد على الشبكة، لأنها تعتبر غير ممكنة تقنيًا. إذا اخترت إنشائها، يمكنك اللجوء الى عدد من الطرق: احتفظ بجزء من المجموعة للبيع في المستقبل، للاستفادة من ارتفاع المستقبلي في القيمة، أو ربما قدم مزايا للمستخدمين الذين يحترمون الفوائد الاختيارية.
nl: _Inscripties ondersteunen geen on-chain royalty's._ Dit is negatief, maar afhankelijk van hoe je het bekijkt. On-chain royalty's zijn een zegen voor makers geweest, maar hebben ook veel verwarring gecreëerd in het Ethereum NFT-ecosysteem. Het ecosysteem worstelt nu met dit probleem en is verwikkeld in een race naar de bodem, richting een toekomst waarin royalty's optioneel zijn. Inscripties hebben geen ondersteuning voor on-chain royalty's, omdat ze technisch onhaalbaar zijn. Als je kiest om inscripties te maken, zijn er veel manieren waarop je deze beperking kunt omzeilen: houd een deel van je inscripties achter voor toekomstige verkoop, om te profiteren van toekomstige waardestijging, of bied misschien voordelen voor gebruikers die optionele royalty's respecteren.

source: Collectors
ar: المجمعين
nl: Verzamelaars

source: _Inscriptions are simple, clear, and have no surprises._ They are always immutable and on-chain, with no special due diligence required.
ar: الإنسكريبشين بسيطة، واضحة، ولا تحمل مفاجآت. غير قابلة للتغيير وعلى الشبكة، دون الحاجة إلى الاطلاع على العقود الذكية بشكل خاص.
nl: _Inscripties zijn eenvoudig, duidelijk en hebben geen verrassingen._ Ze zijn altijd onveranderlijk en on-chain, zonder speciale zorgvuldigheidseisen.

source: _Inscriptions are on Bitcoin._ You can verify the location and properties of inscriptions easily with Bitcoin full node that you control.
ar: الإنسكريبشين على البيتكوين ذاته . يمكنك التحقق من الموقع والخصائص بسهولة باستخدام بيتكوين نود الكامل التي تتحكم بها.
nl: _Inscripties zijn op Bitcoin._ Je kunt de locatie en eigenschappen van inscripties eenvoudig verifiëren met een Bitcoin full node die je zelf beheert.

source: Let me begin this section by saying: the most important thing that the Bitcoin network does is decentralize money. All other use-cases are secondary, including ordinal theory. The developers of ordinal theory understand and acknowledge this, and believe that ordinal theory helps, at least in a small way, Bitcoin's primary mission.
ar: لنبدأ هذا القسم بالقول: أهم شيء تقوم به شبكة بيتكوين هو اللامركزية للأموال. جميع الاستخدامات الأخرى هي ثانوية، بما في ذلك نظرية أوردينال. يفهم مطورو نظرية أوردينال ويقرون بذلك، ويعتقدون أن نظرية أوردينال تساعد، على الأقل بشكل طفيف، في مهمة بيتكوين الرئيسية.
nl: Laat me deze sectie beginnen met te zeggen: het belangrijkste dat het Bitcoin-netwerk doet is het decentraliseren van geld. Alle andere gebruikstoepassingen zijn secundair, inclusief ordinale theorie. De ontwikkelaars van ordinale theorie begrijpen en erkennen dit, en geloven dat ordinale theorie op zijn minst op een kleine manier bijdraagt aan de primaire missie van Bitcoin.

source: Unlike many other things in the altcoin space, digital artifacts have merit. There are, of course, a great deal of NFTs that are ugly, stupid, and fraudulent. However, there are many that are fantastically creative, and creating and collecting art has been a part of the human story since its inception, and predates even trade and money, which are also ancient technologies.
ar: على عكس العديد من الأشياء في مجال العملات البديلة، الآثار الرقمية (digital artifacts) لديها جدارة. هناك بالطبع الكثير من NFTs التي هي قبيحة وغبية واحتيالية. ومع ذلك، هناك العديد من الأعمال الإبداعية بشكل رائع، وإنشاء وجمع الفن كان جزءًا من قصة الإنسان منذ بدايتها، وتسبق حتى التجارة والأموال، التي هي أيضًا تقنيات قديمة.
nl: In tegenstelling tot veel andere dingen in de altcoin-ruimte, hebben digitale artefacten waarde. Er zijn natuurlijk veel NFT's die lelijk, dom en frauduleus zijn. Er zijn echter ook veel NFT's die fantastisch creatief zijn, en het maken en verzamelen van kunst maakt al sinds het begin deel uit van het menselijke verhaal, en gaat zelfs verder terug dan handel en geld, die ook oude technologieën zijn.

source: Bitcoin provides an amazing platform for creating and collecting digital artifacts in a secure, decentralized way, that protects users and artists in the same way that it provides an amazing platform for sending and receiving value, and for all the same reasons.
ar: تقدم بيتكوين منصة رائعة لإنشاء وجمع الآثار الرقمية بطريقة آمنة ولامركزية، تحمي المستخدمين والفنانين بنفس الطريقة التي تقدم بها منصة رائعة لإرسال واستقبال القيمة، وبالأسباب نفسها.
nl: Bitcoin biedt een geweldig platform voor het creëren en verzamelen van digitale artefacten op een veilige, gedecentraliseerde manier, die gebruikers en kunstenaars beschermt op dezelfde manier als het een geweldig platform biedt voor het verzenden en ontvangen van waarde, en om dezelfde redenen.

source: Ordinals and inscriptions increase demand for Bitcoin block space, which increase Bitcoin's security budget, which is vital for safeguarding Bitcoin's transition to a fee-dependent security model, as the block subsidy is halved into insignificance.
ar: تزيد نظرية أوردينال والآثار الرقمية من الطلب على مساحة البلوكس في بيتكوين، مما يزيد من ميزانية الأمان للبيتكوين، وهو أمر حيوي لحماية انتقال بيتكوين إلى نموذج أمان يعتمد على الرسوم، حيث يتم تقليص مكافأة البلوك إلى الأذى.
nl: Ordinals en inscripties verhogen de vraag naar Bitcoin-blockruimte, wat het beveiligingsbudget van Bitcoin vergroot, wat essentieel is voor het waarborgen van de overgang van Bitcoin naar een op vergoedingen gebaseerde beveiligingsmodel, aangezien de blocksubsidie tot verwaarlozing wordt gehalveerd.

source: Inscription content is stored on-chain, and thus the demand for block space for use in inscriptions is unlimited. This creates a buyer of last resort for _all_ Bitcoin block space. This will help support a robust fee market, which ensures that Bitcoin remains secure.
ar: محتوى الرسوم الرقمية الإنسكريبشين يُخزن على السلسلة / الشبكة ذاتها، وبالتالي فإن الطلب على مساحة البلوك لا حدود له. هذا يخلق مشتريًا من آخر فرصة لمساحة البلوكس على البيتكوين. سيساعد ذلك في دعم السوق بشكل عام ، الذي يضمن أن البيتكوين سيبقى آمنًا.
nl: Inscriptie-inhoud wordt on-chain opgeslagen, en de vraag naar blockruimte voor inscripties is dus onbeperkt. Dit creëert een koper van laatste instantie voor _alle_ Bitcoin blockruimte. Dit zal helpen om een robuuste vergoedingmarkt te ondersteunen, wat ervoor zorgt dat Bitcoin veilig blijft.

source: Inscriptions also counter the narrative that Bitcoin cannot be extended or used for new use-cases. If you follow projects like DLCs, Fedimint, Lightning, Taro, and RGB, you know that this narrative is false, but inscriptions provide a counter argument which is easy to understand, and which targets a popular and proven use case, NFTs, which makes it highly legible.
ar: الإنسكريبشين تبرهن أيضًا على السيناريو الذي يُفترض أنه لا يمكن للبيتكوين تمديدها أو استخدامها لحالات جديدة . إذا تابعت مشاريع مثل DLCs و Fedimint و Lightning و Taro و RGB، فستعرف أن هذا السيناريو غير صحيح، ولكن الإنسكريبشين تقدم حجة مضادة تكون سهلة الفهم، والتي تستهدف حالات استخدام شائعة ومثبتة، NFTs، والتي تجعلها سهلة الفهم.
nl: Inscripties weerleggen ook het narratief dat Bitcoin niet kan worden uitgebreid of gebruikt voor nieuwe use-cases. Als je projecten zoals DLC's, Fedimint, Lightning, Taro en RGB volgt, weet je dat dit narratief onjuist is, maar inscripties bieden een tegenargument dat gemakkelijk te begrijpen is, en dat zich richt op een populaire en bewezen use case, NFT's, wat het zeer begrijpelijk maakt.

source: If inscriptions prove, as the authors hope, to be highly sought after digital artifacts with a rich history, they will serve as a powerful hook for Bitcoin adoption: come for the fun, rich art, stay for the decentralized digital money.
ar: إذا ثبت أن الإنسكريبشين كما نأمل ، كي تكون بشكل كبير ولها تاريخ غني، ستكون سلاحًا قويًا لتبني بيتكوين: تأتي من أجل المتعة والفن الغني، وتبقى للنقود الرقمية المتميزة.
nl: Als inscripties, zoals de auteurs hopen, highly sought after digitale artefacten met een rijke geschiedenis blijken te zijn, zullen ze dienen als een krachtige haak voor Bitcoin-adoptie: kom voor het plezierige, rijke kunstwerk, blijf voor het gedecentraliseerde digitale geld.

source: Inscriptions are an extremely benign source of demand for block space. Unlike, for example, stablecoins, which potentially give large stablecoin issuers influence over the future of Bitcoin development, or DeFi, which might centralize mining by introducing opportunities for MEV, digital art and collectables on Bitcoin, are unlikely to produce individual entities with enough power to corrupt Bitcoin. Art is decentralized.
ar: الإنسكريبشين هي مصدر طلب عالي للمساحات في البلوكس بشكل سلمي للغاية. وعلى عكس العملات المستقرة في سبيل المثال، التي قد تمنح المصدرين الكبار لعملات المستقرة نفوذًا على مستقبل تطوير بيتكوين، أو DeFi، التي قد تركز التعدين من خلال تقديم فرص للربح من الفرص، فإن الفن وجمع المجمعات على بيتكوين غير مرجح أن تنتج كيانات فردية لديها قوة كافية لتفسير بيتكوين. الفن هو لامركزي.
nl: Inscripties zijn een uiterst onschadelijke bron van vraag naar blokruimte. In tegenstelling tot bijvoorbeeld stablecoins, die potentiëel grote stablecoin-uitgevers invloed kunnen geven op de toekomst van Bitcoin-ontwikkeling, of DeFi, dat mogelijk mining kan centraliseren door kansen voor MEV te introduceren, zullen digitale kunst en verzamelobjecten op Bitcoin waarschijnlijk geen individuele entiteiten voortbrengen met genoeg macht om Bitcoin te corrumperen. Kunst is gedecentraliseerd.

source: Inscription users and service providers are incentivized to run Bitcoin full nodes, to publish and track inscriptions, and thus throw their economic weight behind the honest chain.
ar: المستخدمين ومقدمي الخدمات من الإنسكريبشين متحفزون لتشغيل النود الكامل للبيتكوين، للنشر والتتبع ، وبالتالي إلقاء ثقلها الاقتصادي وراء الشبكة الصادقة.
nl: Gebruikers van inscripties en dienstverleners worden gestimuleerd om Bitcoin full nodes te draaien, om inscripties te publiceren en bij te houden, en daarmee hun economische gewicht achter de eerlijke keten te plaatsen.

source: Ordinal theory and inscriptions do not meaningfully affect Bitcoin's fungibility. Bitcoin users can ignore both and be unaffected.
ar: نظرية أوردينال والرسوم الرقمية الإنسكريبشين لا تؤثر بشكل كبير على تماثل البيتكوين. يمكن لمستخدمي عمله البيتكوين تجاهل كليهما ولا يتأثرون بهما.
nl: Ordinale theorie en inscripties beïnvloeden de verhandelbaarheid van Bitcoin niet op een betekenisvolle manier. Bitcoin-gebruikers kunnen beide negeren en worden er niet door beïnvloed.

source: We hope that ordinal theory strengthens and enriches bitcoin, and gives it another dimension of appeal and functionality, enabling it more effectively serve its primary use case as humanity's decentralized store of value.
ar: نأمل أن تقوي نظرية أوردينال وتثري بيتكوين، وتضيف لها بعدًا آخر من الجاذبية والوظائف، مما يمكنها تحقيق مهمتها الأساسية كمتجر قيمة لامركزي للبشرية بشكل أكثر فعالية.
nl: We hopen dat de ordinale theorie Bitcoin versterkt en verrijkt, en het een extra dimensie van aantrekkingskracht en functionaliteit geeft, zodat het effectiever zijn primaire gebruiksdoel kan dienen als de gedecentraliseerde waardeopslag van de mensheid.

source: Contributing to `ord`
ar: المساهمة في أورد
nl: Contributies aan `ord`

source: Suggested Steps
ar: خطوات مقترحة
nl: Voorgestelde Stappen

source: Find an issue you want to work on.
ar: ابحث عن مشكلة ترغب في العمل عليها.
nl: Vind een probleem waar je aan wilt werken.

source: Figure out what would be a good first step towards resolving the issue. This could be in the form of code, research, a proposal, or suggesting that it be closed, if it's out of date or not a good idea in the first place.
ar: حدد ما هي أول خطوة جيدة لحل المشكلة. يمكن أن يكون ذلك على شكل كود أو بحث أو اقتراح، أو اقتراح إغلاق المشكلة إذا كانت قديمة أو ليست فكرة جيدة من الأساس.
nl: Bepaal wat een goede eerste stap zou zijn om het probleem op te lossen. Dit kan in de vorm van code, onderzoek, een voorstel, of het voorstellen om het probleem te sluiten als het verouderd of niet goed is in de eerste plaats.

source: Comment on the issue with an outline of your suggested first step, and asking for feedback. Of course, you can dive in and start writing code or tests immediately, but this avoids potentially wasted effort, if the issue is out of date, not clearly specified, blocked on something else, or otherwise not ready to implement.
ar: قم بوضع تعليق على المشكلة مع تحديد للخطوة الأولى المقترحة من قبلك، واطلب بعض الاقتراحات. بالطبع، يمكنك أن تقوم فوراً بالبدء في كتابة الكود أو الاختبارات، ولكن هذا يمكن أن يجنبك الجهد الضائع في حال كانت المشكلة قديمة أو لم يتم تحديدها بوضوح، أو محظورة من الناحية الأخرى، أو غير جاهزة للتنفيذ من الأساس.
nl: Plaats een reactie op het probleem met een overzicht van je voorgestelde eerste stap en vraag om feedback. Natuurlijk kun je ook meteen beginnen met het schrijven van code of tests, maar dit voorkomt mogelijk verspilde inspanningen als het probleem verouderd is, niet duidelijk is gespecificeerd, geblokkeerd is door iets anders, of om een andere reden niet klaar is voor implementatie.

source: If the issue requires a code change or bugfix, open a draft PR with tests, and ask for feedback. This makes sure that everyone is on the same page about what needs to be done, or what the first step in solving the issue should be. Also, since tests are required, writing the tests first makes it easy to confirm that the change can be tested easily.
ar: إذا كانت المشكلة تتطلب تغييرًا في الكود أو إصلاحًا للأخطاء، قم بفتح PR (Pull Request) مؤقت (Draft) مع الاختبارات، واطلب بعض الاقتراحات. وهذا يأكد من أن الجميع على نفس الصفحة بشأن العمل الذي تريد القيام به، أو ما يجب أن تكون الخطوة الأولى في حل المشكلة. وأيضًا، نظرًا لأن الاختبارات مطلوبة، فإن كتابة الاختبارات أولاً يجعل من السهل التحقق من أن التغيير يمكن اختباره بسهولة.
nl: Als het probleem een codewijziging of bugfix vereist, open dan een concept-PR met tests en vraag om feedback. Dit zorgt ervoor dat iedereen op dezelfde lijn zit over wat er moet gebeuren of wat de eerste stap in het oplossen van het probleem zou moeten zijn. Aangezien tests vereist zijn, maakt het schrijven van de tests eerst het gemakkelijk om te bevestigen dat de wijziging eenvoudig te testen is.

source: Mash the keyboard randomly until the tests pass, and refactor until the code is ready to submit.
ar: اضغط على لوحة المفاتيح بشكل عشوائي حتى تنجح الاختبارات، وقم بإعادة التنظيم حتى يكون الكود جاهزًا للإرسال.
nl: Random op de toetsenbord slaan totdat de tests slagen, en refactoren totdat de code klaar is om in te dienen.

source: Mark the PR as ready to review.
ar: علم PR كجاهز للمراجعة.
nl: Mark de PR als klaar voor beoordeling.
