Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: Summary
nl: Samenvatting

source: Introduction
ar: المقدمة
nl: Introductie

source: Overview
ar: نظرة عامة
nl: Overzicht

source: Digital Artifacts
ar: التحف الرقمية
nl: Digitale artefacten

source: Inscriptions
ar: إنسكريبشين
nl: Inscripties

source: Delegate
nl: Gemachtigde

source: Recursion
ar: التكرار
nl: Recursie

source: Specification
nl: Specificatie

source: FAQ
ar: الأسئلة الشائعة
nl: Veelgestelde Vragen

source: Contributing
ar: المساهمة
nl: Bijdragen

source: Donate
ar: التبرع
nl: Donaties

source: Guides
ar: إرشادات
nl: Handleidingen

source: Explorer
ar: المتصفح
nl: Verkenner

source: Batch Inscribing
nl: Batch Inscriptie

source: Collecting
ar: التجميع
nl: Verzamelen

source: Moderation
ar: الإشراف
nl: Beheer

source: Reindexing
ar: إعادة الفهرسة
nl: Herindexeren

source: Sat Hunting
ar: جمع الساتوشي
nl: Sats Jagen

source: Settings
nl: Instellingen

source: Teleburning
nl: Teleburnen

source: Testing
ar: التجارب
nl: Testen

source: Bounties
ar: المكافآت
nl: Beloningen

source: Bounty 0: 100,000 sats Claimed!
ar: جائزة 0: 100,000 ساتوشي مكتملة!
nl: Beloning 0: 100.000 sats Geclaimd!

source: Bounty 1: 200,000 sats Claimed!
ar: جائزة 1: 200,000 ساتوشي مكتملة!
nl: Beloning 1: 200.000 sats Geclaimd!

source: Bounty 2: 300,000 sats Claimed!
ar: جائزة 2: 300,000 ساتوشي مكتملة!
nl: Beloning 2: 300.000 sats Geclaimd!

source: Bounty 3: 400,000 sats
ar: جائزة 3: 400,000 ساتوشي
nl: Beloning 3: 400.000 sats

source: This handbook is a guide to ordinal theory. Ordinal theory concerns itself with satoshis, giving them individual identities and allowing them to be tracked, transferred, and imbued with meaning.
ar: مقدمة هذا الكتيب هو دليل لنظرية ordinal. تعنى بتحديد بالساتوشي، حيث تمنحها هويات فردية وتسمح لها بالتتبع والإرسال، وتمنحها معنى.
nl: Deze handleiding is een gids voor de ordinale theorie. De ordinale theorie richt zich op satoshis, geeft ze individuele identiteiten en maakt het mogelijk om ze te volgen, over te dragen en van betekenis te voorzien.

source: Satoshis, not bitcoin, are the atomic, native currency of the Bitcoin network. One bitcoin can be sub-divided into 100,000,000 satoshis, but no further.
ar: الساتوشي، وليس البيتكوين، هي العملة الذرية والأصلية لشبكة البيتكوين. يمكن تقسيم البيتكوين إلى 100,000,000 ساتوشي، ولكن لا يمكن تقسيم الساتوشي إلى مقاييس أصغر.
nl: Satoshis, en niet bitcoin, zijn de atomische, native valuta van het Bitcoin-netwerk. Eén bitcoin kan worden onderverdeeld in 100.000.000 satoshis, maar niet verder.

source: Ordinal theory does not require a sidechain or token aside from Bitcoin, and can be used without any changes to the Bitcoin network. It works right now.
ar: نظرية الترتيب الترتيبيّ لا تحتاج إلى سلسلة فرعية أو رمز بديل إلى جانب البيتكوين، ويمكن استخدامها دون أي تغيير في شبكة البيتكوين. وهي تعمل الآن.
nl: De ordinale theorie vereist geen sidechain of token naast Bitcoin, en kan worden gebruikt zonder wijzigingen aan het Bitcoin-netwerk. Het werkt nu al.

source: Ordinal theory imbues satoshis with numismatic value, allowing them to be collected and traded as curios.
ar: نظرية ordinal تُضفي قيمة عملانية على الساتوشي، مما يسمح لها بالتجميع والتداول كالكنوز.
nl: De ordinale theorie verleent satoshis numismatische waarde, waardoor ze kunnen worden verzameld en verhandeld als verzamelobjecten.

source: Individual satoshis can be inscribed with arbitrary content, creating unique Bitcoin-native digital artifacts that can be held in Bitcoin wallets and transferred using Bitcoin transactions. Inscriptions are as durable, immutable, secure, and decentralized as Bitcoin itself.
ar: يمكن أن يتم نقش الساتوشي الفردي بمحتوى تعسفي، مما يخلق قطعًا فريدة من الأصول الرقمية الأصلية للبيتكوين يمكن الاحتفاظ بها في محافظ البيتكوين او نقلها باستخدام معاملات البيتكوين. الإنسكريبشين متينة وثابتة وآمنة ومركزية تمامًا كالبيتكوين نفسه.
nl: Individuele satoshis kunnen worden geïnscribeerd met willekeurige inhoud, waardoor unieke Bitcoin-native digitale artefacten ontstaan die kunnen worden opgeslagen in Bitcoin-wallets en overgedragen via Bitcoin-transacties. Inschrijvingen zijn net zo duurzaam, onveranderlijk, veilig en gedecentraliseerd als Bitcoin zelf.

source: Other, more unusual use-cases are possible: off-chain colored-coins, public key infrastructure with key rotation, a decentralized replacement for the DNS. For now though, such use-cases are speculative, and exist only in the minds of fringe ordinal theorists.
ar: هناك استخدامات أخرى أكثر غرابة ممكنة: عملات ملونة خارج السلسلة، بنية البنية التحتية للمفتاح العام مع تدوير المفتاح، بديل لامركزي لنظام DNS. ومع ذلك، تعد مثل هذه الاستخدامات حاليًا موضوعية، وتكمن فقط في أذهان النظريين الترتيبيين المتطرفين.
nl: Andere, meer ongewone gebruikstoepassingen zijn mogelijk: off-chain gekleurde munten, publieke sleutel-infrastructuur met sleutelrotatie, een gedecentraliseerde vervanging voor de DNS. Voor nu zijn dergelijke toepassingen echter speculatief en bestaan ze alleen in de gedachten van ordinale theoretici.

source: For more details on ordinal theory, see the [overview](overview.md).
ar: للحصول على مزيد من التفاصيل حول نظرية ordinal ، راجع [overview](overview.md).
nl: Voor meer details over de ordinale theorie, zie het [overzicht](overview.md).

source: For more details on inscriptions, see [inscriptions](inscriptions.md).
nl: Voor meer details over de inscripties, zie [inscripties].](inscriptions.md).

source: When you're ready to get your hands dirty, a good place to start is with [inscriptions](guides/wallet.md), a curious species of digital artifact enabled by ordinal theory.
ar: عندما تكون جاهزًا لبدء العمل، مكانًا جيدًا للبداية هو [inscriptions](guides/wallet.md)، وهي نوع فضولي من الأصول الرقمية digital artifact الممكّنة بواسطة نظرية أوردينالس.
nl: Wanneer je klaar bent om je handen vuil te maken, is een goed begin met [inscripties].(guides/wallet.md), een soort digitaal artefact mogelijk gemaakt door de ordinale theorie.

source: [Open Ordinals Institute Website](https://ordinals.org/)
nl: [Website van het Open Ordinals Instituut](https://ordinals.org/)

source: [Open Ordinals Institute X](https://x.com/ordinalsorg)
nl: [X van Open Ordinals Instituut](https://x.com/ordinalsorg)

source: [Mainnet Block Explorer](https://ordinals.com)
nl: [Block Explorer voor Mainnet](https://ordinals.com)

source: [Signet Block Explorer](https://signet.ordinals.com)
nl: [Block Explorer voor Signet](https://signet.ordinals.com)

source: [Ordinal Theory Explained: Satoshi Serial Numbers and NFTs on Bitcoin](https://www.youtube.com/watch?v=rSS0O2KQpsI)
nl: [Uitleg van de ordinale theorie: Seriële nummers van Satoshis en NFT's op Bitcoin](https://www.youtube.com/watch?v=rSS0O2KQpsI)

source: [Ordinals Workshop with Rodarmor](https://www.youtube.com/watch?v=MC_haVa6N3I)
nl: [Ordinals Workshop met Rodarmor](https://www.youtube.com/watch?v=MC_haVa6N3I&ab_channel=PlebLab)

source: Ordinal Theory Overview
ar: لمحة عامة عن نظرية أوردينالس
nl: Algemeen Overzicht van de Ordinale Theorie

source: Ordinals are a numbering scheme for satoshis that allows tracking and transferring individual sats. These numbers are called [ordinal numbers](https://ordinals.com). Satoshis are numbered in the order in which they're mined, and transferred from transaction inputs to transaction outputs first-in-first-out. Both the numbering scheme and the transfer scheme rely on _order_, the numbering scheme on the _order_ in which satoshis are mined, and the transfer scheme on the _order_ of transaction inputs and outputs. Thus the name, _ordinals_.
ar: الأوردينال هي نظام ترقيم للساتوشيات يسمح بتتبع ونقل الساتوشيات الفردية. يُطلق على هذه الأرقام اسم [أرقام ترتيبية](https://ordinals.com). يتم ترقيم الساتوشيات بحسب الترتيب الذي تم فيه تعدينها، ويتم نقلها من مداخل الصفقات إلى مخارج الصفقات بالترتيب الذي دخلت به أولاً. كل من نظام الترقيم ونظام النقل يعتمد على الترتيب، حيث يعتمد نظام الترقيم على الترتيب الذي تم به تعدين الساتوشيات، ويعتمد نظام النقل على ترتيب مداخل ومخارج الصفقات. وبالتالي يطلق عليها اسم _ordinals_.
nl: De Ordinals zijn een nummeringssysteem voor satoshis waarmee we ze individueel kunnen volgen en overdragen. Deze nummers worden [ordinale nummers] genoemd.(https://ordinals.com/). Elke satoshi krijgt een serienummer toegewezen dat wordt vastgesteld volgens de volgorde waarin ze zijn gemijnd en worden overgedragen op basis van de volgorde van de transactie-inputs en -outputs, volgens het FIFO (First In, First Out) proces. Zowel het nummeringssysteem als het overdrachtsysteem zijn gebaseerd op de _volgorde_; het nummeringssysteem op de _volgorde_ waarin de satoshis worden gemijnd, terwijl het overdrachtsysteem gebaseerd is op de _volgorde_ van de inputs en outputs van de transacties. Vandaar de naam, _ordinals_.

source: Technical details are available in [the BIP](https://github.com/ordinals/ord/blob/master/bip.mediawiki).
ar: التفاصيل التقنية متاحة في [the BIP](https://github.com/ordinals/ord/blob/master/bip.mediawiki).
nl: De technische details zijn beschikbaar in [het BIP].(https://github.com/ordinals/ord/blob/master/bip.mediawiki).

source: Ordinal theory does not require a separate token, another blockchain, or any changes to Bitcoin. It works right now.
ar: نظريه أوردينال لا تحتاج عملة مميزة منفصلة أو بلوكشين أخرى أو أي تغييرات في بيتكوين .فهي تعمل الآن.
nl: De ordinale theorie werkt momenteel zonder wijzigingen aan Bitcoin en vereist geen apart token of andere blockchain.

source: Ordinal numbers have a few different representations:
ar: أرقام أوردينال لها عدة تمثيلات مختلفة:
nl: De ordinale nummers hebben verschillende representaties:

source: _Integer notation_: [`2099994106992659`](https://ordinals.com/sat/2099994106992659) The ordinal number, assigned according to the order in which the satoshi was mined.
ar: تمثيل العدد الصحيح: [`2099994106992659`](https://ordinals.com/sat/2099994106992659) هو عدد ترتيبي، يتم تعيينه وفقا للترتيب الذي تم به تعدين الساتوشي.
nl: _Integere Notatie_: [`2099994106992659`](https://ordinals.com/sat/2099994106992659). Het ordinale nummer, toegewezen volgens de volgorde waarin de Satoshi werd gemijnd.

source: _Decimal notation_: [`3891094.16797`](https://ordinals.com/sat/3891094.16797) The first number is the block height in which the satoshi was mined, the second the offset of the satoshi within the block.
ar: تمثيل العدد العشري: [`3891094.16797`](https://ordinals.com/sat/3891094.16797) الرقم الأول هو ارتفاع البلوك (block) التي تم بها تعدين الساتوشي، والرقم الثاني هو الانحراف للساتوشي داخل البلوك.
nl: _Decimale Notatie_: [` 3891094.16797`](https://ordinals.com/sat/3891094.16797) Het eerste nummer is de blockhoogte waarin de Satoshi werd gemijnd, het tweede nummer is de offset van de Satoshi binnen het block.

source: _Degree notation_: [`3°111094′214″16797‴`](https://ordinals.com/sat/3%C2%B0111094%E2%80%B2214%E2%80%B316797%E2%80%B4). We'll get to that in a moment.
ar: تمثيل الزاوية: [`3°111094′214″16797‴`](https://ordinals.com/sat/3%C2%B0111094%E2%80%B2214%E2%80%B316797%E2%80%B4) سنصل لذلك لاحقا.
nl: _Gradennotatie_: [`3°111094′214″16797‴`](https://ordinals.com/sat/3%C2%B0111094%E2%80%B2214%E2%80%B316797%E2%80%B4). Daar komen we zo op terug.

source: _Percentile notation_: [`99.99971949060254%`](https://ordinals.com/sat/99.99971949060254%25) . The satoshi's position in Bitcoin's supply, expressed as a percentage.
ar: تمثيل النسبة المئوية: [`99.99971949060254%`](https://ordinals.com/sat/99.99971949060254%25) موضع الساتوشي في إمدادات بيتكوين، ويعبر عنه كنسبة مئوية.
nl: _Percentilenotatie_: [`99.99971949060254%`](https://ordinals.com/sat/99.99971949060254%25) . De positie van de Satoshi in de Bitcoin-aanvoer, uitgedrukt als een percentage.

source: _Name_: [`satoshi`](https://ordinals.com/sat/satoshi). An encoding of the ordinal number using the characters `a` through `z`.
ar: الاسم: [`satoshi`](https://ordinals.com/sat/satoshi) . ترميز للرقم الترتيبي باستخدام الأحرف من `a` إلى `z`.
nl: _Naam_: [`Satoshi`](https://ordinals.com/sat/satoshi). Een codering van het ordinale nummer met behulp van de tekens van `a` tot `z`.

source: Arbitrary assets, such as NFTs, security tokens, accounts, or stablecoins can be attached to satoshis using ordinal numbers as stable identifiers.
ar: يمكن ربط الأصول المختلفة، مثل NFTs والعملات المستقرة والحسابات والرموز الأمانية، بالساتوشيات باستخدام الأرقام الترتيبية كمُعرفات مستقرة.
nl: Arbitraire activa zoals NFT's, beveiligingstokens, accounts of stablecoins kunnen aan de satoshis worden gekoppeld met behulp van ordinale nummers als identificatoren.

source: Ordinals is an open-source project, developed [on GitHub](https://github.com/ordinals/ord). The project consists of a BIP describing the ordinal scheme, an index that communicates with a Bitcoin Core node to track the location of all satoshis, a wallet that allows making ordinal-aware transactions, a block explorer for interactive exploration of the blockchain, functionality for inscribing satoshis with digital artifacts, and this manual.
ar: أوردينالس هو مشروع مفتوح المصدر، تم تطويره على منصة [on GitHub](https://github.com/ordinals/ord). يتكون المشروع من BIP الذي يصف لنظام أوردينال، وفهرس يتواصل مع Bitcoin Core node لتتبع موقع جميع الساتوشيات، ومحفظة تسمح بإجراء صفقات ترتيبية ordinal-aware ، ومتصفح كتل لاستكشاف التفاعلي ل البلوكشين، ووظيفته تسجيل معاملات الساتوشيات بالقطع الرقمية، وهذا الدليل.
nl: Ordinals is een open-sourceproject, ontwikkeld [op GitHub](https://github.com/ordinals/ord). Het project bestaat uit een BIP dat het ordinale schema beschrijft, een index die communiceert met een Bitcoin Core-node om de locatie van alle satoshis te volgen, een portemonnee waarmee ordinale transacties kunnen worden uitgevoerd, een block explorer voor interactieve verkenning van de blockchain, functionaliteit om digitale artefacten op satoshis in te schrijven, en deze handleiding.

source: Rarity
ar: الندرة
nl: Zeldzaamheid

source: Humans are collectors, and since satoshis can now be tracked and transferred, people will naturally want to collect them. Ordinal theorists can decide for themselves which sats are rare and desirable, but there are some hints…
ar: البشر هم مجمعون، وبما أن الساتوشيات يمكن تتبعها وإرسالها الآن، سترغب الناس بشكل طبيعي في جمعهم. الجميع يمكن أن يحدد أي من الساتوشيات هي نادرة ومرغوب فيها، ولكن هناك بعض التلميحات...
nl: Mensen zijn verzamelaars, en nu satoshis kunnen worden gevolgd en overgedragen, zullen mensen ze willen verzamelen. Ordinale theoretici kunnen zelf bepalen welke sats zeldzaam en gewild zijn, maar hier zijn enkele aanwijzingen…

source: Bitcoin has periodic events, some frequent, some more uncommon, and these naturally lend themselves to a system of rarity. These periodic events are:
ar: بيتكوين لديها أحداث دورية، بعضها متكرر وبعضها أقل انتظامًا، وهذه الأحداث تميل بشكل طبيعي إلى نظام ندرة. هذه الأحداث الدورية هي:
nl: Bitcoin kent periodieke evenementen, sommige frequent en andere minder gebruikelijk, en deze lenen zich voor een systeem van zeldzaamheid. Deze periodieke evenementen zijn:

source: _Blocks_: A new block is mined approximately every 10 minutes, from now until the end of time.
ar: _بلوكس_: يتم تعدين بلوك جديد تقريبًا كل 10 دقائق، من الآن وحتى نهاية الزمان.
nl: _Blokken_: Er wordt ongeveer elke 10 minuten een nieuw blok gemijnd, vanaf nu tot het einde der tijden.

source: _Difficulty adjustments_: Every 2016 blocks, or approximately every two weeks, the Bitcoin network responds to changes in hashrate by adjusting the difficulty target which blocks must meet in order to be accepted.
ar: _تعديلات الصعوبة_: كل 2016 بلوك ، أو تقريبًا كل أسبوعين، يستجيب شبكة بيتكوين للتغيرات في معدل الهاش بضبط هدف الصعوبة الذي يجب أن تلبيه البلوكس حتى يتم قبولها.
nl: _Moeilijkheidsaanpassingen_: Elke 2016 blokken, of ongeveer elke twee weken, reageert het Bitcoin-netwerk op veranderingen in de hash-snelheid door de moeilijkheid aan te passen die blokken moeten voldoen om geaccepteerd te worden.

source: _Halvings_: Every 210,000 blocks, or roughly every four years, the amount of new sats created in every block is cut in half.
ar: _التقسيمات_: كل 210,000 بلوك، أو تقريبًا كل أربع سنوات، يتم قطع كمية الساتوشيات الجديدة التي تم إنشاؤها في كل كتلة إلى النصف.
nl: _Halveringen_: Elke 210.000 blokken, of ongeveer elke vier jaar, wordt het aantal nieuwe sats dat in elk blok wordt aangemaakt gehalveerd.

source: _Cycles_: Every six halvings, something magical happens: the halving and the difficulty adjustment coincide. This is called a conjunction, and the time period between conjunctions a cycle. A conjunction occurs roughly every 24 years. The first conjunction should happen sometime in 2032.
ar: _الدورات_: كل ست تقسيمات، يحدث شيء سحري: التقسيم وتعديل الصعوبة يتزامنان. يُطلق على هذا اسم "توازن"، والفترة الزمنية بين التوازنات هي دورة. يحدث التوازن تقريبًا كل 24 سنة. يجب أن يحدث التوازن الأول في وقت ما بين عامي 2031 و 2032.
nl: _Cycli_: Na elke zes halvings gebeurt er iets magisch: de halving en de moeilijkheidsaanpassing vallen samen. Dit wordt een conjunctie genoemd, en de periode tussen conjuncties wordt een cyclus genoemd. Een conjunctie vindt ongeveer elke 24 jaar plaats. De eerste conjunctie zou ergens in 2032 moeten plaatsvinden.

source: This gives us the following rarity levels:
ar: هذا يمنحنا مستويات الندرة التالية:
nl: Dit geeft ons de volgende zeldzaamheidsniveaus:

source: `common`: Any sat that is not the first sat of its block
ar: `شائع`: أي ساتوشي ليس أول ساتوشي في البلوك الخاص به
nl: `Gewoon`: Elke sat die niet de eerste sat van zijn blok is

source: `uncommon`: The first sat of each block
ar: `غير شائع`: أول ساتوشي في كل بلوك
nl: `Ongewoon`: De eerste sat van elk blok

source: `rare`: The first sat of each difficulty adjustment period
ar: `نادر`: أول ساتوشي في كل فترة تعديل للصعوبة
nl: `Zeldzaam`: De eerste sat van elke moeilijkheidsaanpassingsperiode

source: `epic`: The first sat of each halving epoch
ar: `ملحمي`: أول ساتوشي في كل عصر للتقسيم
nl: `Episch`: De eerste sat van elke halveringscyclus

source: `legendary`: The first sat of each cycle
ar: `أسطوري`: أول ساتوشي في كل دورة
nl: `Legendarisch`: De eerste sat van elke cyclus

source: `mythic`: The first sat of the genesis block
ar: `أسطوري بالغ`: أول ساتوشي في اول بلوك
nl: `Mythisch`: De eerste sat van het genesisblok

source: Which brings us to degree notation, which unambiguously represents an ordinal number in a way that makes the rarity of a satoshi easy to see at a glance:
ar: وهذا يقودنا إلى تمثيل الزاوية، الذي يُمثل رقم الأوردينال بشكل لا شك فيه بطريقة تجعل ندرة الساتوشي واضحة في نظرة واحدة:
nl: Dit brengt ons bij de gradennotatie, die een ordinaal nummer eenduidig weergeeft op een manier die de zeldzaamheid van een satoshi in één oogopslag duidelijk maakt:

source: Ordinal theorists often use the terms "hour", "minute", "second", and "third" for _A_, _B_, _C_, and _D_, respectively.
ar: غالبًا ما يستخدم الناس مصطلحات «ساعة» و «دقيقة» و «ثانية» و «ثالثة» لـ A و B و C و _D_ تباعا.
nl: Ordinale theoretici gebruiken vaak de termen "uur", "minuut", "seconde" en "derde" voor _A_, _B_, _C_ en _D_ respectievelijk.

source: Now for some examples. This satoshi is common:
ar: الآن لبعض الأمثلة. هذا الساتوشي شائع :
nl: Bijvoorbeeld, deze Satoshi is gewoon:

source: This satoshi is uncommon:
ar: هذا الساتوشي غير شائع:
nl: Deze satoshi is ongewoon:

source: This satoshi is rare:
ar: هذا الساتوشي نادر:
nl: Deze satoshi is zeldzaam:

source: This satoshi is epic:
ar: هذا الساتوشي ملحمي:
nl: Deze satoshi is episch:

source: This satoshi is legendary:
ar: هذا الساتوشي أسطوري:
nl: Deze satoshi is legendarisch:

source: And this satoshi is mythic:
ar: هذا الساتوشي أسطوري بالغ:
nl: Deze satoshi is mythisch:

source: If the block offset is zero, it may be omitted. This is the uncommon satoshi from above:
ar: إذا كان إزاحة block هي صفر، يمكن حذفها. هذا هو الساتوشي هو غير الشائع من أعلاه:
nl: Als de blokpositie nul is, kan deze worden weggelaten. Dit is de ongewone satoshi van hierboven:

source: Rare Satoshi Supply
ar: إمدادات الساتوشي النادرة
nl: Zeldzame Satoshi Voorraad

source: Total Supply
ar: إجمالي الإمدادات
nl: Totale Voorraad

source: `common`: 2.1 quadrillion
ar: `شائع`: 2.1 كوادرليون
nl: `gewoon`: 2,1 biljard

source: `uncommon`: 6,929,999
ar: `غير شائع`: 6,929,999
nl: `ongewoon`: 6,929,999

source: `rare`: 3437
ar: `نادر`: 3437
nl: `zeldzaam`: 3437

source: `epic`: 32
ar: `ملحمي`: 32
nl: `episch`: 32

source: `legendary`: 5
ar: `أسطوري`: 5
nl: `legendarisch`: 5

source: `mythic`: 1
ar: `أسطوري بالغ`: 1
nl: `mythisch`: 1

source: Current Supply
ar: الإمدادات الحاليه
nl: Huidige Voorraad

source: `common`: 1.9 quadrillion
ar: `شائع`: 1.9 كوادرليون
nl: `gewoon`: 1.9 biljard

source: `uncommon`: 808,262
nl: `ongewoon`: 808,262

source: `rare`: 369
ar: `نادر`: 369
nl: `zeldzaam`: 369

source: `epic`: 3
ar: `ملحمي`: 3
nl: `episch`: 3

source: `legendary`: 0
ar: `أسطوري`: 0
nl: `legendarisch`: 0

source: At the moment, even uncommon satoshis are quite rare. As of this writing, 745,855 uncommon satoshis have been mined - one per 25.6 bitcoin in circulation.
ar: في الوقت الحالي، حتى الساتوشي غير الشائع نادر جدًا. اعتبارًا من هذه الكتابة، تم استخراج 745855 ساتوشي غير شائع - واحد لكل 25.6 بيتكوين متداول.
nl: Op dit moment zijn zelfs ongewone satoshis vrij zeldzaam. Op het moment van schrijven zijn er 745.855 ongewone satoshis gemijnd - één per 25,6 bitcoin in omloop.

source: Names
ar: الأسماء
nl: Namen

source: Each satoshi has a name, consisting of the letters _A_ through _Z_, that get shorter the further into the future the satoshi was mined. They could start short and get longer, but then all the good, short names would be trapped in the unspendable genesis block.
ar: لكل ساتوشي اسم مكون من الحروف من "A" إلى "Z"، وهذه الأسماء تصبح أقصر كلما تقدمنا من التعدين في المستقبل. يمكن أن تبدأ الأسماء بشكل قصير وتصبح أطول، ولكن في هذه الحالة ستصبح جميع الأسماء الجيدة والقصيرة محصورة في البلوك الأول الذي لا يمكن الوصول اليه.
nl: Elke satoshi heeft een naam, bestaande uit de letters A tot Z, die korter worden naarmate de satoshi verder in de toekomst is gemijnd. Ze zouden kort kunnen beginnen en langer worden, maar dan zouden alle goede, korte namen vastzitten in het onuitgeefbare genesisblok.

source: As an example, 1905530482684727°'s name is "iaiufjszmoba". The name of the last satoshi to be mined is "a". Every combination of 10 characters or less is out there, or will be out there, someday.
ar: على سبيل المثال، اسم 1905530482684727° هو "iaiufjszmoba". واسم آخر ساتوشي سيتم تعدينه هو "a". كل تسلسل مكون من 10 أحرف أو أقل موجود، أو سيكون موجودًا يومًا ما.
nl: Als voorbeeld: de naam van 1905530482684727° is "iaiufjszmoba". De naam van de laatste satoshi die ooit zal worden gemijnd is "a". Elke combinatie van 10 karakters of minder bestaat of zal ooit bestaan.

source: Exotics
ar: نوادر
nl: Exoten

source: Satoshis may be prized for reasons other than their name or rarity. This might be due to a quality of the number itself, like having an integer square or cube root. Or it might be due to a connection to a historical event, such as satoshis from block 477,120, the block in which SegWit activated, or 2099999997689999°, the last satoshi that will ever be mined.
ar: قد يتم تقدير الساتوشيات لأسباب أخرى غير اسمها أو ندرتها. قد يكون ذلك بسبب جودة الرقم نفسه، مثل وجود جذر تربيعي أو مكعبي عددي. أو قد يكون ذلك بسبب ارتباطها بحدث تاريخي، مثل الساتوشيات من الكتلة 477،120، الكتلة التي تم فيها تفعيل سيجويت SegWit، أو 2099999997689999°،آخر ساتوشي بالعالم سيتم تعدينها.
nl: Satoshis kunnen om andere redenen dan hun naam of zeldzaamheid worden gewaardeerd. Dit kan te maken hebben met een bijzondere eigenschap van het nummer zelf, zoals een gehele vierkants- of derdemachtswortel. Of het kan komen door een verbinding met een historische gebeurtenis, zoals satoshis uit blok 477.120, het blok waarin SegWit werd geactiveerd, of 2099999997689999°, de laatste satoshi die ooit zal worden gemijnd.
