Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: To do this, you can follow the [Validating / Viewing Received Inscriptions](./sparrow-wallet.md#validating--viewing-received-inscriptions) described above to find the inscription page for your inscription on ordinals.com
ar: للقيام بذلك، يمكنك اتباع الخطوات الموجودة في [التحقق / عرض التسجيلات المستلمة] [Validating / Viewing Received Inscriptions](./sparrow-wallet.md#validating--viewing-received-inscriptions) الموجودة أعلاه للعثور على صفحة التسجيل الخاصة بتسجيلك على موقع ordinals.com
nl: Om dit te doen, kun je de stappen volgen in de sectie [Validating / Viewing Received Inscriptions](./sparrow-wallet.md#validating--viewing-received-inscriptions) hierboven om de inscriptiepagina voor je inscriptie op ordinals.com te vinden

source: There you will find some metadata about your inscription which looks like the following:
ar: ستجد هناك بعض البيانات الوصفية حول تسجيلك تبدو على النحو التالي:
nl: Daar vind je wat metadata over je inscriptie, die er als volgt uitziet:

source: There is a few of important things to check here:
ar: يوجد بعض الأمور الهامة التي يجب التحقق منها هنا:
nl: Er zijn een paar belangrijke dingen om hier te controleren:

source: The `output` identifier matches the identifier of the UTXO you are going to send
ar: معرف `output` يتطابق مع معرف UTXO الذي ستقوم بإرساله
nl: De `output`-identifier komt overeen met de identifier van de UTXO die je gaat verzenden.

source: The `offset` of the inscription is `0` (this means that the inscription is located on the first sat in the UTXO)
ar: ال `offset` للإنسكريبشين هو `0` (وهذا يعني أن الإنسكريبشين موجودة في أول ساتوشي في ناتج الصفقةUTXO)
nl: De `offset` van de inscriptie is `0` (dit betekent dat de inscriptie zich op de eerste satoshi in de UTXO bevindt).

source: the `output_value` has enough sats to cover the transaction fee (postage) for sending the transaction. The exact amount you will need depends on the fee rate you will select for the transaction
ar: تحتوي قيمة الإخراج `output_value` على عدد كافٍ من الساتوشي لتغطية رسوم الصفقة (البريد) لإرسال النقشة. تعتمد الكمية الدقيقة التي ستحتاجها على معدل الرسوم الذي ستختاره للصفقة
nl: de `output_value` heeft voldoende sats om de transactiekosten (postage) voor het verzenden van de transactie te dekken. Het exacte bedrag dat je nodig hebt, hangt af van de fee rate die je voor de transactie kiest

source: If all of the above are true for your inscription, it should be safe for you to send it using the method below.
ar: إذا كانت جميع الشروط أعلاه صحيحة بالنسبة للنقشة الخاصة بك، يجب أن يكون آمنًا لك إرسالها باستخدام الطريقة الموضحة أدناه.
nl: Als al het bovenstaande waar is voor je inscriptie, zou het veilig moeten zijn om deze te verzenden met de onderstaande methode.

source: ⚠️⚠️ Be very careful sending your inscription particularly if the `offset` value is not `0`. It is not recommended to use this method if that is the case, as doing so you could accidentally send your inscription to a bitcoin miner unless you know what you are doing.
ar: ⚠️⚠️ كن حذرًا جدًا عند إرسال الإنسكريبشين، خاصة إذا كانت القيمة النسبية ليست 0. لا يوصى باستخدام هذه الطريقة إذا كانت هذه هي الحالة، حيث يمكن أن ترسل الإنسكريبشين عن طريق الخطأ إلى منقبي بيتكوين ما لم تكن تعرف ما تفعله.
nl: ⚠️⚠️ Wees zeer voorzichtig bij het verzenden van je inscriptie, vooral als de `offset`-waarde niet `0` is. Het wordt niet aanbevolen deze methode te gebruiken als dat het geval is, omdat je anders per ongeluk je inscriptie naar een bitcoin-miner kunt sturen, tenzij je precies weet wat je doet.

source: Sending your inscription
ar: إرسال الإنسكريبشين
nl: Je inscriptie verzenden

source: To send an inscription navigate to the `UTXOs` tab, and find the UTXO which you previously validated contains your inscription.
ar: لإرسال الإنسكريبشين، انتقل إلى علامة `UTXOs`، وابحث عن ناتج الصفقة UTXO التي قمت بالتحقق منها سابقًا.
nl: Om een inscriptie te verzenden, ga je naar het tabblad `UTXOs` en zoek je de UTXO die je eerder hebt gevalideerd en waarvan je weet dat deze je inscriptie bevat.

source: If you previously froze the UXTO you will need to right-click on it and unfreeze it.
ar: إذا كنت قد قمت بتجميد ال UTXO، سيتعين عليك النقر بزر الماوس الأيمن عليها وإلغاء تجميدها.
nl: Als je de UTXO eerder hebt bevroren, moet je er met de rechtermuisknop op klikken en deze ontdooien (unfreezen).

source: Select the UTXO you want to send, and ensure that is the _only_ UTXO is selected. You should see `UTXOs 1/1` in the interface. Once you are sure this is the case you can hit `Send Selected`.
ar: حدد UTXO الذي ترغب في إرساله، وتأكد من أنه هو الوحيد المحدد. يجب أن ترى `UTXOs 1/1` في واجهة البرنامج. بمجرد التأكد من ذلك، يمكنك النقر على`Send Selected`.
nl: Selecteer de UTXO die je wilt verzenden en zorg ervoor dat dit de _enige_ geselecteerde UTXO is. Je zou `UTXOs 1/1` in de interface moeten zien. Zodra je zeker weet dat dit het geval is, kun je op `Send Selected` klikken.

source: You will then be presented with the transaction construction interface. There is a few things you need to check here to make sure that this is a safe send:
ar: ستُعرض لك واجهة إعداد الصفقة. هناك عدة أشياء يجب عليك التحقق منها للتأكد من أن هذا إرسال آمن:
nl: Je wordt vervolgens gepresenteerd met de interface voor het opstellen van de transactie. Er zijn een paar dingen die je hier moet controleren om ervoor te zorgen dat het verzenden veilig is:

source: The transaction should have only 1 input, and this should be the UTXO with the label you want to send
ar: يجب أن تحتوي الصفقة على إدخال واحد فقط، ويجب أن يكون هذا هو ناتج الصفقة الذي تريد إرساله
nl: De transactie zou slechts 1 invoer moeten hebben, en dit zou de UTXO moeten zijn met het label dat je wilt verzenden.

source: The transaction should have only 1 output, which is the address/label where you want to send the inscription
ar: يجب أن تحتوي الصفقة على إخراج واحد فقط، وهو العنوان/التصنيف الذي ترغب في إرسال الإنسكريبشين
nl: De transactie zou slechts 1 uitvoer moeten hebben, namelijk het adres/label waar je de inscriptie naartoe wilt sturen

source: If your transaction looks any different, for example you have multiple inputs, or multiple outputs then this may not be a safe transfer of your inscription, and you should abandon sending until you understand more, or can import into the `ord` wallet.
ar: إذا كانت الصفقة تبدو مختلفة عن ذلك، على سبيل المثال لديك إدخالات متعددة أو إخراجات متعددة، فقد لا يكون هذا إرسالًا آمنًا للإنسكريبشين، ويجب أن تترك الإرسال حتى تفهم المزيد، أو تستورد إلى محفظة `ord`.
nl: Als je transactie er anders uitziet, bijvoorbeeld als je meerdere invoeren of meerdere uitvoeren hebt, dan is dit mogelijk geen veilige overdracht van je inscriptie. Je zou moeten stoppen met verzenden totdat je meer begrijpt of totdat je de inscriptie kunt importeren in de `ord` wallet.

source: You should set an appropriate transaction fee, Sparrow will usually recommend a reasonable one, but you can also check [mempool.space](https://mempool.space) to see what the recommended fee rate is for sending a transaction.
ar: يجب أن تحدد رسوم الصفقة المناسبة، عادةً ما يقترح Sparrow معدل رسوم معقول، ولكن يمكنك أيضًا التحقق من [mempool.space](https://mempool.space) لمعرفة ما هو معدل الرسوم الموصي به لإرسال الصفقة.
nl: Je zou een passende transactievergoeding moeten instellen. Sparrow raadt meestal een redelijke vergoeding aan, maar je kunt ook [mempool.space](https://mempool.space) raadplegen om te zien wat het aanbevolen tarief is voor het verzenden van een transactie.

source: You should add a label for the recipient address, a label like `alice address for inscription #123` would be ideal.
ar: يجب أن تضيف تصنيفًا لعنوان المستلم، يكون التصنيف مثل `alice address for inscription #123` هو الأمثل.
nl: Je zou een label voor het ontvangersadres moeten toevoegen. Een label zoals `alice adres voor inscriptie #123` zou ideaal zijn.

source: Once you have checked the transaction is a safe transaction using the checks above, and you are confident to send it you can click `Create Transaction`.
ar: بمجرد التحقق من أن الصفقة آمنة باستخدام الفحوصات أعلاه، وأنك واثق من إرسالها، يمكنك النقر على `Create Transaction`.
nl: Zodra je hebt gecontroleerd of de transactie veilig is met de bovenstaande controles en je zeker bent van het verzenden, kun je op `Create Transaction` klikken.

source: Here again you can double check that your transaction looks safe, and once you are confident you can click `Finalize Transaction for Signing`.
ar: هنا يمكنك التحقق مرة أخرى من أن الصفقة تبدو آمنة، وبمجرد أن تكون واثقًا يمكنك النقر على `Finalize Transaction for Signing`.
nl: Hier kun je opnieuw dubbelchecken of je transactie veilig lijkt. Zodra je zeker bent, kun je op `Finalize Transaction for Signing` klikken.

source: Here you can triple check everything before hitting `Sign`.
ar: هنا يمكنك التحقق ثلاث مرات من كل شيء قبل النقر على `Sign`.
nl: Hier kun je alles drie keer controleren voordat je op `Sign` klikt.

source: And then actually you get very very last chance to check everything before hitting `Broadcast Transaction`. Once you broadcast the transaction it is sent to the bitcoin network, and starts being propagated into the mempool.
ar: وأخيرًا، ستحصل على فرصة أخيرة للتحقق من كل شيء قبل النقر على `Broadcast Transaction`. بمجرد بث الصفقة، ستُرسل إلى شبكة بيتكوين وتبدأ في الانتشار في mempool.
nl: En dan krijg je nog een allerlaatste kans om alles te controleren voordat je op `Broadcast Transaction` klikt. Zodra je de transactie hebt uitgezonden, wordt deze naar het bitcoin-netwerk gestuurd en begint deze zich door de mempool te verspreiden.

source: If you want to track the status of your transaction you can copy the `Transaction Id (Txid)` and paste that into [mempool.space](https://mempool.space)
ar: إذا كنت ترغب في تتبع حالة الصفقة، يمكنك نسخ معرف الصفقة `Transaction Id (Txid)` ولصقه في [mempool.space](https://mempool.space)
nl: Als je de status van je transactie wilt volgen, kun je de `Transaction Id (Txid)` kopiëren en deze in [mempool.space](https://mempool.space) plakken.

source: Once the transaction has confirmed you can check the inscription page on [ordinals.com](https://ordinals.com) to validate that it has moved to the new output location and address.
ar: بمجرد تأكيد الصفقة، يمكنك التحقق من صفحة الإنسكريبشين على موقع [أوردينال](https://ordinals.com) للتحقق من أنها انتقلت إلى الموقع والعنوان الجديدين.
nl: Zodra de transactie is bevestigd, kun je de inscriptiepagina op [ordinals.com](https://ordinals.com) controleren om te bevestigen dat deze naar de nieuwe outputlocatie en het nieuwe adres is verplaatst.

source: Sparrow wallet is not showing a transaction/UTXO, but I can see it on mempool.space!
ar: محفظة Sparrow لا تعرض صفقة/UTXO، ولكن يمكنني رؤيتها على mempool.space!
nl: Sparrow Wallet toont geen transactie/UTXO, maar ik kan het zien op mempool.space!

source: Make sure that your wallet is connected to a bitcoin node. To validate this, head into the `Preferences`\-> `Server` settings, and click `Edit Existing Connection`.
ar: تأكد من أن محفظتك متصلة بنود بيتكوين. للتحقق من ذلك، انتقل إلى `Preferences`\-> `Server` ، وانقر فوق `Edit Existing Connection`.
nl: Zorg ervoor dat je wallet verbonden is met een bitcoin-node. Om dit te controleren, ga naar de `Voorkeuren` -> `Server`-instellingen en klik op `Bestaande Verbinding Bewerken`.

source: From there you can select a node and click `Test Connection` to validate that Sparrow is able to connect successfully.
ar: من هنا، يمكنك تحديد نود والنقر على `Test Connection` للتحقق من أن Sparrow قادر على الاتصال بنجاح.
nl: Van daaruit kun je een node selecteren en op `Test Verbinding` klikken om te controleren of Sparrow succesvol verbinding kan maken.

source: `ord` includes a block explorer, which you can run locally with `ord server`.
ar: أورد `ord` يتضمن مستكشف كتل يمكنك تشغيله محليًا باستخدام الأمر `ord server`.
nl: `ord` bevat een blokverkenner die je lokaal kunt uitvoeren met `ord server`.

source: The block explorer allows viewing inscriptions. Inscriptions are user-generated content, which may be objectionable or unlawful.
ar: مستكشف الكتل يتيح رؤية الإنسكريبشين. الإنسكريبشين هي محتوى تم إنشاؤه من قبل المستخدمين وقد يكون مثيرًا للرفض أو غير قانوني.
nl: De blokverkenner maakt het mogelijk om inscripties te bekijken. Inscripties zijn door gebruikers gegenereerde inhoud, die mogelijk aanstootgevend of onwettig kan zijn.

source: It is the responsibility of each individual who runs an ordinal block explorer instance to understand their responsibilities with respect to unlawful content, and decide what moderation policy is appropriate for their instance.
ar: مسؤولية كل فرد يقوم بتشغيل مثيل مستكشف كتل أوردينال هي فهم مسؤولياتهم فيما يتعلق بالمحتوى غير القانوني، واتخاذ قرار بشأن السياسة الملائمة للتعديل لمثيلهم.
nl: Het is de verantwoordelijkheid van elke individuele gebruiker die een instance van een ordinals blokverkenner runt om hun verantwoordelijkheden ten aanzien van onwettige inhoud te begrijpen en te bepalen welk moderatiebeleid geschikt is voor hun instance.

source: In order to prevent particular inscriptions from being displayed on an `ord` instance, they can be included in a YAML config file, which is loaded with the `--config` option.
ar: من أجل منع ظهور إنسكريبشين معينة على `ord`، يمكن تضمينها في ملف تكوين YAML، والذي يتم تحميله باستخدام الخيار `config--`.
nl: Om te voorkomen dat bepaalde inscripties worden weergegeven op een `ord` instance, kunnen ze worden opgenomen in een YAML-configuratiebestand, dat wordt geladen met de optie `--config`.

source: To hide inscriptions, first create a config file, with the inscription ID you want to hide:
ar: لإخفائها، أنشئ أولاً ملف تكوين، وقم بوضع المعرف الذي تريد إخفائه:
nl: Om inscripties te verbergen, maak je eerst een configuratiebestand aan met de inscriptie-ID die je wilt verbergen:

source: hidden
nl: verborgen

source: The suggested name for `ord` config files is `ord.yaml`, but any filename can be used.
ar: الاسم المقترح لملفات تكوين `ord` هو `ord.yaml`، ولكن يمكن استخدام أي اسم ملف.
nl: De aanbevolen naam voor `ord` configuratiebestanden is `ord.yaml`, maar je kunt elke bestandsnaam gebruiken.

source: Then pass the file to `--config` when starting the server:
ar: ثم قم بتمرير الملف باستخدام `config--` عند بدء تشغيل الخادم:
nl: Gebruik vervolgens het bestand met de optie `--config` bij het starten van de server:

source: Note that the `--config` option comes after `ord` but before the `server` subcommand.
ar: يرجى ملاحظة أن الخيار `config--` يأتي بعد `ord` ولكن قبل `server`.
nl: Let op dat de optie `--config` na `ord` maar vóór de subopdracht `server` komt.

source: `ord` must be restarted in to load changes to the config file.
ar: يجب إعادة تشغيل `ord` لتحميل التغييرات.
nl: `ord` moet opnieuw worden gestart om wijzigingen in het configuratiebestand te laden.

source: The `ordinals.com` instances use `systemd` to run the `ord server` service, which is called `ord`, with a config file located at `/var/lib/ord/ord.yaml`.
ar: تستخدم `ordinals.com` لتشغيل خدمة `ord server`، والتي تسمى `ord`، باستخدام ملف تكوين يقع في المسار `var/lib/ord/ord.yaml/`.
nl: De `ordinals.com`-instanties gebruiken `systemd` om de `ord server`-service te draaien, die `ord` heet, met een configuratiebestand dat zich bevindt op `/var/lib/ord/ord.yaml`.

source: To hide an inscription on `ordinals.com`:
ar: لإخفاء إنسكريبشين على `ordinals.com`:
nl: Om een inscriptie op `ordinals.com` te verbergen:

source: SSH into the server
ar: اتصل بخادم SSH
nl: SSH naar de server inloggen

source: Add the inscription ID to `/var/lib/ord/ord.yaml`
ar: أضف معرف إنسكريبشين إلى `var/lib/ord/ord.yaml/`
nl: Voeg de inscriptie-ID toe aan `/var/lib/ord/ord.yaml`

source: Restart the service with `systemctl restart ord`
ar: أعد تشغيل الخدمة باستخدام `systemctl restart ord`
nl: Herstart de service met `systemctl restart ord`

source: Monitor the restart with `journalctl -u ord`
ar: راقب إعادة التشغيل باستخدام `journalctl -u ord`
nl: Volg de herstart met `journalctl -u ord`

source: Currently, `ord` is slow to restart, so the site will not come back online immediately.
ar: حاليًا، يستغرق إعادة تشغيل `ord` وقتًا طويلاً، لذا قد لا يعود الموقع اونلاين فورا.
nl: Momenteel is `ord` traag om opnieuw op te starten, dus de site zal niet onmiddellijk weer online zijn.

source: Sometimes the `ord` database must be reindexed, which means deleting the database and restarting the indexing process with either `ord index update` or `ord server`. Reasons to reindex are:
nl: Soms moet de `ord` database opnieuw geïndexeerd worden, wat betekent dat je de database moet verwijderen en het indexeringsproces opnieuw moet starten met `ord index update` of `ord server`. Redenen om opnieuw te indexeren zijn:

source: A new major release of ord, which changes the database scheme
ar: صدور إصدار جديد رئيسي لـ ord والذي يغير مخطط قاعدة البيانات
nl: Een nieuwe grote release van `ord`, die het databaseschema wijzigt

source: The database got corrupted somehow
ar: تلف قاعدة البيانات بشكل ما بطريقة ما
nl: De database is op de een of andere manier beschadigd geraakt

source: The database `ord` uses is called [redb](https://github.com/cberner/redb), so we give the index the default file name `index.redb`. By default we store this file in different locations depending on your operating system.
ar: قاعدة البيانات التي يستخدمها `ord` تسمى [redb](https://github.com/cberner/redb)، لذا نعطي للفهرس اسم الملف الافتراضي `index.redb`. عادةً ما نخزن هذا الملف في مواقع مختلفة اعتمادًا على نظام التشغيل الخاص بك.
nl: De database die `ord` gebruikt, heet [redb](https://github.com/cberner/redb), en we geven de index de standaardbestandsnaam `index.redb`. Standaard slaan we dit bestand op verschillende locaties op, afhankelijk van je besturingssysteem.

source: Value
nl: Waarde

source: So to delete the database and reindex on MacOS you would have to run the following commands in the terminal:
ar: لحذف قاعدة البيانات وإعادة فهرستها على نظام MacOS، يمكنك تشغيل الأوامر التالية في الطرفية (الترمينال):
nl: Om de database te verwijderen en opnieuw te indexeren op MacOS moet je de volgende commando's in de terminal uitvoeren:

source: You can of course also set the location of the data directory yourself with `ord --datadir <DIR> index update` or give it a specific filename and path with `ord --index <FILENAME> index update`.
nl: Je kunt natuurlijk ook zelf de locatie van de gegevensmap instellen met `ord --datadir <DIR> index update` of een specifiek bestandsnaam en pad opgeven met `ord --index <FILENAME> index update`.

source: Ordinal hunting is difficult but rewarding. The feeling of owning a wallet full of UTXOs, redolent with the scent of rare and exotic sats, is beyond compare.
ar: صيد الأوردينال أمرٌ صعب ولكنه مكافئ. الشعور بامتلاك محفظة مليئة بـ UTXOs، محملة بالساتوشي النادرة والاستثنائية، لا يمكن وصفه.
nl: Ordinal hunting is moeilijk maar lonend. Het gevoel van het bezitten van een portemonnee vol UTXO's, doordrenkt met de geur van zeldzame en exotische sats, is ongeëvenaard.

source: Ordinals are numbers for satoshis. Every satoshi has an ordinal number and every ordinal number has a satoshi.
ar: أوردينالس هي أعداد تُستخدم للساتوشي. كل ساتوشي لديه رقم ترتيبي وكل رقم ترتيبي لديه ساتوشي.
nl: Ordinals zijn nummers voor satoshi's. Elke satoshi heeft een ordinaal nummer en elk ordinaal nummer heeft een satoshi.

source: Preparation
ar: التحضير
nl: Voorbereiding

source: There are a few things you'll need before you start.
ar: قبل البدء ستحتاج الى بعض الأشياء.
nl: Er zijn een paar dingen die je nodig hebt voordat je begint.

source: First, you'll need a synced Bitcoin Core node with a transaction index. To turn on transaction indexing, pass `-txindex` on the command-line:
ar: أولا, ستحتاج الى بيتكوين نود مزامن بالكامل. لبدأ تحميل المعاملات اعطي الأمر `txindex-`على سطر الأوامر:
nl: Allereerst heb je een gesynchroniseerde Bitcoin Core-node nodig met een transactie-index. Om transactie-indexering in te schakelen, geef je `-txindex` op de opdrachtregel door:

source: Or put the following in your [Bitcoin configuration file](https://github.com/bitcoin/bitcoin/blob/master/doc/bitcoin-conf.md#configuration-file-path):
ar: أو استخدم [Bitcoin configuration file] و (https://github.com/bitcoin/bitcoin/blob/master/doc/bitcoin-conf.md#configuration-file-path):
nl: Of voeg het volgende toe aan je [Bitcoin-configuratiebestand](https://github.com/bitcoin/bitcoin/blob/master/doc/bitcoin-conf.md#configuration-file-path):

source: Launch it and wait for it to catch up to the chain tip, at which point the following command should print out the current block height:
ar: قم بتشغيله وانتظر حتى يلحق بنهاية السلسلة (chain tip)، في هذا الوقت يجب أن يتم طباعة ارتفاع الكتلة الحالي باستخدام الأمر التالي:
nl: Start het op en wacht totdat het is bijgewerkt tot de ketenpunt, waarna het volgende commando de huidige blockhoogte zou moeten weergeven:

source: Second, you'll need a synced `ord` index.
ar: ثانيا, ستحتاج لفهرسة `ord`.
nl: Ten tweede heb je een gesynchroniseerde `ord`-index nodig.

source: Get a copy of `ord` from [the repo](https://github.com/ordinals/ord/).
ar: إحصل على نسخه من `ord` من خلال [the repo](https://github.com/ordinals/ord/).
nl: Haal een kopie van `ord` van [de repo](https://github.com/ordinals/ord/) .

source: Run `ord --index-sats server`. It should connect to your bitcoin core node and start indexing.
nl: Voer `ord --index-sats server` uit. Het zou verbinding moeten maken met je Bitcoin Core-node en beginnen met indexeren.

source: Once it has finished indexing, leave the server running and submit new `ord` commands in a separate terminal session.
nl: Wanneer het indexeren is voltooid, laat je de server draaien en voer je nieuwe `ord`-commando's uit in een aparte terminalsessie.

source: Third, you'll need a wallet with UTXOs that you want to search.
ar: ثالثًا، ستحتاج إلى محفظة تحتوي على مخرجات غير مُنفقة (UTXOs) التي ترغب في البحث عنها.
nl: Ten derde heb je een portemonnee nodig met UTXO's die je wilt doorzoeken.

source: Searching for Rare Ordinals
ar: البحث عن أوردينالس نادرة
nl: Zoeken naar zeldzame ordinals

source: Searching for Rare Ordinals in a Bitcoin Core Wallet
ar: البحث عن أوردينال النادرة في محفظة Bitcoin Core
nl: Zoeken naar zeldzame ordinals in een Bitcoin Core-wallet

source: The `ord wallet` command is just a wrapper around Bitcoin Core's RPC API, so searching for rare ordinals in a Bitcoin Core wallet is Easy. Assuming your wallet is named `foo`:
ar: أمر `ord wallet` هو مجرد ملف تغليفي حول واجهة برمجة تطبيقات Bitcoin Core's RPC API، لذا البحث عن الإنسكريبشين النادرة في محفظة Bitcoin Core يعتبر سهلاً. افترض أن اسم محفظتك هو `foo`:
nl: Het `ord wallet`-commando is slechts een wrapper rond de RPC API van Bitcoin Core, dus het zoeken naar zeldzame ordinals in een Bitcoin Core-wallet is eenvoudig. Stel dat je wallet `foo` heet:

source: Load your wallet:
ar: قم بتحميل محفظتك:
nl: Laad je wallet:

source: Display any rare ordinals wallet `foo`'s UTXOs:
ar: عرض أي من الساتوشي النادرة في محفظة `foo` من مخرجات UTXO:
nl: Toon alle zeldzame ordinals in de UTXO's van wallet `foo`:

source: Searching for Rare Ordinals in a Non-Bitcoin Core Wallet
ar: البحث عن العلامات النادرة في محفظة غير تابعة لبيتكوين كور
nl: Zoeken naar zeldzame ordinals in een niet-Bitcoin Core-wallet

source: The `ord wallet` command is just a wrapper around Bitcoin Core's RPC API, so to search for rare ordinals in a non-Bitcoin Core wallet, you'll need to import your wallet's descriptors into Bitcoin Core.
ar: أمر `ord wallet` هو مجرد غلاف حول واجهة برمجة التطبيقات (RPC) لبيتكوين كور. لذا، إذا كنت ترغب في البحث عن العلامات النادرة في محفظة غير تابعة لبيتكوين كور، ستحتاج إلى استيراد مسارات محفظتك إلى بيتكوين كور.
nl: Het `ord wallet`-commando is slechts een wrapper rond de RPC API van Bitcoin Core, dus om te zoeken naar zeldzame ordinals in een niet-Bitcoin Core-wallet, moet je de descriptors van je wallet importeren in Bitcoin Core.
