Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: The blockchain takes about 600GB of disk space. If you have an external drive you want to store blocks on, use the configuration option `blocksdir=<external_drive_path>`. This is much simpler than using the `datadir` option because the cookie file will still be in the default location for `bitcoin-cli` and `ord` to find.
nl: De blockchain neemt ongeveer 600 GB aan schijfruimte in beslag. Als je een externe schijf hebt waarop je de blokken wilt opslaan, gebruik dan de configuratieoptie `blocksdir=<external_drive_path>`. Dit is veel eenvoudiger dan de `datadir`-optie omdat het cookiebestand nog steeds op de standaardlocatie staat, zodat `bitcoin-cli` en `ord` het kunnen vinden.

source: Troubleshooting
ar: مشكلات وحلول
nl: Probleemoplossing

source: Make sure you can access `bitcoind` with `bitcoin-cli -getinfo` and that it is fully synced.
nl: Zorg ervoor dat je toegang hebt tot `bitcoind` met `bitcoin-cli -getinfo` en dat het volledig gesynchroniseerd is.

source: If `bitcoin-cli -getinfo` returns `Could not connect to the server`, `bitcoind` is not running.
nl: Als `bitcoin-cli -getinfo` de melding `Could not connect to the server` retourneert, draait `bitcoind` niet.

source: Make sure `rpcuser`, `rpcpassword`, or `rpcauth` are _NOT_ set in your `bitcoin.conf` file. `ord` requires using cookie authentication. Make sure there is a file `.cookie` in your bitcoin data directory.
nl: Zorg ervoor dat `rpcuser`, `rpcpassword` of `rpcauth` **NIET** zijn ingesteld in je `bitcoin.conf`-bestand. `ord` vereist het gebruik van cookie-authenticatie. Controleer of er een `.cookie`-bestand in je bitcoin-datamap aanwezig is.

source: If `bitcoin-cli -getinfo` returns `Could not locate RPC credentials`, then you must specify the cookie file location. If you are using a custom data directory (specifying the `datadir` option), then you must specify the cookie location like `bitcoin-cli -rpccookiefile=<your_bitcoin_datadir>/.cookie -getinfo`. When running `ord` you must specify the cookie file location with `--cookie-file=<your_bitcoin_datadir>/.cookie`.
nl: Als `bitcoin-cli -getinfo` de melding `Could not locate RPC credentials` retourneert, moet je de locatie van het cookiebestand specificeren. Als je een aangepaste datamap gebruikt (door de `datadir`-optie op te geven), moet je de locatie van het cookiebestand aangeven zoals `bitcoin-cli -rpccookiefile=<your_bitcoin_datadir>/.cookie -getinfo`. Wanneer je `ord` uitvoert, moet je de locatie van het cookiebestand opgeven met `--cookie-file=<your_bitcoin_datadir>/.cookie`.

source: Make sure you do _NOT_ have `disablewallet=1` in your `bitcoin.conf` file. If `bitcoin-cli listwallets` returns `Method not found` then the wallet is disabled and you won't be able to use `ord`.
nl: Zorg ervoor dat je **NIET** `disablewallet=1` in je `bitcoin.conf`-bestand hebt staan. Als `bitcoin-cli listwallets` de melding `Method not found` retourneert, is de wallet uitgeschakeld en kun je `ord` niet gebruiken.

source: Make sure `txindex=1` is set. Run `bitcoin-cli getindexinfo` and it should return something like
nl: Zorg ervoor dat `txindex=1` is ingesteld. Voer `bitcoin-cli getindexinfo` uit en het zou iets moeten teruggeven zoals

source: If it only returns `{}`, `txindex` is not set. If it returns `"synced": false`, `bitcoind` is still creating the `txindex`. Wait until `"synced": true` before using `ord`.
nl: Als het alleen `{}` retourneert, is `txindex` niet ingesteld. Als het `"synced": false` retourneert, is `bitcoind` nog bezig met het aanmaken van de `txindex`. Wacht tot `"synced": true` voordat je `ord` gebruikt.

source: If you have `maxuploadtarget` set it can interfere with fetching blocks for `ord` index. Either remove it or set `whitebind=127.0.0.1:8333`.
nl: Als je `maxuploadtarget` hebt ingesteld, kan dit het ophalen van blokken voor de `ord`-index verstoren. Verwijder het of stel `whitebind=127.0.0.1:8333` in.

source: Installing `ord`
ar: تحميل برنامج أورد `ord`
nl: Installatie van `ord`

source: The `ord` utility is written in Rust and can be built from [source](https://github.com/ordinals/ord). Pre-built binaries are available on the [releases page](https://github.com/ordinals/ord/releases).
ar: أدوات `ord` مكتوبه بلغه الداست ويمكن بنائها من[المصدر](https://github.com/ordinals/ord).الثنائيات المبنية مسبقًا متوفرة على [صفحه الإصدار](https://github.com/ordinals/ord/releases).
nl: De `ord`-tool is geschreven in Rust en kan worden gebouwd vanaf [de bron](https://github.com/ordinals/ord). Kant-en-klare binaire bestanden zijn beschikbaar op de [releases-pagina](https://github.com/ordinals/ord/releases).

source: You can install the latest pre-built binary from the command line with:
ar: يمكنك تحميل الثنائيات المبنية مسبقًا بإعطاء الأمر التالي:
nl: Je kunt de nieuwste kant-en-klare binaire versie vanaf de opdrachtregel installeren met:

source: Once `ord` is installed, you should be able to run:
ar: بمجرد الانتهاء من تحميل ال `ord`، يجب أن تكون قادرًا على تشغيل:
nl: Zodra `ord` is geïnstalleerd, zou je in staat moeten zijn om uit te voeren:

source: Which prints out `ord`'s version number.
ar: والذي يشير الى الإصدار `ord` الحالي.
nl: Wat de versie van `ord` afdrukt.

source: Creating a Wallet
nl: Een wallet aanmaken

source: `ord` uses `bitcoind` to manage private keys, sign transactions, and broadcast transactions to the Bitcoin network. Additionally the `ord wallet` requires [`ord server`](explorer.md) running in the background. Make sure these programs are running:
nl: `ord` gebruikt `bitcoind` om privé-sleutels te beheren, transacties te ondertekenen en transacties naar het Bitcoin-netwerk uit te zenden. Bovendien vereist de `ord wallet` dat [`ord server`](explorer.md) op de achtergrond draait. Zorg ervoor dat deze programma's actief zijn:

source: To create a wallet named `ord`, the default, for use with `ord wallet`, run:
nl: Om een wallet met de naam `ord`, de standaardnaam, aan te maken voor gebruik met `ord wallet`, voer je uit:

source: This will print out your seed phrase mnemonic, store it somewhere safe.
nl: Dit zal je seed phrase mnemonic afdrukken; sla deze op een veilige plaats op.

source: If you want to specify a different name or use an `ord server` running on a non-default URL you can set these options:
nl: Als je een andere naam wilt opgeven of een `ord server` wilt gebruiken die draait op een niet-standaard URL, kun je deze opties instellen:

source: To see all available wallet options you can run:
nl: Om alle beschikbare portemonnee-opties te zien, kun je uitvoeren:

source: Restoring and Dumping Wallet
nl: Herstellen en Exporteren van een Wallet

source: The `ord` wallet uses descriptors, so you can export the output descriptors and import them into another descriptor-based wallet. To export the wallet descriptors, which include your private keys:
nl: De `ord`-wallet gebruikt descriptors, zodat je de uitvoerdescriptors kunt exporteren en deze kunt importeren in een andere op descriptors gebaseerde wallet. Om de wallet-descriptors, die je privésleutels bevatten, te exporteren:

source: An `ord` wallet can be restored from a mnemonic:
nl: Een `ord` wallet kan worden hersteld vanaf een mnemonic:

source: Type your mnemonic and press return.
nl: Typ je mnemonic en druk op enter.

source: To restore from a descriptor in `descriptor.json`:
nl: Om te herstellen vanuit een descriptor in `descriptor.json`:

source: To restore from a descriptor in the clipboard:
nl: Om te herstellen vanuit een descriptor in het klembord:

source: Paste the descriptor into the terminal and press CTRL-D on unix and CTRL-Z on Windows.
nl: Plak de descriptor in de terminal en druk op CTRL-D op Unix of CTRL-Z op Windows.

source: Receiving Sats
ar: استقبال الساتس
nl: Ontvangen van Sats

source: Inscriptions are made on individual sats, using normal Bitcoin transactions that pay fees in sats, so your wallet will need some sats.
ar: يتم إنشاء الأنسكريبشين على الساتوشيات فردية باستخدام معاملات بيتكوين العادية التي تدفع الرسوم بوحدات الساتوشي، لذا ستحتاج محفظتك إلى بعض الساتوشيات.
nl: Inscripties worden gemaakt op afzonderlijke sats, met behulp van gewone Bitcoin-transacties die vergoedingen in sats betalen, dus je wallet heeft enige sats nodig.

source: Get a new address from your `ord` wallet by running:
ar: إحصل على عنوان جديد من محفظة ال `ord` من خلال الأمر التالي:
nl: Haal een nieuw adres op uit je `ord` wallet door uit te voeren:

source: And send it some funds.
ar: وأرسل لها بعض التمويل.
nl: En stuur er wat fondsen naartoe.

source: You can see pending transactions with:
ar: يمكنك رؤية المعاملات المعلقة بالأمر التالي:
nl: Je kunt uitstaande transacties bekijken met:

source: Once the transaction confirms, you should be able to see the transactions outputs with `ord wallet outputs`.
ar: بمجرد تأكيد الصفقة، يجب أن تكون قادرًا على رؤية المعاملات من خلال `ord wallet outputs`.
nl: Zodra de transactie is bevestigd, zou je de transactie-uitgangen moeten kunnen zien met `ord wallet outputs`.

source: Creating Inscription Content
ar: إنشاء محتوى إنسكريبشين
nl: Inscriptie-inhoud aanmaken

source: Sats can be inscribed with any kind of content, but the `ord` wallet only supports content types that can be displayed by the `ord` block explorer.
ar: يمكن إنسكرايب الساتوشيات بأي نوع من المحتوى، ولكن محفظة `ord` تدعم فقط أنواع المحتوى التي يمكن عرضها عبر مستكشف الكتل `ord`.
nl: Sats kunnen worden ingeschreven met elk type inhoud, maar de `ord` wallet ondersteunt alleen inhoudstypen die kunnen worden weergegeven door de `ord` block explorer.

source: Additionally, inscriptions are included in transactions, so the larger the content, the higher the fee that the inscription transaction must pay.
ar: بالإضافة إلى ذلك، تُدرج الإنسكريبشين في المعاملات، لذلك كلما زاد حجم المحتوى، زادت الرسوم التي يجب دفعها لعملية الإنسكريبشين .
nl: Daarnaast worden inscripties opgenomen in transacties, dus hoe groter de inhoud, hoe hoger de vergoeding die de inscriptie-transactie moet betalen.

source: Inscription content is included in transaction witnesses, which receive the witness discount. To calculate the approximate fee that an inscribe transaction will pay, divide the content size by four and multiply by the fee rate.
ar: يتم تضمين محتوى الإنسكريبشين في شهادات المعاملات، والتي تحصل على الشاهد. لحساب الرسوم التقريبية التي ستدفعها معاملة الإنسكريبشين ، قسم حجم المحتوى على أربعة ثم اضرب الناتج بمعدل الرسوم.
nl: Inscriptie-inhoud wordt opgenomen in transaction witnesses, die profiteren van de witness-korting. Om de geschatte vergoeding te berekenen die een inscriptie-transactie zal betalen, deel je de inhoudsgrootte door vier en vermenigvuldig je dit met het vergoedingstarief.

source: Inscription transactions must be less than 400,000 weight units, or they will not be relayed by Bitcoin Core. One byte of inscription content costs one weight unit. Since an inscription transaction includes not just the inscription content, limit inscription content to less than 400,000 weight units. 390,000 weight units should be safe.
ar: يجب أن تكون المعاملات أقل من 400,000 وحدة وزنية، وإلا فلن يتم نقلها بواسطة بيتكوين كور. بايت واحد من المحتوى يكلف وحدة وزنية واحدة. نظرًا لأن المعاملات لا تشمل فقط المحتوى ، يجب تقييد محتوى الإنسكريبشين لأقل من 400,000 وحدة وزنية. 390,000 وحدة وزنية يجب أن تكون آمنة وصحيحه.
nl: Inscriptie-transacties mogen niet meer dan 400.000 gewichtseenheden bevatten, anders worden ze niet door Bitcoin Core doorgegeven. Eén byte inscriptie-inhoud kost één gewichtseenheid. Aangezien een inscriptie-transactie niet alleen de inscriptie-inhoud omvat, moet je de inscriptie-inhoud beperken tot minder dan 400.000 gewichtseenheden. 390.000 gewichtseenheden zouden veilig moeten zijn.

source: Creating Inscriptions
ar: إنشاء الإنسكريبشينس
nl: Inscripties aanmaken

source: To create an inscription with the contents of `FILE`, run:
ar: لإنشاء الإنسكريبشين مع محتوى `FILE` , اعطي الأمر:
nl: Om een inscriptie aan te maken met de inhoud van `FILE`, voer je uit:

source: Ord will output two transactions IDs, one for the commit transaction, and one for the reveal transaction, and the inscription ID. Inscription IDs are of the form `TXIDiN`, where `TXID` is the transaction ID of the reveal transaction, and `N` is the index of the inscription in the reveal transaction.
ar: أورد سيقوم بإخراج رقمين معرّفين للمعاملات، واحد لمعاملة الالتزام، وآخر لمعاملة الكشف، وكذلك مُعرف إنسكريبشين . مُعرفات إنسكريبشين على الشكل `TXIDiN`، حيث `TXID` هو مُعرّف المعاملة لمعاملة الكشف، و `N` هو المؤشر الإنسكريبشين في معاملة الكشف.
nl: `ord` zal twee transacties-ID's en de inscriptie-ID weergeven: één voor de commit-transactie en één voor de reveal-transactie. Inscriptie-ID's hebben de vorm `TXIDiN`, waarbij `TXID` de transacties-ID van de reveal-transactie is en `N` de index van de inscriptie in de reveal-transactie.

source: The commit transaction commits to a tapscript containing the content of the inscription, and the reveal transaction spends from that tapscript, revealing the content on chain and inscribing it on the first sat of the input that contains the corresponding tapscript.
ar: تُؤكد معاملة الالتزام على tapscript يحتوي على محتوى الإنسكريبشين، وتقوم معاملة الكشف بإنفاق من هذا الـ tapscript، مكشفةً المحتوى على الشبكة وتسجيله على أول ساتوشي في المدخل الذي يحتوي على الـ tapscript المقابل.
nl: De commit-transactie commit zich aan een tapscript dat de inhoud van de inscriptie bevat, en de reveal-transactie besteedt aan dat tapscript, waardoor de inhoud op de blockchain wordt onthuld en ingeschreven op de eerste sat van de invoer die het bijbehorende tapscript bevat.

source: Wait for the reveal transaction to be mined. You can check the status of the commit and reveal transactions using [the mempool.space block explorer](https://mempool.space/).
ar: إنتظر حتى يتم تعدين المعاملة. يمكنك التحقق منها من خلال[the mempool.space block explorer](https://mempool.space/).
nl: Wacht totdat de reveal-transactie is gemined. Je kunt de status van de commit- en reveal-transacties controleren met behulp van [de mempool.space block explorer](https://mempool.space/).

source: Once the reveal transaction has been mined, the inscription ID should be printed when you run:
ar: بمجرد أن يتم تعدين الصفقة (reveal transaction)، يجب أن يتم طباعة معرّف الإنسكريبشين (inscription ID) عند تشغيل الأمر:
nl: Zodra de reveal-transactie is gemined, zou de inscriptie-ID moeten worden afgedrukt wanneer je uitvoert:

source: Parent-Child Inscriptions
nl: Ouder-Kind Inscripties

source: Parent-child inscriptions enable what is colloquially known as collections, see [provenance](../inscriptions/provenance.md) for more information.
nl: Ouder-kind inscripties maken wat in de volksmond bekend staat als collecties mogelijk. Zie [provenance](../inscriptions/provenance.md) voor meer informatie.

source: To make an inscription a child of another, the parent inscription has to be inscribed and present in the wallet. To choose a parent run `ord wallet inscriptions` and copy the inscription id (`<PARENT_INSCRIPTION_ID>`).
nl: Om een inscriptie een kind te maken van een andere, moet de ouderinscriptie ingeschreven en aanwezig zijn in de wallet. Om een ouder te kiezen, voer je `ord wallet inscriptions` uit en kopieer je de inscriptie-ID (`<PARENT_INSCRIPTION_ID>`).

source: Now inscribe the child inscription and specify the parent like so:
nl: Nu schrijf je de kindinscriptie in en specificeer je de ouder als volgt:

source: This relationship cannot be added retroactively, the parent has to be present at inception of the child.
nl: Deze relatie kan niet achteraf worden toegevoegd; de ouder moet aanwezig zijn bij de aanmaak van het kind.

source: Sending Inscriptions
ar: إرسال الإنسكريبشينس
nl: Inscripties verzenden

source: Ask the recipient to generate a new address by running:
ar: أطلب من المستلم إنشاء عنوان جديد عن طريق تشغيل:
nl: Vraag de ontvanger om een nieuw adres te genereren door uit te voeren:

source: Send the inscription by running:
ar: أرسل الإنسكريبشين من خلال:
nl: Stuur de inscriptie door uit te voeren:

source: See the pending transaction with:
ar: تفقد حاله المعاملة من خلال:
nl: Bekijk de uitstaande transactie met:

source: Once the send transaction confirms, the recipient can confirm receipt by running:
ar: بمجرد تأكيد المعاملة المرسلة، يمكن للمستلم تأكيد الاستلام عن طريق الأمر :
nl: Zodra de verzendtransactie is bevestigd, kan de ontvanger de ontvangst bevestigen door uit te voeren:

source: Sending Runes
nl: Runes verzenden

source: Send the runes by running:
nl: Stuur de runes door uit te voeren:

source: Where `RUNES_AMOUNT` is the number of runes to send, a `:` character, and the name of the rune. For example if you want to send 1000 of the EXAMPLE rune, you would use `1000:EXAMPLE`.
nl: Waarbij `RUNES_AMOUNT` het aantal runes is dat je wilt verzenden, gevolgd door een `:` karakter en de naam van de rune. Bijvoorbeeld, als je 1000 van de EXAMPLE rune wilt verzenden, gebruik je `1000:EXAMPLE`.

source: Once the send transaction confirms, the recipient can confirm receipt with:
nl: Zodra de verzendtransactie is bevestigd, kan de ontvanger de ontvangst bevestigen met:

source: Receiving Inscriptions
ar: استقبال الإنسكريبشينس
nl: Inscripties ontvangen

source: Generate a new receive address using:
ar: قم بإنشاء عنوان استقبال جديد باستخدام:
nl: Genereer een nieuw ontvangstadres met:

source: The sender can transfer the inscription to your address using:
ar: يمكن للمرسل نقل الإنسكريبشين إلى عنوانك باستخدام:
nl: De afzender kan de inscriptie naar je adres overdragen met:

source: Once the send transaction confirms, you can confirm receipt by running:
nl: Zodra de verzendtransactie is bevestigd, kun je de ontvangst bevestigen door uit te voeren:

source: Multiple inscriptions can be created at the same time using the [pointer field](./../inscriptions/pointer.md). This is especially helpful for collections, or other cases when multiple inscriptions should share the same parent, since the parent can passed into a reveal transaction that creates multiple children.
nl: Meerdere inscripties kunnen tegelijkertijd worden aangemaakt met behulp van het [pointer-veld](./../inscriptions/pointer.md). Dit is vooral handig voor collecties of andere gevallen waarin meerdere inscripties dezelfde ouder moeten delen, aangezien de ouder kan worden doorgegeven in een reveal-transactie die meerdere kinderen aanmaakt.

source: To create a batch inscription using a batchfile in `batch.yaml`, run the following command:
nl: Om een batchinscriptie aan te maken met een batchbestand in `batch.yaml`, voer je de volgende opdracht uit:

source: Example `batch.yaml`
nl: Voorbeeld `batch.yaml`

source: # example batch file
nl: # voorbeeld batchbestand

source: # inscription modes: # - `same-sat`: inscribe on the same sat # - `satpoints`: inscribe on the first sat of specified satpoint's output # - `separate-outputs`: inscribe on separate postage-sized outputs # - `shared-output`: inscribe on a single output separated by postage mode
nl: # inscriptiemodi: # - `same-sat`: inscribe op dezelfde sat # - `satpoints`: inscribe op de eerste sat van de opgegeven satpoint-output # - `separate-outputs`: inscribe op aparte postzegel-grote outputs # - `shared-output`: inscribe op een enkele output gescheiden door postzegels mode

source: # parent inscription: parent
nl: # ouderinscriptie: parent

source: # postage for each inscription: postage
nl: # postzegel voor elke inscriptie: postage

source: # allow reinscribing reinscribe
nl: # opnieuw inscriben toestaan reinscribe

source: # sat to inscribe on, can only be used with `same-sat`: # sat: 5000000000
nl: # sat om op in te schrijven, kan alleen worden gebruikt met `same-sat`: # sat: 5000000000

source: # rune to etch (optional) etching
nl: # rune om te etchen (optioneel) etching

source: # rune name rune
nl: # rune naam rune

source: # allow subdividing super-unit into `10^divisibility` sub-units divisibility
nl: # onderverdeling van super-eenheid in `10^divisibility` sub-eenheden toestaan divisibility

source: # total supply, must be equal to `premine + terms.cap * terms.amount` supply
nl: # totale voorraad, moet gelijk zijn aan `premine + terms.cap * terms.amount` supply

source: # currency symbol symbol
nl: # valutateken symbol

source: # mint terms (optional) terms
nl: # mintvoorwaarden (optioneel) terms

source: # amount per mint amount
nl: # bedrag per mint amount

source: # maximum number of mints cap
nl: # maximaal aantal munten cap

source: # mint start and end absolute block height (optional) height
nl: # absolute start- en eindblokhoogte voor munt (optioneel) height

source: end
nl: einde

source: # mint start and end block height relative to etching height (optional) offset
nl: # start- en eindblokhoogte voor mint relatief aan de graveerhoogte (optioneel) offset

source: # future runes protocol changes may be opt-in. this may be for a variety of # reasons, including that they make light client validation harder, or simply # because they are too degenerate. # # setting `turbo` to `true` opts in to these future protocol changes, # whatever they may be. turbo
nl: # toekomstige wijzigingen in het runes-protocol kunnen opt-in zijn. Dit kan om verschillende redenen zijn, # zoals dat ze het moeilijker maken voor lichte clients om te valideren, of simpelweg # omdat ze te afwijkend zijn. # # door `turbo` op `true` in te stellen, stem je in met deze toekomstige protocolwijzigingen, # wat deze ook mogen zijn. turbo

source: # inscriptions to inscribe inscriptions
nl: # in te schrijven inscripties inscriptions

source: # path to inscription content
nl: # pad naar inscriptie-inhoud

source: file
nl: bestand

source: # inscription to delegate content to (optional) delegate
nl: # inscriptie om inhoud aan toe te wijzen (optioneel) delegate

source: # destination (optional, if no destination is specified a new wallet change address will be used) destination
nl: # bestemming (optioneel; als geen bestemming is opgegeven, wordt een nieuw wallet-wijzigingsadres gebruikt) destination

source: title
nl: titel

source: Delicious Mangos
nl: Heerlijke Mango's

source: description
nl: beschrijving

source: tulip.png
nl: tulipán.png

source: destination
nl: bestemming

source: author
nl: autor

source: Currently, [ord](https://github.com/ordinals/ord/) is the only wallet supporting sat-control and sat-selection, which are required to safely store and send rare sats and inscriptions, hereafter ordinals.
ar: حالياً، يعتبر [ord](https://github.com/ordinals/ord/) هو المحفظة الوحيدة التي تدعم التحكم في الساتوشيات واختيارها، واللذين يُعتبران ضروريين لتخزين وإرسال الساتوشيات والأشياء الرقمية النادرة بأمان، والتي ستُعرف فيما بعد بـ أوردينال.
nl: Momenteel is [ord](https://github.com/ordinals/ord/) de enige wallet die sat-control en sat-selection ondersteunt, wat nodig is om zeldzame sats en inscripties veilig op te slaan en te verzenden, hierna ordinals genoemd.

source: The recommended way to send, receive, and store ordinals is with `ord`, but if you are careful, it is possible to safely store, and in some cases send, ordinals with other wallets.
ar: الطريقة الموصي بها لإرسال واستقبال وتخزين أوردينال هي باستخدام محفظة `ord`، ولكن إذا كنت حذرًا، يمكنك تخزين أوردينال بأمان في محافظ أخرى، وفي بعض الحالات حتى إرسالها.
nl: De aanbevolen manier om ordinals te verzenden, ontvangen en op te slaan is met `ord`, maar als je voorzichtig bent, is het mogelijk om ordinals veilig op te slaan en in sommige gevallen te verzenden met andere wallets.
