Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: As a general note, receiving ordinals in an unsupported wallet is not dangerous. Ordinals can be sent to any bitcoin address, and are safe as long as the UTXO that contains them is not spent. However, if that wallet is then used to send bitcoin, it may select the UTXO containing the ordinal as an input, and send the inscription or spend it to fees.
ar: كملاحظة عامة، استقبال أوردينال في محفظة غير مدعومة ليس خطيرًا. يمكن إرسال أوردينال إلى أي عنوان بيتكوين، وهم آمنين طالما أن الإخراج الذي يحتوي عليهم لم يتم إنفاقه. ومع ذلك، إذا تم استخدام تلك المحفظة لإرسال بيتكوين، قد تختار المحفظة الإخراج الذي يحتوي على الـأوردينال كإدخال، وترسل الشهادة أو تنفقها على الرسوم.
nl: Als algemene opmerking: het ontvangen van ordinals in een niet-ondersteunde wallet is niet gevaarlijk. Ordinals kunnen naar elk bitcoinadres worden gestuurd en zijn veilig zolang de UTXO die ze bevat niet wordt besteed. Echter, als die wallet vervolgens wordt gebruikt om bitcoin te verzenden, kan het de UTXO met de ordinal selecteren als invoer en de inscriptie verzenden of besteden aan fees.

source: A [guide](./collecting/sparrow-wallet.md) to creating an `ord`\-compatible wallet with [Sparrow Wallet](https://sparrowwallet.com/), is available in this handbook.
ar: يتوفر [guide](./collecting/sparrow-wallet.md) لإنشاء محفظة متوافقة مع `ord` باستخدام محفظة [Sparrow Wallet](https://sparrowwallet.com/) في هذا الدليل.
nl: Een [handleiding](./collecting/sparrow-wallet.md) voor het creëren van een `ord`-compatibele wallet met [Sparrow Wallet](https://sparrowwallet.com/) is beschikbaar in dit handboek.

source: Please note that if you follow this guide, you should not use the wallet you create to send BTC, unless you perform manual coin-selection to avoid sending ordinals.
ar: يرجى ملاحظة أنه إذا قمت باتباع هذا الدليل، يجب عليك عدم استخدام المحفظة التي تنشئها لإرسال BTC، إلا إذا قمت بإجراء اختيار يدوي للعملات لتجنب إرسال الأوردينال.
nl: Houd er rekening mee dat als je deze handleiding volgt, je de wallet die je creëert niet moet gebruiken om BTC te verzenden, tenzij je handmatige coin-selectie uitvoert om te voorkomen dat ordinals worden verzonden.

source: Collecting Inscriptions and Ordinals with Sparrow Wallet
ar: جمع أوردينالس و الإنسكريبشين باستخدام محفظة Sparrow
nl: Inscripties en Ordinals verzamelen met Sparrow Wallet

source: Users who cannot or have not yet set up the [ord](https://github.com/ordinals/ord) wallet can receive inscriptions and ordinals with alternative bitcoin wallets, as long as they are _very_ careful about how they spend from that wallet.
ar: المستخدمون الذين لا يستطيعون أو لم ينشئوا محفظة ord بعد يمكنهم تلقي أوردينالس والأرقام السرية باستخدام محافظ البيتكوين البديلة، طالما أنهم يكونون حذرين جداً في كيفية إنفاق من تلك المحفظة.
nl: Gebruikers die de [ord](https://github.com/ordinals/ord) wallet niet kunnen of nog niet hebben ingesteld, kunnen inscripties en ordinals ontvangen met alternatieve bitcoin wallets, zolang ze _zeer_ voorzichtig zijn met hoe ze vanuit die wallet uitgeven.

source: This guide gives some basic steps on how to create a wallet with [Sparrow Wallet](https://sparrowwallet.com/) which is compatible with `ord` and can be later imported into `ord`
ar: يقدم هذا الدليل بعض الخطوات الأساسية حول كيفية إنشاء محفظة باستخدام محفظة [Sparrow Wallet](https://sparrowwallet.com/) والتي تكون متوافقة مع محفظة `ord` ويمكن استيرادها لاحقًا إلى محفظة `ord`
nl: Deze gids geeft enkele basisstappen over hoe je een wallet kunt maken met [Sparrow Wallet](https://sparrowwallet.com/) die compatibel is met `ord` en later in `ord` kan worden geïmporteerd

source: ⚠️⚠️ Warning!! ⚠️⚠️
ar: ⚠️⚠️ تحذير!! ⚠️⚠️
nl: ⚠️⚠️ Waarschuwing!! ⚠️⚠️

source: As a general rule if you take this approach, you should use this wallet with the Sparrow software as a receive-only wallet.
ar: كقاعدة عامة، إذا اتبعت هذا النهج، يجب عليك استخدام هذه المحفظة مع برنامج Sparrow كمحفظة للتلقي فقط.
nl: Als algemene regel geldt dat je deze aanpak moet gebruiken en deze wallet alleen als ontvangwallet met de Sparrow-software moet gebruiken.

source: Do not spend any satoshis from this wallet unless you are sure you know what you are doing. You could very easily inadvertently lose access to your ordinals and inscriptions if you don't heed this warning.
ar: لا تنفق أي ساتوشي من هذه المحفظة ما لم تكن متأكدًا من أنك تعرف ما تفعله. يمكن أن تفقد بسهولة وبشكل غير مقصود الوصول إلى الأرقام السرية والنقوش الخاصة بك إذا لم تلتزم بهذا التحذير.
nl: Besteed geen satoshi's uit deze wallet tenzij je zeker weet wat je doet. Je kunt gemakkelijk per ongeluk de toegang tot je ordinals en inscripties verliezen als je deze waarschuwing negeert.

source: Wallet Setup & Receiving
ar: إعداد المحفظة والتلقي
nl: Wallet-instelling & Ontvangen

source: Download the Sparrow Wallet from the [releases page](https://sparrowwallet.com/download/) for your particular operating system.
ar: قم [بتنزيل](https://sparrowwallet.com/download/) محفظة Sparrow من صفحة الإصدارات الخاصة بنظام التشغيل الخاص بك.
nl: Download de Sparrow Wallet vanaf de [releases-pagina](https://sparrowwallet.com/download/) voor je specifieke besturingssysteem.

source: Select `File -> New Wallet` and create a new wallet called `ord`.
ar: اختر `File -> New Wallet` قم بإنشاء محفظة جديدة تسمى `ord`.
nl: Selecteer `File -> New Wallet` en maak een nieuwe wallet aan met de naam `ord`.

source: Change the `Script Type` to `Taproot (P2TR)` and select the `New or Imported Software Wallet` option.
ar: قم بتغيير نوع النص إلى `Taproot (P2TR)` واختر الخيار `New or Imported Software Wallet`.
nl: Verander het `Script Type` in `Taproot (P2TR)` en selecteer de optie `New or Imported Software Wallet`.

source: Select `Use 12 Words` and then click `Generate New`. Leave the passphrase blank.
ar: اختر `Use 12 Words` ثم انقر فوق `Generate New`. اترك مجال العبور فارغًا.
nl: Selecteer `Use 12 Words` en klik vervolgens op `Generate New`. Laat de wachtwoordzin leeg.

source: A new 12 word BIP39 seed phrase will be generated for you. Write this down somewhere safe as this is your backup to get access to your wallet. NEVER share or show this seed phrase to anyone else.
ar: سيتم إنشاء عبارة مفتاح عشوائي BIP39 مكونة من 12 كلمة بالنسبة لك. اكتبها في مكان آمن حيث تعد هذه نسختك الاحتياطية للوصول إلى محفظتك. لا تشارك أو تعرض هذه العبارة لأي شخص آخر أبدًا.
nl: Er wordt een nieuwe 12-woord BIP39 seed phrase voor je gegenereerd. Schrijf dit ergens veilig op, aangezien dit je backup is om toegang te krijgen tot je wallet. DEEL of TOON deze seed phrase NOOIT aan iemand anders.

source: Once you have written down the seed phrase click `Confirm Backup`.
ar: بمجرد أن تكتب العبارة، انقر فوق `Confirm Backup`.
nl: Zodra je de seed phrase hebt opgeschreven, klik je op `Confirm Backup`.

source: Re-enter the seed phrase which you wrote down, and then click `Create Keystore`.
ar: أعد إدخال العبارة التي كتبتها، ثم انقر فوق `Create Keystore`.
nl: Voer de seed phrase die je hebt opgeschreven opnieuw in en klik vervolgens op `Create Keystore`.

source: Click `Import Keystore`.
ar: انقر فوق `Import Keystore`.
nl: Klik op `Import Keystore`.

source: Click `Apply`. Add a password for the wallet if you want to.
ar: انقر فوق `Apply`. أضف كلمة مرور للمحفظة إذا كنت ترغب.
nl: Klik op `Apply`. Voeg een wachtwoord toe voor de wallet als je dat wilt.

source: You now have a wallet which is compatible with `ord`, and can be imported into `ord` using the BIP39 Seed Phrase. To receive ordinals or inscriptions, click on the `Receive` tab and copy a new address.
ar: لآن لديك محفظة متوافقة مع `ord`، ويمكن استيرادها إلى `ord` باستخدام عبارة البذرة BIP39. لاستقبال الأعداد أو النقوش، انقر على علامة `Receive` وانسخ عنوانًا جديدًا.
nl: Je hebt nu een wallet die compatibel is met `ord` en geïmporteerd kan worden in `ord` met de BIP39 Seed Phrase. Om ordinals of inscripties te ontvangen, klik je op het tabblad `Receive` en kopieer je een nieuw adres.

source: Each time you want to receive you should use a brand-new address, and not re-use existing addresses.
ar: في كل مرة تريد فيها الاستقبال، يجب أن تستخدم عنوانًا جديدًا تمامًا، ولا تستخدم عناوين موجودة بالفعل.
nl: Elke keer dat je wilt ontvangen, moet je een gloednieuw adres gebruiken en geen bestaande adressen hergebruiken.

source: Note that bitcoin is different to some other blockchain wallets, in that this wallet can generate an unlimited number of new addresses. You can generate a new address by clicking on the `Get Next Address` button. You can see all of your addresses in the `Addresses` tab of the app.
ar: يرجى ملاحظة أن البيتكوين مختلف عن بعض المحافظ الأخرى للبلوكشين، حيث يمكن لهذه المحفظة إنشاء عدد غير محدود من العناوين الجديدة. يمكنك إنشاء عنوان جديد عن طريق النقر فوق زر `Get Next Address`. يمكنك رؤية جميع عناوينك في علامة `Addresses` في التطبيق.
nl: Houd er rekening mee dat bitcoin anders is dan sommige andere blockchain wallets, in die zin dat deze wallet een onbeperkt aantal nieuwe adressen kan genereren. Je kunt een nieuw adres genereren door op de knop `Get Next Address` te klikken. Je kunt al je adressen bekijken in het tabblad `Addresses` van de app.

source: You can add a label to each address, so you can keep track of what it was used for.
ar: يمكنك إضافة تصنيف لكل عنوان، لتتمكن من تتبع ما تم استخدامه لأغراضه.
nl: Je kunt elk adres een label toevoegen, zodat je kunt bijhouden waarvoor het is gebruikt.

source: Validating / Viewing Received Inscriptions
ar: التحقق / عرض الأوردينالس المستلمة
nl: Inscripties valideren / Bekijken

source: Once you have received an inscription you will see a new transaction in the `Transactions` tab of Sparrow, as well as a new UTXO in the `UTXOs` tab.
ar: بمجرد استلامك لنقش، ستظهر صفقة جديدة في علامة `Transactions` في Sparrow، وكذلك ستظهرUTXO جديدة في علامة `UTXOs`.
nl: Zodra je een inscriptie hebt ontvangen, zie je een nieuwe transactie in het tabblad `Transactions` van Sparrow, evenals een nieuwe UTXO in het tabblad `UTXOs`.

source: Initially this transaction may have an "Unconfirmed" status, and you will need to wait for it to be mined into a bitcoin block before it is fully received.
ar: بداية، قد تكون هذه الصفقة غير مؤكدة "Unconfirmed"، وسيتعين عليك الانتظار حتى تُعدد في كتلة بيتكوين قبل أن تستقبل بشكل كامل.
nl: In het begin kan deze transactie de status "Unconfirmed" hebben, en je zult moeten wachten totdat deze is gemined in een bitcoinblok voordat deze volledig is ontvangen.

source: To track the status of your transaction you can right-click on it, select `Copy Transaction ID` and then paste that transaction id into [mempool.space](https://mempool.space).
ar: لتتبع حالة صفقتك، يمكنك النقر بزر الماوس الأيمن عليها، ثم اختيار `Copy Transaction ID` ومن ثم لصق هذا المعرف في [mempool.space](https://mempool.space/).
nl: Om de status van je transactie te volgen, kun je met de rechtermuisknop op de transactie klikken, `Copy Transaction ID` selecteren en vervolgens die transactie-ID plakken op [mempool.space](https://mempool.space).

source: Once the transaction has confirmed, you can validate and view your inscription by heading over to the `UTXOs` tab, finding the UTXO you want to check, right-clicking on the `Output` and selecting `Copy Transaction Output`. This transaction output id can then be pasted into the [ordinals.com](https://ordinals.com) search.
ar: بمجرد تأكيد الصفقة، يمكنك التحقق وعرض النقش الخاص بك عن طريق الانتقال إلى علامة `UTXOs`، والبحث عنUTXO التي ترغب في التحقق منها، ثم النقر بزر الماوس الأيمن على`Output` واختيار `Copy Transaction Output`. يمكن لكتلة الإخراج هذه أن تُلصق في محرك البحث على موقع [ordinals.com](https://ordinals.com).
nl: Zodra de transactie is bevestigd, kun je je inscriptie valideren en bekijken door naar het tabblad `UTXOs` te gaan, de UTXO te vinden die je wilt controleren, met de rechtermuisknop op de `Output` te klikken en `Copy Transaction Output` te selecteren. Deze transactie-uitvoer-ID kan vervolgens worden geplakt in de zoekfunctie van [ordinals.com](https://ordinals.com).

source: Freezing UTXO's
ar: تجميد UTXO's
nl: UTXO's Bevriezen

source: As explained above, each of your inscriptions is stored in an Unspent Transaction Output (UTXO). You want to be very careful not to accidentally spend your inscriptions, and one way to make it harder for this to happen is to freeze the UTXO.
ar: كما تم شرحه أعلاه، يتم تخزين كل من الإنسكريبشين في ناتج الصفقة غير المنفقة (UTXO). يجب أن تكون حذرًا جدًا لكي لا تنفق الإنسكريبشين عن طريق الخطأ، وطريقة لجعلها أصعب هو تجميدها.
nl: Zoals hierboven uitgelegd, wordt elke inscriptie opgeslagen in een Unspent Transaction Output (UTXO). Je moet uiterst voorzichtig zijn om je inscripties niet per ongeluk uit te geven, en een manier om dit moeilijker te maken, is door de UTXO te bevriezen.

source: To do this, go to the `UTXOs` tab, find the UTXO you want to freeze, right-click on the `Output` and select `Freeze UTXO`.
ar: للقيام بذلك، انتقل إلى علامة "UTXOs"، وابحث عن نقدة التي ترغب في تجميدها، ثم انقر بزر الماوس الأيمن على الإخراج واختر "Freeze UTXO".
nl: Om dit te doen, ga je naar het tabblad `UTXOs`, zoek je de UTXO die je wilt bevriezen, klik je met de rechtermuisknop op de `Output` en selecteer je `Freeze UTXO`.

source: This UTXO (Inscription) is now un-spendable within the Sparrow Wallet until you unfreeze it.
ar: ستكون هذه UTXO (الإنسكريبشين) غير قابلة للإنفاق داخل محفظة Sparrow حتى تُلغى تجميدها.
nl: Deze UTXO (Inscriptie) is nu niet meer besteedbaar binnen de Sparrow Wallet totdat je deze ontgrendelt.

source: Importing into `ord` wallet
ar: استيرادها إلى محفظة `ord`
nl: Importeren in `ord` wallet

source: For details on setting up Bitcoin Core and the `ord` wallet check out the [Wallet Guide](../wallet.md)
nl: Voor details over het instellen van Bitcoin Core en de `ord` wallet kun je de [Wallet Guide](../wallet.md) bekijken.

source: When setting up `ord`, instead of running `ord wallet create` to create a brand-new wallet, you can import your existing wallet using `ord wallet restore "BIP39 SEED PHRASE"` using the seed phrase you generated with Sparrow Wallet.
ar: عند إعداد `ord`، بدلاً من تشغيل `ord wallet create` لإنشاء محفظة جديدة تمامًا، يمكنك استيراد محفظتك الحالية باستخدام `"ord wallet restore "BIP39 SEED PHRASE`باستخدام عبارة البذرة التي أنشأتها باستخدام محفظة Sparrow.
nl: Bij het instellen van `ord` kun je in plaats van `ord wallet create` om een gloednieuwe wallet aan te maken, je bestaande wallet importeren met `ord wallet restore "BIP39 SEED PHRASE"` door de seed phrase te gebruiken die je met Sparrow Wallet hebt gegenereerd.

source: There is currently a [bug](https://github.com/ordinals/ord/issues/1589) which causes an imported wallet to not be automatically rescanned against the blockchain. To work around this you will need to manually trigger a rescan using the bitcoin core cli: `bitcoin-cli -rpcwallet=ord rescanblockchain 767430`
ar: هناك [خلل](https://github.com/ordinals/ord/issues/1589) حاليًا يجعل من المحفظة المستوردة ألا تُمسح تلقائياً ضد سلسلة الكتل. للتغلب على ذلك، ستحتاج إلى تشغيل عملية مسح يدويًا باستخدام واجهة سطر الأوامر للنود البيتكوين: `bitcoin-cli -rpcwallet=ord rescanblockchain 767430`
nl: Er is momenteel een [bug](https://github.com/ordinals/ord/issues/1589) die ervoor zorgt dat een geïmporteerde wallet niet automatisch opnieuw wordt gescand tegen de blockchain. Om dit te omzeilen, moet je handmatig een rescan starten met de Bitcoin Core CLI: `bitcoin-cli -rpcwallet=ord rescanblockchain 767430`

source: You can then check your wallet's inscriptions using `ord wallet inscriptions`
ar: بعد ذلك، يمكنك التحقق من الإنسكريبشين محفظتك باستخدام `ord wallet inscriptions`
nl: Je kunt vervolgens de inscripties van je wallet controleren met `ord wallet inscriptions`

source: Note that if you have previously created a wallet with `ord`, then you will already have a wallet with the default name, and will need to give your imported wallet a different name. You can use the `--wallet` parameter in all `ord` commands to reference a different wallet, eg:
ar: يرجى ملاحظة أنه إذا كنت قد أنشأت بالفعل محفظة بواسطة ord في السابق، فسيكون لديك محفظة بالاسم الافتراضي بالفعل، وستحتاج إلى تعيين اسم محفظتك المستوردة باسم مختلف. يمكنك استخدام ` wallet-- ` براميتير في جميع أوامر `ord` للإشارة إلى محفظة مختلفة، على سبيل المثال:
nl: Houd er rekening mee dat als je eerder een wallet hebt aangemaakt met `ord`, je al een wallet hebt met de standaardnaam, en je je geïmporteerde wallet een andere naam moet geven. Je kunt de parameter `--wallet` gebruiken in alle `ord`-commando's om naar een andere wallet te verwijzen, bijvoorbeeld:

source: Sending inscriptions with Sparrow Wallet
ar: جمع الإنسكريبشين باستخدام محفظة سباروو Sparrow
nl: Inscripties verzenden met Sparrow Wallet

source: ⚠️⚠️ Warning ⚠️⚠️
ar: ⚠️⚠️ تحذير ⚠️⚠️
nl: ⚠️⚠️ Waarschuwing ⚠️⚠️

source: While it is highly recommended that you set up a bitcoin core node and run the `ord` software, there are certain limited ways you can send inscriptions out of Sparrow Wallet in a safe way. Please note that this is not recommended, and you should only do this if you fully understand what you are doing.
ar: على الرغم من أنه من المستحسن بشدة إعداد بيتكوين نود Bitcoin Core وتشغيل برنامج `ord`، إلا أن هناك طرقًا محدودة يمكنك من خلالها إرسال الإنسكريبشين من محفظة Sparrow بطريقة آمنة. يرجى ملاحظة أن هذا غير مستحسن ويجب أن تقوم به فقط إذا كنت تفهم تمامًا ما تقوم به.
nl: Hoewel het sterk wordt aanbevolen om een Bitcoin Core-node op te zetten en de `ord`-software uit te voeren, zijn er bepaalde beperkte manieren waarop je inscripties veilig kunt verzenden vanuit Sparrow Wallet. Houd er rekening mee dat dit niet wordt aanbevolen en dat je dit alleen moet doen als je volledig begrijpt wat je doet.

source: Using the `ord` software will remove much of the complexity we are describing here, as it is able to automatically and safely handle sending inscriptions in an easy way.
ar: استخدام برنامج `ord` سيقلل بشكل كبير من التعقيد الذي نصفه هنا، حيث يمكن للبرنامج التعامل تلقائيًا وبأمان مع إرسال النقاشات بطريقة سهلة.
nl: Het gebruik van de `ord`-software zal veel van de complexiteit die we hier beschrijven wegnemen, aangezien het automatisch en veilig het verzenden van inscripties op een eenvoudige manier kan afhandelen.

source: ⚠️⚠️ Additional Warning ⚠️⚠️
ar: ⚠️⚠️ تحذير إضافي ⚠️⚠️
nl: ⚠️⚠️ Extra Waarschuwing ⚠️⚠️

source: Don't use your sparrow inscriptions wallet to do general sends of non-inscription bitcoin. You can setup a separate wallet in sparrow if you need to do normal bitcoin transactions, and keep your inscriptions wallet separate.
ar: لا تستخدم محفظة Sparrow الخاصة بالتسجيلات لإرسال بيتكوين عامة غير مرتبطة بالتسجيلات. يمكنك إعداد محفظة منفصلة في Sparrow إذا كنت بحاجة إلى إجراء معاملات بيتكوين العادية، والاحتفاظ بمحفظتك للتسجيلات بشكل منفصلة.
nl: Gebruik je Sparrow-inscriptieswallet niet voor algemene overboekingen van bitcoin die geen inscripties zijn. Je kunt een aparte wallet in Sparrow opzetten als je normale bitcointransacties wilt uitvoeren, en je inscriptieswallet apart houden.

source: Before sending any transaction it's important that you have a good mental model for bitcoin's Unspent Transaction Output (UTXO) system. The way Bitcoin works is fundamentally different to many other blockchains such as Ethereum. In Ethereum generally you have a single address in which you store ETH, and you cannot differentiate between any of the ETH - it is just all a single value of the total amount in that address. Bitcoin works very differently in that we generate a new address in the wallet for each receive, and every time you receive sats to an address in your wallet you are creating a new UTXO. Each UTXO can be seen and managed individually. You can select specific UTXO's which you want to spend, and you can choose not to spend certain UTXO's.
ar: قبل إجراء أي عملية إرسال، من المهم أن يكون لديك نموذج عقلي جيد لنظام ناتج الصفقات غير المنفقة (UTXO) في البيتكوين. الطريقة التي يعمل بها البيتكوين مختلفة بشكل جوهري عن العديد من البلوكشين الأخرى مثل إيثيريوم. عمومًا في إيثيريوم، لديك عنوان واحد عادةً تقوم بتخزين ETH فيه، ولا يمكنك التمييز بين أي مبلغ من ETH - فهو مجموعة واحدة من القيمة الإجمالية في تلك العنوان. يعمل البيتكوين بطريقة مختلفة تمامًا حيث نقوم بإنشاء عنوان جديد في المحفظة لكل عملية استقبال، وفي كل مرة تستقبل فيها ساتوشي إلى عنوان في محفظتك، فأنت تقوم بإنشاء ناتج صفقة جديد. يمكن رؤية وإدارة كل ناتج صفقة غير المنفقة على حدة. يمكنك تحديد ناتج صفقة معين ترغب في الإنفاق عليه، ويمكنك اختيار عدم إنفاق بعض نواتج الصفقات.
nl: Voordat je een transactie verzendt, is het belangrijk dat je een goed mentaal model hebt van het Unspent Transaction Output (UTXO)-systeem van bitcoin. De manier waarop Bitcoin werkt is fundamenteel anders dan bij veel andere blockchains zoals Ethereum. In Ethereum heb je doorgaans een enkel adres waarop je ETH opslaat, en je kunt geen onderscheid maken tussen de ETH - het is gewoon één enkele waarde van het totale bedrag op dat adres. Bitcoin werkt heel anders: we genereren een nieuw adres in de wallet voor elke ontvangst, en elke keer dat je sats ontvangt op een adres in je wallet, creëer je een nieuwe UTXO. Elke UTXO kan afzonderlijk worden bekeken en beheerd. Je kunt specifieke UTXO's selecteren die je wilt uitgeven, en je kunt ervoor kiezen om bepaalde UTXO's niet uit te geven.

source: Some Bitcoin wallets do not expose this level of detail, and they just show you a single summed up value of all the bitcoin in your wallet. However, when sending inscriptions it is important that you use a wallet like Sparrow which allows for UTXO control.
ar: بعض محافظ البيتكوين لا تعرض هذا المستوى من التفاصيل، وهي تعرض لك قيمة واحدة مجمعة لجميع البيتكوين في محفظتك. ومع ذلك، عند إرسال النقوش من المهم استخدام محفظة مثل Sparrow التي تسمح بالتحكم في نواتج الصفقات.
nl: Sommige Bitcoin-wallets tonen dit detailniveau niet en laten je alleen een enkele opgetelde waarde van al het bitcoin in je wallet zien. Echter, bij het verzenden van inscripties is het belangrijk dat je een wallet gebruikt zoals Sparrow, die UTXO-controle mogelijk maakt.

source: Inspecting your inscription before sending
ar: تفحص الإنسكريبشين قبل الإرسال
nl: Je inscriptie inspecteren voordat je deze verzendt

source: Like we have previously described inscriptions are inscribed onto sats, and sats are stored within UTXOs. UTXO's are a collection of satoshis with some particular value of the number of satoshis (the output value). Usually (but not always) the inscription will be inscribed on the first satoshi in the UTXO.
ar: كما تم وصفه سابقًا، تُنقش النقوش على الساتوشي، والساتوشي تُخزن داخل ناتج الصفقة غير المنفقة (UTXO). تعد نواتج الصفقات (UTXO) مجموعة من الساتوشي مع قيمة محددة لعدد الساتوشي (قيمة الإخراج). عادةً (وليس دائمًا) ستكون الأنسكريبشين منقشه على أول ساتوشي في نواتج الصفقات ال UTXO.
nl: Zoals eerder beschreven, worden inscripties op sats geschreven, en sats worden opgeslagen binnen UTXO's. UTXO's zijn een verzameling satoshis met een specifieke waarde in aantal satoshis (de outputwaarde). Meestal (maar niet altijd) zal de inscriptie worden geschreven op de eerste satoshi in de UTXO.

source: When inspecting your inscription before sending the main thing you will want to check is which satoshi in the UTXO your inscription is inscribed on.
ar: عند فحص تسجيلك قبل إرساله، سترغب في التحقق أساسًا من الساتوشي الذي تم تسجيله في UTXO الخاص بك.
nl: Bij het inspecteren van je inscriptie voordat je deze verzendt, is de belangrijkste stap om te controleren op welke satoshi in de UTXO je inscriptie is geschreven.
