Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: `/r/blockheight`: latest block height.
nl: `/r/blockheight`: laatste blockhoogte.

source: `/r/blockinfo/<QUERY>`: block info. `<QUERY>` may be a block height or block hash.
nl: `/r/blockinfo/<QUERY>`: blokinformatie. `<QUERY>` kan een blockhoogte of block hash zijn.

source: `/r/blocktime`: UNIX time stamp of latest block.
nl: `/r/blocktime`: UNIX-tijdstempel van het laatste block.

source: `/r/children/<INSCRIPTION_ID>`: the first 100 child inscription ids.
nl: `/r/children/<INSCRIPTION_ID>`: de eerste 100 kindinscriptie-ID's.

source: `/r/children/<INSCRIPTION_ID>/<PAGE>`: the set of 100 child inscription ids on `<PAGE>`.
nl: `/r/children/<INSCRIPTION_ID>/<PAGE>`: de set van 100 kindinscriptie-ID's op `<PAGE>`.

source: `/r/children/<INSCRIPTION_ID>/inscriptions`: details of the first 100 child inscriptions.
nl: `/r/children/<INSCRIPTION_ID>/inscriptions`: details van de eerste 100 kindinscripties.

source: `/r/children/<INSCRIPTION_ID>/inscriptions/<PAGE>`: details of the set of 100 child inscriptions on `<PAGE>`.
nl: `/r/children/<INSCRIPTION_ID>/inscriptions/<PAGE>`: details van de set van 100 kindinscripties op `<PAGE>`.

source: `/r/inscription/<INSCRIPTION_ID>`: information about an inscription
nl: `/r/inscription/<INSCRIPTION_ID>`: informatie over een inscriptie

source: `/r/metadata/<INSCRIPTION_ID>`: JSON string containing the hex-encoded CBOR metadata.
nl: `/r/metadata/<INSCRIPTION_ID>`: JSON-string met de hex-gecodeerde CBOR-metadata.

source: `/r/parents/<INSCRIPTION_ID>`: the first 100 parent inscription ids.
nl: `/r/parents/<INSCRIPTION_ID>`: de eerste 100 ouderinscriptie-ID's.

source: `/r/parents/<INSCRIPTION_ID>/<PAGE>`: the set of 100 parent inscription ids on `<PAGE>`.
nl: `/r/parents/<INSCRIPTION_ID>/<PAGE>`: de set van 100 ouderinscriptie-ID's op `<PAGE>`.

source: `/r/sat/<SAT_NUMBER>`: the first 100 inscription ids on a sat.
nl: `/r/sat/<SAT_NUMBER>`: de eerste 100 inscriptie-ID's op een satoshi.

source: `/r/sat/<SAT_NUMBER>/<PAGE>`: the set of 100 inscription ids on `<PAGE>`.
nl: `/r/sat/<SAT_NUMBER>/<PAGE>`: de set van 100 inscriptie-ID's op `<PAGE>`.

source: `/r/sat/<SAT_NUMBER>/at/<INDEX>`: the inscription id at `<INDEX>` of all inscriptions on a sat. `<INDEX>` may be a negative number to index from the back. `0` being the first and `-1` being the most recent for example.
nl: `/r/sat/<SAT_NUMBER>/at/<INDEX>`: de inscriptie-ID op `<INDEX>` van alle inscripties op een satoshi. `<INDEX>` kan een negatief getal zijn om van achteren te indexeren. Bijvoorbeeld, `0` is de eerste en `-1` is de meest recente.

source: Note: `<SAT_NUMBER>` only allows the actual number of a sat no other sat notations like degree, percentile or decimal. We may expand to allow those in the future.
nl: Opmerking: `<SAT_NUMBER>` staat alleen het daadwerkelijke nummer van een satoshi toe, en geen andere sat-notaties zoals graad, percentiel of decimaal. We kunnen in de toekomst uitbreiden om die toe te staan.

source: Responses from the above recursive endpoints are JSON. For backwards compatibility additional endpoints are supported, some of which return plain-text responses.
nl: Antwoorden van de bovenstaande recursieve eindpunten zijn JSON. Voor achterwaartse compatibiliteit worden extra eindpunten ondersteund, waarvan sommige platte-tekst-antwoorden retourneren.

source: `/blockheight`: latest block height.
nl: `/blockheight`: de laatste blockhoogte.

source: `/blockhash`: latest block hash.
nl: `/blockhash`: de laatste block hash.

source: `/blockhash/<HEIGHT>`: block hash at given block height.
nl: `/blockhash/<HEIGHT>`: block hash op de opgegeven blockhoogte.

source: `/blocktime`: UNIX time stamp of latest block.
nl: `/blocktime`: UNIX-tijdstempel van het laatste blok.

source: Note: `feerate_percentiles` are feerates at the 10th, 25th, 50th, 75th, and 90th percentile in sats/vB.
nl: Opmerking: `feerate_percentiles` zijn feerates op het 10e, 25e, 50e, 75e en 90e percentiel in sats/vB.

source: "version"
nl: "versie"

source: Aspect Ratio
nl: Beeldverhouding

source: Inscriptions should be rendered with a square aspect ratio. Non-square aspect ratio inscriptions should not be cropped, and should instead be centered and resized to fit within their container.
nl: Inscripties moeten worden weergegeven met een vierkant beeldverhouding. Niet-vierkante beeldverhoudingen mogen niet worden bijgesneden, maar moeten in plaats daarvan gecentreerd en aangepast worden om binnen hun container te passen.

source: Maximum Size
nl: Maximale grootte

source: The `ord` explorer, used by [ordinals.com](https://ordinals.com/), displays inscription previews with a maximum size of 576 by 576 pixels, making it a reasonable choice when choosing a maximum display size.
nl: De `ord` explorer, gebruikt door [ordinals.com](https://ordinals.com/), toont inscriptievoorbeelden met een maximale grootte van 576 bij 576 pixels, wat een redelijke keuze maakt bij het bepalen van een maximale weergavegrootte.

source: Image Rendering
nl: Afbeelding Weergave

source: The CSS `image-rendering` property controls how images are resampled when upscaled and downscaled.
nl: De CSS `image-rendering` eigenschap bepaalt hoe afbeeldingen worden hersampled bij het vergroten of verkleinen.

source: When downscaling image inscriptions, `image-rendering: auto`, should be used. This is desirable even when downscaling pixel art.
nl: Bij het verkleinen van afbeeldingsinscripties moet `image-rendering: auto` worden gebruikt. Dit is wenselijk, zelfs bij het verkleinen van pixelart.

source: When upscaling image inscriptions other than AVIF, `image-rendering: pixelated` should be used. This is desirable when upscaling pixel art, since it preserves the sharp edges of pixels. It is undesirable when upscaling non-pixel art, but should still be used for visual compatibility with the `ord` explorer.
nl: Bij het vergroten van afbeeldingsinscripties anders dan AVIF, moet `image-rendering: pixelated` worden gebruikt. Dit is wenselijk bij het vergroten van pixelart, omdat het de scherpe randen van pixels behoudt. Het is ongewenst bij het vergroten van niet-pixelart, maar moet nog steeds worden gebruikt voor visuele compatibiliteit met de `ord` explorer.

source: When upscaling AVIF and JPEG XL inscriptions, `image-rendering: auto` should be used. This allows inscribers to opt-in to non-pixelated upscaling for non-pixel art inscriptions. Until such time as JPEG XL is widely supported by browsers, it is not a recommended image format.
nl: Bij het vergroten van AVIF- en JPEG XL-inscripties moet `image-rendering: auto` worden gebruikt. Dit stelt inschrijvers in staat om te kiezen voor niet-pixelated vergroting voor niet-pixelkunstinscripties. Totdat JPEG XL breed wordt ondersteund door browsers, wordt het niet als een aanbevolen afbeeldingsformaat beschouwd.

source: Runes allow Bitcoin transactions to etch, mint, and transfer Bitcoin-native digital commodities.
nl: Runes stellen Bitcoin-transacties in staat om Bitcoin-native digitale goederen te graveren, te slaan en over te dragen.

source: Whereas every inscription is unique, every unit of a rune is the same. They are interchangeable tokens, fit for a variety of purposes.
nl: Hoewel elke inscriptie uniek is, is elke eenheid van een rune hetzelfde. Het zijn verwisselbare tokens, geschikt voor verschillende doeleinden.

source: Rune protocol messages, called runestones, are stored in Bitcoin transaction outputs.
nl: Rune-protocolberichten, genaamd runestones, worden opgeslagen in Bitcoin-transactieoutputs.

source: A runestone output's script pubkey begins with an `OP_RETURN`, followed by `OP_13`, followed by zero or more data pushes. These data pushes are concatenated and decoded into a sequence of 128-bit integers, and finally parsed into a runestone.
nl: Een runestone-outputscriptpubkey begint met een `OP_RETURN`, gevolgd door `OP_13`, gevolgd door nul of meer datastuwers. Deze datastuwers worden samengevoegd en gedecodeerd in een reeks van 128-bit gehele getallen, en uiteindelijk geparsed in een runestone.

source: A transaction may have at most one runestone.
nl: Een transactie mag maximaal één runestone bevatten.

source: A runestone may etch a new rune, mint an existing rune, and transfer runes from a transaction's inputs to its outputs.
nl: Een runestone kan een nieuwe rune graveren, een bestaande rune slaan en runes overdragen van de invoeren naar de outputs van een transactie.

source: A transaction output may hold balances of any number of runes.
nl: Een transactieoutput kan saldi van elk aantal runes bevatten.

source: Runes are identified by IDs, which consist of the block in which a rune was etched and the index of the etching transaction within that block, represented in text as `BLOCK:TX`. For example, the ID of the rune etched in the 20th transaction of the 500th block is `500:20`.
nl: Runes worden geïdentificeerd door ID's, die bestaan uit het blok waarin een rune is gegraveerd en de index van de graveringstransactie binnen dat blok, weergegeven in tekst als `BLOK:TX`. Bijvoorbeeld, de ID van de rune gegraveerd in de 20e transactie van het 500e blok is `500:20`.

source: Etching
nl: Graveren (Etching)

source: Runes come into existence by being etched. Etching creates a rune and sets its properties. Once set, these properties are immutable, even to its etcher.
nl: Runes komen tot stand door te worden gegraveerd. Graveren creëert een rune en stelt zijn eigenschappen in. Zodra deze eigenschappen zijn ingesteld, zijn ze onwijzigbaar, zelfs voor de graveren.

source: Name
nl: Naam

source: Names consist of the letters A through Z and are between one and twenty-six letters long. For example `UNCOMMONGOODS` is a rune name.
nl: Namen bestaan uit de letters A tot Z en zijn tussen de één en zesentwintig letters lang. Bijvoorbeeld `UNCOMMONGOODS` is een runennaam.

source: Names may contain spacers, represented as bullets, to aid readability. `UNCOMMONGOODS` might be etched as `UNCOMMON•GOODS`.
nl: Namen mogen spaties bevatten, weergegeven als punten, om de leesbaarheid te verbeteren. `UNCOMMONGOODS` kan bijvoorbeeld worden gegraveerd als `UNCOMMON•GOODS`.

source: The uniqueness of a name does not depend on spacers. Thus, a rune may not be etched with the same sequence of letters as an existing rune, even if it has different spacers.
nl: De uniciteit van een naam hangt niet af van spaties. Een rune kan dus niet worden gegraveerd met dezelfde reeks letters als een bestaande rune, zelfs niet als deze verschillende spaties heeft.

source: Spacers can only be placed between two letters. Finally, spacers do not count towards the letter count.
nl: Spaties kunnen alleen worden geplaatst tussen twee letters. Bovendien tellen spaties niet mee voor het aantal letters.

source: Divisibility
nl: Deelbaarheid

source: A rune's divisibility is how finely it may be divided into its atomic units. Divisibility is expressed as the number of digits permissible after the decimal point in an amount of runes. A rune with divisibility 0 may not be divided. A unit of a rune with divisibility 1 may be divided into ten sub-units, a rune with divisibility 2 may be divided into a hundred, and so on.
nl: De deelbaarheid van een rune is hoe fijn deze kan worden verdeeld in zijn atomaire eenheden. Deelbaarheid wordt uitgedrukt als het aantal cijfers dat is toegestaan na de decimale punt in een hoeveelheid runes. Een rune met deelbaarheid 0 kan niet worden verdeeld. Een eenheid van een rune met deelbaarheid 1 kan worden verdeeld in tien sub-eenheden, een rune met deelbaarheid 2 kan worden verdeeld in honderd, enzovoort.

source: Symbol
nl: Symbool

source: A rune's currency symbol is a single Unicode code point, for example `$`, `⧉`, or `🧿`, displayed after quantities of that rune.
nl: Het valutateken van een rune is een enkel Unicode-teken, bijvoorbeeld `$`, `⧉` of `🧿`, weergegeven na hoeveelheden van die rune.

source: 101 atomic units of a rune with divisibility 2 and symbol `🧿` would be rendered as `1.01 🧿`.
nl: 101 atomaire eenheden van een rune met deelbaarheid 2 en symbool `🧿` zouden worden weergegeven als `1.01 🧿`.

source: If a rune does not have a symbol, the generic currency sign `¤`, also called a scarab, should be used.
nl: Als een rune geen symbool heeft, moet het algemene valutasymbool `¤`, ook wel een scarabee genoemd, worden gebruikt.

source: The etcher of a rune may optionally allocate to themselves units of the rune being etched. This allocation is called a premine.
nl: De graveren van een rune kan naar eigen keuze een aantal eenheden van de rune die wordt gegraveerd aan zichzelf toewijzen. Deze toewijzing wordt een premine genoemd.

source: Terms
nl: Voorwaarden

source: A rune may have an open mint, allowing anyone to create and allocate units of that rune for themselves. An open mint is subject to terms, which are set upon etching.
nl: Een rune kan een open mint hebben, waardoor iedereen eenheden van die rune voor zichzelf kan creëren en toewijzen. Een open mint is onderworpen aan voorwaarden, die worden vastgesteld bij het graveren.

source: A mint is open while all terms of the mint are satisfied, and closed when any of them are not. For example, a mint may be limited to a starting height, an ending height, and a cap, and will be open between the starting height and ending height, or until the cap is reached, whichever comes first.
nl: Een mint is open zolang aan alle voorwaarden van de mint wordt voldaan, en gesloten wanneer aan een van deze voorwaarden niet wordt voldaan. Bijvoorbeeld, een mint kan beperkt zijn tot een starthoogte, een eindhoogte en een limiet, en zal open zijn tussen de starthoogte en de eindhoogte, of totdat de limiet is bereikt, afhankelijk van wat het eerst gebeurt.

source: Cap
nl: Limiet

source: The number of times a rune may be minted is its cap. A mint is closed once the cap is reached.
nl: Het aantal keren dat een rune mag worden geslagen is de limiet. Een mint wordt gesloten zodra de limiet is bereikt.

source: Amount
nl: Aantal

source: Each mint transaction creates a fixed amount of new units of a rune.
nl: Elke mint-transactie creëert een vast aantal nieuwe eenheden van een rune.

source: Start Height
nl: Starthoogte

source: A mint is open starting in the block with the given start height.
nl: Een mint is open vanaf het blok met de gegeven starthoogte.

source: End Height
nl: Eindhoogte

source: A rune may not be minted in or after the block with the given end height.
nl: Een rune mag niet worden gemint in of na het blok met de gegeven eindhoogte.

source: A mint is open starting in the block whose height is equal to the start offset plus the height of the block in which the rune was etched.
nl: Een mint is open vanaf het blok waarvan de hoogte gelijk is aan de startoffset plus de hoogte van het blok waarin de rune werd gegraveerd.

source: A rune may not be minted in or after the block whose height is equal to the end offset plus the height of the block in which the rune was etched.
nl: Een rune mag niet worden gemint in of na het blok waarvan de hoogte gelijk is aan de eindoffset plus de hoogte van het blok waarin de rune werd gegraveerd.

source: While a rune's mint is open, anyone may create a mint transaction that creates a fixed amount of new units of that rune, subject to the terms of the mint.
nl: Zolang de mint van een rune open is, kan iedereen een mint-transactie maken die een vast aantal nieuwe eenheden van die rune creëert, onderhevig aan de voorwaarden van de mint.

source: Transferring
nl: Overdragen

source: When transaction inputs contain runes, or new runes are created by a premine or mint, those runes are transferred to that transaction's outputs. A transaction's runestone may change how input runes transfer to outputs.
nl: Wanneer transactie-invoeren runes bevatten, of nieuwe runes worden gecreëerd door een premine of mint, worden die runes overgedragen naar de outputs van die transactie. Een runestone van een transactie kan beïnvloeden hoe invoerrunes naar outputs worden overgedragen.

source: Edicts
nl: Edicten

source: A runestone may contain any number of edicts. Edicts consist of a rune ID, an amount, and an output number. Edicts are processed in order, allocating unallocated runes to outputs.
nl: Een runestone kan elk aantal edicten bevatten. Edicten bestaan uit een rune-ID, een hoeveelheid en een outputnummer. Edicten worden in volgorde verwerkt, waarbij niet-toegewezen runes worden toegewezen aan outputs.

source: After all edicts are processed, remaining unallocated runes are transferred to the transaction's first non-`OP_RETURN` output. A runestone may optionally contain a pointer that specifies an alternative default output.
nl: Nadat alle edicten zijn verwerkt, worden de resterende niet-toegewezen runes overgedragen naar de eerste non-`OP_RETURN` output van de transactie. Een runestone kan optioneel een pointer bevatten die een alternatieve standaardoutput specificeert.

source: Burning
nl: Verbranden

source: Runes may be burned by transferring them to an `OP_RETURN` output with an edict or pointer.
nl: Runes kunnen worden verbrand door ze over te dragen naar een `OP_RETURN` output met een edict of pointer.

source: Cenotaphs
nl: Cenotaaf

source: Runestones may be malformed for a number of reasons, including non-pushdata opcodes in the runestone `OP_RETURN`, invalid varints, or unrecognized runestone fields.
nl: Runestones kunnen om verschillende redenen defect zijn, waaronder non-pushdata opcodes in de runestone `OP_RETURN`, ongeldige varints of niet-herkende runestone-velden.

source: Malformed runestones are termed [cenotaphs](https://en.wikipedia.org/wiki/Cenotaph).
nl: Defecte runestones worden [cenotaafs](https://en.wikipedia.org/wiki/Cenotaph) genoemd.

source: Runes input to a transaction with a cenotaph are burned. Runes etched in a transaction with a cenotaph are set as unmintable. Mints in a transaction with a cenotaph count towards the mint cap, but the minted runes are burned.
nl: Runes die als invoer worden gebruikt in een transactie met een cenotaaf worden verbrand. Runes die zijn gegraveerd in een transactie met een cenotaaf worden ingesteld als niet-slaable. Mints in een transactie met een cenotaaf tellen mee voor de mintlimiet, maar de geslagen runes worden verbrand.

source: Cenotaphs are an upgrade mechanism, allowing runestones to be given new semantics that change how runes are created and transferred, while not misleading unupgraded clients as to the location of those runes, as unupgraded clients will see those runes as having been burned.
nl: Cenotaafs zijn een upgrade-mechanisme waarmee runestones nieuwe semantiek kunnen krijgen die verandert hoe runes worden gecreëerd en overgedragen, terwijl niet-geüpgradede clients niet worden misleid over de locatie van die runes. Niet-geüpgradede clients zullen die runes zien als zijnde verbrand.

source: Runes Does Not Have a Specification
nl: Runes hebben geen specificatie

source: The Runes reference implementation, `ord`, is the normative specification of the Runes protocol.
nl: De referentie-implementatie van Runes, `ord`, is de normatieve specificatie van het Runes-protocol.

source: Nothing you read here or elsewhere, aside from the code of `ord`, is a specification. This prose description of the runes protocol is provided as a guide to the behavior of `ord`, and the code of `ord` itself should always be consulted to confirm the correctness of any prose description.
nl: Niets wat je hier of elders leest, behalve de code van `ord`, is een specificatie. Deze prozaïsche beschrijving van het runes-protocol wordt verstrekt als een gids voor het gedrag van `ord`, en de code van `ord` zelf moet altijd worden geraadpleegd om de juistheid van elke prozaïsche beschrijving te bevestigen.

source: If, due to a bug in `ord`, this document diverges from the actual behavior of `ord` and it is impractically disruptive to change `ord`'s behavior, this document will be amended to agree with `ord`'s actual behavior.
nl: Als door een bug in `ord` dit document afwijkt van het daadwerkelijke gedrag van `ord` en het onpraktisch verstorend is om het gedrag van `ord` te wijzigen, zal dit document worden aangepast om overeen te komen met het werkelijke gedrag van `ord`.

source: Users of alternative implementations do so at their own risk, and services wishing to integrate Runes are strongly encouraged to use `ord` itself to make Runes transactions, and to determine the state of runes, mints, and balances.
nl: Gebruikers van alternatieve implementaties doen dit op eigen risico, en diensten die Runes willen integreren worden sterk aangemoedigd om `ord` zelf te gebruiken voor het uitvoeren van Runes-transacties en voor het bepalen van de status van runes, mints en saldi.

source: Rune protocol messages are termed "runestones".
nl: Berichten van het rune-protocol worden "runestones" genoemd.

source: The Runes protocol activates on block 840,000. Runestones in earlier blocks are ignored.
nl: Het Runes-protocol wordt geactiveerd bij blok 840.000. Runestones in eerdere blokken worden genegeerd.

source: Abstractly, runestones contain the following fields:
nl: In abstracte termen bevatten runestones de volgende velden:

source: Runes are created by etchings:
nl: Runes worden gecreëerd door etchings:

source: Which may contain mint terms:
nl: Die mint-voorwaarden kunnen bevatten:

source: Runes are transferred by edict:
nl: Runes worden overgedragen door middel van een edict:

source: Rune IDs are encoded as the block height and transaction index of the transaction in which the rune was etched:
nl: Rune-ID's worden gecodeerd als de blokhoogte en de transactie-index van de transactie waarin de rune werd geëtched:

source: Rune IDs are represented in text as `BLOCK:TX`.
nl: Rune-ID's worden in tekst weergegeven als `BLOCK:TX`.

source: Rune names are encoded as modified base-26 integers:
nl: Rune-namen worden gecodeerd als gemodificeerde base-26 gehele getallen:

source: Deciphering
nl: Ontcijferen

source: Runestones are deciphered from transactions with the following steps:
nl: Runestones worden ontcijferd uit transacties met de volgende stappen:

source: Find the first transaction output whose script pubkey begins with `OP_RETURN OP_13`.
nl: Vind de eerste transactie-output waarvan de script pubkey begint met `OP_RETURN OP_13`.

source: Concatenate all following data pushes into a payload buffer.
nl: Concateneer alle volgende data pushes in een payload-buffer.

source: Decode a sequence 128-bit [LEB128](https://en.wikipedia.org/wiki/LEB128) integers from the payload buffer.
nl: Decodeer een reeks van 128-bit [LEB128](https://en.wikipedia.org/wiki/LEB128) gehele getallen uit de payload-buffer.

source: Parse the sequence of integers into an untyped message.
nl: Parse de reeks van gehele getallen in een ongetypeerd bericht.

source: Parse the untyped message into a runestone.
nl: Parse het ongetypeerde bericht naar een runestone.

source: Deciphering may produce a malformed runestone, termed a [cenotaph](https://en.wikipedia.org/wiki/Cenotaph).
nl: Decoderen kan een onjuist gevormde runestone opleveren, genoemd een [cenotaph](https://en.wikipedia.org/wiki/Cenotaph).

source: Locating the Runestone Output
nl: Het vinden van de Runestone-output

source: Outputs are searched for the first script pubkey that beings with `OP_RETURN OP_13`. If deciphering fails, later matching outputs are not considered.
nl: Outputs worden doorzocht naar de eerste script pubkey die begint met `OP_RETURN OP_13`. Als het decoderen mislukt, worden latere overeenkomende outputs niet beschouwd.

source: Assembling the Payload Buffer
nl: Het payloadbuffer samenstellen
