Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: For more information about ordinal theory, check out the [FAQ](./faq.md) for an overview, the [BIP](https://github.com/ordinals/ord/blob/master/bip.mediawiki) for the technical details, and the [ord repo](https://github.com/ordinals/ord) for the `ord` wallet and block explorer.
ar: لمزيد من المعلومات حول نظرية أوردينال، تفضل بزيارة [الأسئلة الشائعة](./faq.md) للحصول على نظرة عامة، وال [BIP](https://github.com/ordinals/ord/blob/master/bip.mediawiki) للتفاصيل الفنية وال [ord repo](https://github.com/ordinals/ord) لمحفظة `أورد` ومستكشف الكتل.
nl: Voor meer informatie over de ordinal-theorie, bekijk de [FAQ](./faq.md) voor een overzicht, de [BIP](https://github.com/ordinals/ord/blob/master/bip.mediawiki) voor de technische details, en de [ord repo](https://github.com/ordinals/ord) voor de `ord` wallet en block explorer.

source: Satoshi was the original developer of ordinal theory. However, he knew that others would consider it heretical and dangerous, so he hid his knowledge, and it was lost to the sands of time. This potent theory is only now being rediscovered. You can help by researching rare satoshis.
ar: ساتوشي هو المطور الأصلي لنظرية أوردينال. ومع ذلك، كان يعلم أن آخرين سيعتبرونها هرطقة وخطيرة، لذلك أخفى معرفته،وضاعت هذه المعرفة في زمن النسيان. هذه النظرية الفعّالة تم اكتشافها من جديد فقط الآن. يمكنك المساعدة من خلال البحث عن الساتوشي النادرة.
nl: Satoshi was de oorspronkelijke ontwikkelaar van de ordinal-theorie. Hij wist echter dat anderen het als ketters en gevaarlijk zouden beschouwen, dus verstopte hij zijn kennis, die verloren raakte in de vergetelheid. Deze krachtige theorie wordt pas nu herontdekt. Je kunt helpen door zeldzame satoshi's te onderzoeken.

source: Good luck and godspeed!
ar: حظًا موفقًا!
nl: Veel succes en godspeed!

source: Send a sat whose ordinal number ends with a zero to the submission address:
ar: أرسل ساتوشي الذي يحمل رقم ترتيبي ينتهي بصفر إلى عنوان التقديم:
nl: Verstuur een satoshi wiens ordinalnummer eindigt op een nul naar het inzendadres:

source: The sat must be the first sat of the output you send.
ar: يجب أن يكون الساتوشي هو أول ساتوشي في الإخراج الذي ترسله.
nl: De satoshi moet de eerste satoshi van de output zijn die je verzendt.

source: Reward
ar: المكافأة
nl: Beloning

source: Claimed by [@count_null](https://twitter.com/rodarmor/status/1560793241473400833)!
ar: تم الاستحواذ عليها من قِبَل [@count_null](https://twitter.com/rodarmor/status/1560793241473400833)!
nl: Geclaimd door [@count_null](https://twitter.com/rodarmor/status/1560793241473400833)!

source: The transaction that submits a UTXO containing the oldest sat, i.e., that with the lowest number, amongst all submitted UTXOs will be judged the winner.
ar: سيتم اختيار الصفقة التي تقدم UTXO يحتوي على أقدم ساتوشي، أي الذي يحمل أقل رقم، من بين جميع الـ UTXO المقدمة كالفائزة.
nl: De transactie die een UTXO indient met de oudste sat, dat wil zeggen degene met het laagste nummer, van alle ingediende UTXO's zal worden beoordeeld als de winnaar.

source: The bounty is open for submissions until block 753984—the first block of difficulty adjustment period 374. Submissions included in block 753984 or later will not be considered.
ar: الجائزة متاحة للتقديم حتى الكتلة رقم 753984—، وهي أول كتلة في فترة ضبط الصعوبة رقم 374. لن يتم النظر في التقديمات المدرجة في الكتلة رقم 753984 أو فيما بعدها .
nl: De beloning staat open voor inzendingen tot blok 753984—het eerste blok van de moeilijkheidsaanpassingsperiode 374. Inzendingen die zijn opgenomen in blok 753984 of later zullen niet worden overwogen.

source: Claimed by [@ordinalsindex](https://twitter.com/rodarmor/status/1569883266508853251)!
ar: تم الاستحواذ عليها من قِبَل [@ordinalsindex](https://twitter.com/rodarmor/status/1569883266508853251)!
nl: Geclaimd door [@ordinalsindex](https://twitter.com/rodarmor/status/1569883266508853251)!

source: Send an <span class=uncommon>uncommon</span> sat to the submission address:
nl: Stuur een <span class=uncommon>ongewone</span> sat naar het inzendadres:

source: Confirm that the submission address has not received transactions before submitting your entry. Only the first successful submission will be rewarded.
ar: تأكد من أن عنوان التقديم لم يستقبل معاملات من قبل تقديم إدخالك. سيتم مكافأة التقديم الناجح الأول فقط.
nl: Bevestig dat het inzendadres geen transacties heeft ontvangen voordat je jouw inzending verstuurt. Alleen de eerste succesvolle inzending zal worden beloond.

source: Claimed by [@utxoset](https://twitter.com/rodarmor/status/1582424455615172608)!
ar: تم الاستحواذ عليها من قِبَل [@utxoset](https://twitter.com/rodarmor/status/1582424455615172608)!
nl: Geclaimd door [@utxoset](https://twitter.com/rodarmor/status/1582424455615172608)!

source: Ordinal bounty 3 has two parts, both of which are based on _ordinal names_. Ordinal names are a modified base-26 encoding of ordinal numbers. To avoid locking short names inside the unspendable genesis block coinbase reward, ordinal names get _shorter_ as the ordinal number gets _longer_. The name of sat 0, the first sat to be mined is `nvtdijuwxlp` and the name of sat 2,099,999,997,689,999, the last sat to be mined, is `a`.
ar: جائزة أوردينال 3 لها جزأين، وكليهما مستندان إلى أسماء أوردينالس._أسماء أوردينالس_. هي ترميز معدل بنظام الـ 26 استنادًا إلى أرقامهم . لتجنب قفل الأسماء القصيرة داخل مكافأة كوينبيس genesis block التي لا يمكن إنفاقها، تقصر أسماء Ordinal كلما زاد الرقم Ordinal في الطول. اسم السات 0، وهو أول سات تم تعدينه، هو `nvtdijuwxlp`، واسم سات 2,099,999,997,689,999، وهو آخر سات سيتم تعدينه، هو `a`.
nl: Ordinal bounty 3 bestaat uit twee delen, die beide zijn gebaseerd op _ordinale namen_. Ordinale namen zijn een aangepaste base-26 codering van ordinale nummers. Om te voorkomen dat korte namen vast komen te zitten in de niet-besteedbare genesisblok coinbase-beloning, worden ordinale namen _korter_ naarmate het ordinale nummer _langer_ wordt. De naam van sat 0, de eerste sat die gemijnd werd, is `nvtdijuwxlp` en de naam van sat 2.099.999.997.689.999, de laatste sat die gemijnd zal worden, is `a`.

source: The bounty is open for submissions until block 840000—the first block after the fourth halving. Submissions included in block 840000 or later will not be considered.
nl: De beloning staat open voor inzendingen tot blok 840000—het eerste blok na de vierde halvering. Inzendingen die zijn opgenomen in blok 840000 of later zullen niet worden overwogen.

source: Both parts use [frequency.tsv](frequency.tsv), a list of words and the number of times they occur in the [Google Books Ngram dataset](http://storage.googleapis.com/books/ngrams/books/datasetsv2.html). filtered to only include the names of sats which will have been mined by the end of the submission period, that appear at least 5000 times in the corpus.
ar: كلا الجزءين يستخدمان [frequency.tsv](frequency.tsv)، وهو قائمة بالكلمات وعدد المرات التي تظهر في [Google Books Ngram dataset](http://storage.googleapis.com/books/ngrams/books/datasetsv2.html). حيث تم تصفيتها لتشمل فقط أسماء الساتوشي التي سيتم تعدينها بحلول نهاية فترة التقديم، والتي تظهر على الأقل 5000 مرة في النصوص.
nl: Beide delen gebruiken [frequency.tsv](frequency.tsv), een lijst met woorden en het aantal keren dat ze voorkomen in de [Google Books Ngram dataset](http://storage.googleapis.com/books/ngrams/books/datasetsv2.html). Deze lijst is gefilterd om alleen de namen van sats op te nemen die tegen het einde van de inzendperiode gemijnd zullen zijn, en die ten minste 5000 keer in de corpus voorkomen.

source: `frequency.tsv` is a file of tab-separated values. The first column is the word, and the second is the number of times it appears in the corpus. The entries are sorted from least-frequently occurring to most-frequently occurring.
ar: ملف `frequency.tsv` هو ملف يحتوي على قيم مفصولة بعلامات التبويب. العمود الأول هو الكلمة، والعمود الثاني هو عدد مرات ظهورها في النص. القيم مرتبة من أقل تكرار إلى أعلى تكرار.
nl: `frequency.tsv` is een bestand met door tabs gescheiden waarden. De eerste kolom bevat het woord, en de tweede kolom geeft aan hoe vaak het voorkomt in de corpus. De vermeldingen zijn gesorteerd van minst-frequent voorkomende tot meest-frequent voorkomende.

source: `frequency.tsv` was compiled using [this program](https://github.com/casey/onegrams).
ar: تم تجميع `frequency.tsv` باستخدام هذا [this program](https://github.com/casey/onegrams).
nl: `frequency.tsv` is samengesteld met behulp van [dit programma](https://github.com/casey/onegrams).

source: To search an `ord` wallet for sats with a name in `frequency.tsv`, use the following [`ord`](https://github.com/ordinals/ord) command:
ar: للبحث في محفظة ord عن ساتوشي بأسماء موجودة في `frequency.tsv`، استخدم أمر [`ord`](https://github.com/ordinals/ord) التالي:
nl: Om een `ord`-wallet te doorzoeken naar sats met een naam in `frequency.tsv`, gebruik je de volgende [`ord`](https://github.com/ordinals/ord) opdracht:

source: This command requires the sat index, so `--index-sats` must be passed to ord when first creating the index.
ar: هذا الأمر يتطلب فهرسة الساتوشي، لذا يجب تمرير`index-sats--` إلى ord عند إنشاء الفهرس للمرة الأولى.
nl: Deze command vereist de sat-index, dus `--index-sats` moet worden meegegeven aan ord bij het eerste aanmaken van de index.

source: Part 0
ar: الجزء 0
nl: Deel 0

source: _Rare sats pair best with rare words._
ar: _السات النادر يتناسب مع الكلمات النادرة._
nl: _Zeldzame sats passen het beste bij zeldzame woorden._

source: The transaction that submits the UTXO containing the sat whose name appears with the lowest number of occurrences in `frequency.tsv` shall be the winner of part 0.
ar: سيكون الفائز في الجزء 0 هو التقديم الذي يحتوي على ساتوشي مع اسم يظهر بأدنى عدد من المرات في `frequency.tsv.`.
nl: De transactie die de UTXO indient met de sat waarvan de naam het laagste aantal voorkomens heeft in `frequency.tsv` zal de winnaar van deel 0 zijn.

source: Part 1
ar: الجزء 1
nl: Deel 1

source: _Popularity is the font of value._
ar: _الشهره هي مصدر القيمة._
nl: _Populariteit is de bron van waarde._

source: The transaction that submits the UTXO containing the sat whose name appears with the highest number of occurrences in `frequency.tsv` shall be the winner of part 1.
ar: سيكون الفائز في الجزء 1 هو التقديم الذي يحتوي على ساتوشي مع اسم يظهر بأعلى عدد من المرات في`frequency.tsv`.
nl: De transactie die de UTXO indient met de sat waarvan de naam het hoogste aantal voorkomens heeft in `frequency.tsv` zal de winnaar van deel 1 zijn.

source: Tie Breaking
ar: التعادل
nl: Tiebreaker

source: In the case of a tie, where two submissions occur with the same frequency, the earlier submission shall be the winner.
ar: في حالة التعادل، حيث يتم التقديم بنفس التكرار، سيتم اعتبار المقدم الأول كفائز.
nl: In het geval van een gelijkspel, waarbij twee inzendingen dezelfde frequentie hebben, zal de vroegere inzending de winnaar zijn.

source: Part 0: 200,000 sats
ar: الجزء 0: 200,000 ساتس
nl: Parte 0: 200,000 satoshis

source: Part 1: 200,000 sats
ar: الجزء 1: 200,000 ساتس
nl: Parte 1: 200,000 sats

source: Unclaimed!
ar: لم يتم الاستحواذ عليها!
nl: Ongeclaimd!

source: _This guide is out of date. Since it was written, the `ord` binary was changed to only build the full satoshi index when the `--index-sats` flag is supplied. Additionally, `ord` now has a built-in wallet that wraps a Bitcoin Core wallet. See `ord wallet --help`._
ar: هذا الدليل غير محدّث. منذ كتابته، تم تغيير البرنامج `ord` الثنائي لبناء فهرس الساتوشي الكامل فقط عندما يتم توفير `ord` ,`--index-sats` الآن يحتوي على محفظة مدمجة تلتف حول محفظة بيتكوين الأساسية. راجع `ord wallet --help`._
nl: _Deze gids is verouderd. Sinds deze is geschreven, is de `ord`-binary veranderd zodat de volledige satoshi-index alleen wordt opgebouwd wanneer de `--index-sats`-vlag wordt meegegeven. Bovendien heeft `ord` nu een ingebouwde wallet die een Bitcoin Core-wallet omhult. Zie `ord wallet --help`._

source: Wait for it to finish indexing.
ar: انتظر حتى انتهاء عملية الفهرسة.
nl: Wacht tot de indexering is voltooid.

source: ```sh bitcoin-cli createwallet foo-watch-only true true ```
nl: ```sh bitcoin-cli createwallet foo-solo-lectura true true ```

source: ```sh bitcoin-cli loadwallet foo-watch-only ```
nl: ```sh bitcoin-cli loadwallet foo-solo-lectura ```

source: Sparrow Wallet
ar: محفظة سباروو

source: For more details on inscriptions, see [inscriptions](wallet.md).
ar: لمزيد من التفاصيل حول الإنسكريبشين، راجع [inscriptions](wallet.md).

source: Links
ar: روابط

source: Videos
ar: فيديوهات

source: `uncommon`: 745,855
ar: `غير شائع`: 745,855

source: `OP_PUSH 1` indicates that the next push contains the content type, and `OP_PUSH 0` indicates that subsequent data pushes contain the content itself. Multiple data pushes must be used for large inscriptions, as one of taproot's few restrictions is that individual data pushes may not be larger than 520 bytes.
ar: مثال `OP_PUSH 1` يشير إلى أن الدفعة التالية تحتوي على نوع المحتوى، و `OP_PUSH 0` يشير إلى أن الدفعات البيانية التالية تحتوي على المحتوى نفسه. يجب استخدام دفعات البيانات المتعددة للكتابات الكبيرة، حيث أن إحدى القيود القليلة في taproot هي أن دفعات البيانات الفردية لا يمكن أن تكون أكبر من 520 bytes.

source: The inscription content is contained within the input of a reveal transaction, and the inscription is made on the first sat of its input. This sat can then be tracked using the familiar rules of ordinal theory, allowing it to be transferred, bought, sold, lost to fees, and recovered.
ar: يتم تضمين محتوى الأنسكريبشين داخل مدخل عملية الكشف، وتتم الكتابة على أول ساتوشي في المدخل. يمكن بعد ذلك تتبع هذا الساتوشي باستخدام قواعد نظرية أوردينال المعتادة، مما يسمح بنقله، وشرائه، وبيعه، وفقده بسبب الرسوم، واستعادته.

source: Content
ar: المحتوى

source: Currently, the only defined field is `content-type`, with a tag of `1`, whose value is the MIME type of the body.
ar: حاليًا، الحقل المعرف الوحيد `content-type`, بعلامة `1 `، والذي قيمته نوع MIME للهيكل.

source: Sandboxing
ar: عزل البيئة

source: An important exception to [sandboxing](../inscriptions.md#sandboxing) is recursion: access to `ord`'s `/content` endpoint is permitted, allowing inscriptions to access the content of other inscriptions by requesting `/content/<INSCRIPTION_ID>`.
ar: إستثناء مهم من تطبيق البيئة العازلة[sandboxing](../inscriptions.md#sandboxing)هو التكرار recursion: يُسمح بالوصول إلى نقطة النهاية `ord`'s `/content`، مما يتيح inscription الوصول إلى محتوى inscription آخر من خلال طلب`/content/<INSCRIPTION_ID>`.

source: This has a number of interesting use-cases:
ar: العديد من الاستخدامات المثيرة للاهتمام:

source: A few other endpoints that inscriptions may access are the following:
ar: نقاط أخرى التي يمكن الإنسكريبشين الوصول إليها هي كما يلي:

source: Ordinal Theory FAQ
ar: الأسئلة الشائعة لنظرية أوردينال

source: Ethereum NFTs?
ar: إيثريوم (NFTs)؟

source: Counterparty assets?
ar: أصول Counterparty؟

source: Artists
ar: الفنانين

source: Bitcoiners
ar: البيتكوينير

source: Ordinal Explorer
ar: متصفح أوردينال

source: The `ord` binary includes a block explorer. We host a instance of the block explorer on mainnet at [ordinals.com](https://ordinals.com), and on signet at [signet.ordinals.com](https://signet.ordinals.com).
ar: يتضمن البرنامج الثنائي للأورد إكسبلورر كتل. نحن نستضيف مثيلًا من إكسبلورر الكتل على الشبكة الرئيسية على موقع [أوردينالs.com](https://أوردينالs.com/)، وعلى شبكة الاختبار signet على موقع [signet.أوردينالs.com](https://signet.أوردينالs.com/).

source: To test how your inscriptions will look you can run:
ar: لاختبار كيف سيبدو الإنسكريبشين يمكنك إضافة الأمر التالي:

source: Blocks
ar: بلوكس

source: Outputs
ar: المخرجات

source: Transaction outputs can searched by outpoint, for example, the only output of the genesis block coinbase transaction:
ar: البحث عن مخرجات المعاملات عبر نقطة الإخراج Outputs، على سبيل المثال، الناتج الوحيد لمعاملة العملات النقدية في block genesis :

source: Sats
ar: الساتس

source: Ordinal Inscription Guide
ar: دليل صناعه الأوردينال

source: This guide does not cover installing Bitcoin Core in detail. Once Bitcoin Core is installed, you should be able to run `bitcoind -version` successfully from the command line.
ar: لا يتضمن هذا الدليل تفاصيل تثبيت Bitcoin Core بالتفصيل. بمجرد تثبيت Bitcoin Core، يجب أن تتمكن من تشغيل bitcoind -version بنجاح من أوامر الجهاز.

source: `ord` requires Bitcoin Core's transaction index.
ar: تتطلب `ord` فهرس المعاملات الخاص بـ Bitcoin Core.

source: Creating a Bitcoin Core Wallet
ar: إنشاء محفظة بيتكوين كور

source: `ord` uses Bitcoin Core to manage private keys, sign transactions, and broadcast transactions to the Bitcoin network.
ar: أورد `ord` يستخدم بيتكوين كور ليدير المفاتيح الخاصة وتواقيع المعاملات وإرسالها الى شبكه البيتكوين.

source: To create a Bitcoin Core wallet named `ord` for use with `ord`, run:
ar: لإنشاء محفظة Bitcoin Core تحمل اسم `ord` واستخدامها, اعطي الأمر:

source: And when you visit [the ordinals explorer](https://ordinals.com/) at `ordinals.com/inscription/INSCRIPTION_ID`.
ar: وعند زيارتك [the ordinals explorer](https://ordinals.com/) على `ordinals.com/inscription/INSCRIPTION_ID`.

source: Once the send transaction confirms, you can can confirm receipt by running:
ar: بمجرد تأكيد المعاملة المرسلة، يمكن للمستلم تأكيد الاستلام عن طريق الأمر :

source: Run `RUST_LOG=info ord index`. It should connect to your bitcoin core node and start indexing.
ar: قم بتشغيل الأمر `RUST_LOG=info ord index`. يجب أن يتصل بنود Bitcoin Core الخاص بك ويبدأ عملية الفهرسة.

source: The `ord` wallet supports transferring specific satoshis. You can also use `bitcoin-cli` commands `createrawtransaction`, `signrawtransactionwithwallet`, and `sendrawtransaction`, how to do so is complex and outside the scope of this guide.
ar: محفظة `ord` تدعم نقل الساتوشيات الخاصة. يمكنك أيضًا استخدام أوامر `bitcoin-cli` مثل `createrawtransaction` و `signrawtransactionwithwallet` و `sendrawtransaction` للقيام بذلك، وكيفية القيام بذلك هو معقد وخارج نطاق هذا الدليل.

source: For details on setting up Bitcoin Core and the `ord` wallet check out the [Inscriptions Guide](../inscriptions.md)
ar: للحصول على التفاصيل حول إعداد Bitcoin Core ومحفظة `ord`، تحقق من دليل[Inscriptions Guide](../inscriptions.md)

source: Bitcoin's UTXO model
ar: نموذج UTXO في البيتكوين

source: Most `ord` commands in [inscriptions](wallet.md) and [explorer](explorer.md) can be run with the following network flags:
ar: معظم أوامر `ord` في [inscriptions](wallet.md) و[explorer](explorer.md) يمكن تشغيلها باستخدام الأعلام الشبكية التالية:

source: Regtest doesn't require downloading the blockchain or indexing ord.
ar: رغ تيست (Regtest) لا يتطلب تنزيل سلسلة الكتل/البلوكشين أو فهرسه الأورد.

source: Run bitcoind in regtest with:
ar: تشغيل `bitcoind` في وضع الاختبار المحلي باستخدام الأمر:

source: View the inscription in the regtest explorer:
ar: أعرض الإنسكريبشين باستخدام الأمر:

source: When testing out [recursion](../inscriptions/recursion.md), inscribe the dependencies first (example with [p5.js](https://p5js.org):
ar: عند اختبار [التكرار](../inscriptions/recursion.md)، قم بتسجيل الاعتمادات أولاً (مثال باستخدام [p5.js](https://p5js.org):

source: This should return a `inscription_id` which you can then reference in your recursive inscription.
ar: سيعيد هذا `inscription_id` الذي يمكنك بعد ذلك الرجوع إليه في الإنسكريبشين لتكراري.

source: ATTENTION: These ids will be different when inscribing on mainnet or signet, so be sure to change those in your recursive inscription for each chain.
ar: تنبيه: سيكون هذه الهويات مختلفة عندما تكون الإنسكريبشين على شبكة mainnet أو signet ، لذا تأكد من تغييرها في تسجيلك التكراري لكل سلسلة.

source: Sometimes the `ord` database must be reindexed, which means deleting the database and restarting the indexing process with either `ord index run` or `ord server`. Reasons to reindex are:
ar: أحيانًا يجب إعادة فهرسة قاعدة البيانات `ord`، مما يعني حذف قاعدة البيانات وإعادة بدء عملية الفهرسة مرة أخرى باستخدام إما `ord index run` أو `ord server`. الأسباب التي تستدعي القيام بعملية إعادة الفهرسة تشمل:

source: You can of course also set the location of the data directory yourself with `ord --data-dir <DIR> index run` or give it a specific filename and path with `ord --index <FILENAME> index run`.
ar: بالطبع، يمكنك أيضًا تعيين موقع دليل البيانات بنفسك باستخدام الأمر `ord --data-dir <DIR> index run` أو تحديد اسم ملف ومسار محدد باستخدام `ord --index <FILENAME> index run`. هذا سيسمح لك بتحديد مكان قاعدة البيانات أو اسم الملف حسب الحاجة.

source: Ordinal Bounty 0
ar: جائزة أوردينال 0

source: Criteria
ar: الشروط

source: Submission Address
ar: عنوان التقديم

source: Status
ar: الحالة

source: Ordinal Bounty 1
ar: جائزة أوردينال 1

source: Ordinal Bounty 2
ar: جائزة أوردينال 2

source: Ordinal Bounty 3
ar: جائزة أوردينال 3

source: The bounty is open for submissions until block 840000—the first block after the fourth halvening. Submissions included in block 840000 or later will not be considered.
ar: الجائزة متاحة للتقديم حتى الكتلة رقم 840000 - أول كتلة بعد الحدث التقسيمي الرابع. لن يتم النظر في التقديمات التي تم تضمينها في الكتلة 840000 أو بعد ذلك.

source: Total: 400,000 sats
ar: الإجمالي: 400,000 ساتس
