Repository: bestinslot-xyz/OPI
Catalog: ord/docs/po/*.po
Languages: ar, nl

source: Odd tags are used for fields which do not affect creation, initial assignment, or transfer, such as additional metadata, and thus are safe to ignore.
ar: تُستخدم العلامات الفردية للحقول التي لا تؤثر على إنشاء الأنسكريبشين، وتعيينه الأولي، أو نقله، مثل البيانات الوصفية الإضافية، وبالتالي يمكن تجاهلها بأمان.
nl: Oneven labels worden gebruikt voor velden die geen invloed hebben op de creatie, initiële toewijzing of overdracht, zoals extra metadata, en kunnen daarom worden genegeerd.

source: Inscription IDs
ar: مُعرفات الانسكريبشين
nl: IDs van inscripties

source: The inscriptions are contained within the inputs of a reveal transaction. In order to uniquely identify them they are assigned an ID of the form:
ar: تتمثل الأنسكريبشين في المدخلات (inputs) لعملية الكشف (reveal) التي تعلن الأنسكريبشين. لتحديد هويتها بشكل فريد، يتم تعيينها بمعرف بالشكل التالي:
nl: Inscripties worden opgeslagen in de invoeren van een onthullingstransactie. Ze krijgen een ID toegewezen zoals dit:

source: The part in front of the `i` is the transaction ID (`txid`) of the reveal transaction. The number after the `i` defines the index (starting at 0) of new inscriptions being inscribed in the reveal transaction.
ar: الجزء الذي يسبق الـ `i` هو معرف المعاملة (`txid`) لعملية الكشف. العدد بعد الـ `i` يحدد المؤشر (بدءًا من 0) الأنسكريبشين الجديدة التي يتم تدوينها في عملية الكشف.
nl: Het deel vóór de `i` is de transacte-ID (`txid`) van de onthullingstransactie. Het nummer na de `i` is de index (beginnend bij 0) van de nieuwe inscripties die in de onthullingstransactie worden ingeschreven.

source: Inscriptions can either be located in different inputs, within the same input or a combination of both. In any case the ordering is clear, since a parser would go through the inputs consecutively and look for all inscription `envelopes`.
ar: يمكن أن تكون الأنسكريبشينس موجودة إما في مدخلات مختلفة، داخل نفس المدخل أو مزيجًا من الاثنين. في أي حالة، الترتيب واضح، حيث يتابع جهاز تحليل البيانات المدخلات ويبحث عن جميع أظرف الأنسكريبشينس`envelopes`.
nl: Inscripties kunnen zich in verschillende invoeren bevinden, binnen dezelfde invoer of in een combinatie van beide. In beide gevallen is de volgorde duidelijk, aangezien een parser de invoeren achtereenvolgens zou doorlopen op zoek naar de `omslagen` van de inscripties.

source: Input
nl: Invoer

source: Inscription Count
nl: Aantal Inscripties

source: Indices
nl: Index

source: i0, i1
nl: i0, il

source: Inscription Numbers
nl: Inscriptie-nummers

source: Inscriptions are assigned inscription numbers starting at zero, first by the order reveal transactions appear in blocks, and the order that reveal envelopes appear in those transactions.
nl: Inscripties krijgen inscriptienummers, beginnend bij nul, op basis van de volgorde waarin ze in de transacties verschijnen.

source: Due to a historical bug in `ord` which cannot be fixed without changing a great many inscription numbers, inscriptions which are revealed and then immediately spent to fees are numbered as if they appear last in the block in which they are revealed.
nl: Vanwege een historische fout in ord die niet kan worden gecorrigeerd zonder een groot aantal inscriptienummers te veranderen, worden inscripties die worden onthuld en vervolgens onmiddellijk worden besteed aan kosten, genummerd alsof ze aan het einde van het blok verschijnen waarin ze worden onthuld.

source: Inscriptions which are cursed are numbered starting at negative one, counting down. Cursed inscriptions on and after the jubilee at block 824544 are vindicated, and are assigned positive inscription numbers.
nl: Inscripties die als cursed zijn gemarkeerd, ontvangen inscriptienummers beginnend vanaf min één en dalend. Die inscripties die sinds het jubileum in blok 824544 als cursed zijn gemarkeerd, worden geredempt en krijgen positieve inscriptienummers toegewezen.

source: HTML and SVG inscriptions are sandboxed in order to prevent references to off-chain content, thus keeping inscriptions immutable and self-contained.
ar: يتم عزل الأنسكريبشين HTML و SVG من أجل منع الإشارات إلى المحتوى الخارجي على الشبكة، وبالتالي الحفاظ على الأنسكريبشين بلا تغيير ومكتملة ذاتياً.
nl: Inscripties in HTML en SVG zijn beperkt tot een geïsoleerde omgeving die sandboxing wordt genoemd om verwijzingen naar inhoud buiten de keten te voorkomen, waardoor de inscripties onveranderlijk en ingesloten blijven binnen de omgeving.

source: This is accomplished by loading HTML and SVG inscriptions inside `iframes` with the `sandbox` attribute, as well as serving inscription content with `Content-Security-Policy` headers.
ar: يتم تحقيق ذلك من خلال تحميل HTML و SVG انسكريبشين داخل `iframes` مع صفة `sandbox`، بالإضافة إلى تقديم محتوى انسكريبشين باستخدام `Content-Security-Policy` .
nl: Dit wordt bereikt door de inscripties in HTML en SVG te laden binnen `iframes` met het `sandbox`-attribuut en door `Content-Security-Policy` aan de headers toe te voegen.

source: Self-Reference
nl: Autorreferentie

source: The content of the inscription with ID `INSCRIPTION_ID` must served from the URL path `/content/<INSCRIPTION_ID>`.
nl: De inhoud die hoort bij de inscriptie geïdentificeerd door het ID `INSCRIPTION_ID` moet beschikbaar zijn via de URL-route `/content/<INSCRIPTION_ID>`.

source: This allows inscriptions to retrieve their own inscription ID with:
nl: Dit maakt het mogelijk dat de inscripties hun eigen inscriptienummer verkrijgen met behulp van:

source: If an inscription with ID X delegates to an inscription with ID Y, that is to say, if inscription X contains a delegate field with value Y, the content of inscription X must be served from the URL path `/content/X`, _not_ `/content/Y`.
nl: Als een inscriptie met ID X delegeert aan een inscriptie met ID Y, dat wil zeggen, als inscriptie X een delegate-veld bevat met waarde Y, moet de inhoud van inscriptie X worden weergegeven via de URL-pad `/content/X`, _niet_ `/content/Y`.

source: This allows delegating inscriptions to use their own inscription ID as a seed for generative delegate content.
nl: Dit maakt het mogelijk voor delegeerende inscripties om hun eigen inscriptienummer te gebruiken als basis voor generatieve delegate-inhoud.

source: Previously inscribed sats can be reinscribed with the `--reinscribe` command if the inscription is present in the wallet. This will only append an inscription to a sat, not change the initial inscription.
nl: Satoshis die eerder zijn geïnscribeerd kunnen worden gereinscribed met het commando `--reinscribe` als de inscriptie aanwezig is in de portemonnee. Dit voegt alleen een extra inscriptie toe aan een satoshi, zonder de oorspronkelijke inscriptie te wijzigen.

source: Reinscribe with satpoint: `ord wallet inscribe --fee-rate <FEE_RATE> --reinscribe --file <FILE> --satpoint <SATPOINT>`
nl: Reinscribe met satpoint: `ord wallet inscribe --fee-rate <FEE_RATE> --reinscribe --file <FILE> --satpoint <SATPOINT>`

source: Reinscribe on a sat (requires sat index): `ord --index-sats wallet inscribe --fee-rate <FEE_RATE> --reinscribe --file <FILE> --sat <SAT>`
nl: Reinscribe op een sat (vereist sat-index): `ord --index-sats wallet inscribe --fee-rate <FEE_RATE> --reinscribe --file <FILE> --sat <SAT>`

source: Inscriptions may nominate a delegate inscription. Requests for the content of an inscription with a delegate will instead return the content, content type and content encoding of the delegate. This can be used to cheaply create copies of an inscription.
nl: Inscripties kunnen een gedelegeerde inscriptie nomineren. Als de inhoud van een inscriptie die een delegatie heeft wordt opgevraagd, retourneert deze de inhoud, het type inhoud en de codering van de inhoud van de gedelegeerde inscriptie. Dit kan worden gebruikt om op een kostenefficiënte manier kopieën van een inscriptie te maken.

source: To create an inscription I with delegate inscription D:
nl: Om een inscriptie I met een gedelegeerde inscriptie D te maken:

source: Create an inscription D. Note that inscription D does not have to exist when making inscription I. It may be inscribed later. Before inscription D is inscribed, requests for the content of inscription I will return a 404.
nl: Creëer een inscriptie D. Houd er rekening mee dat inscriptie D niet hoeft te bestaan op het moment van het creëren van inscriptie I. Deze kan later worden ingeschreven. Voordat inscriptie D is ingeschreven, zullen verzoeken voor de inhoud van inscriptie I een foutmelding 404 retourneren.

source: Include tag `11`, i.e. `OP_PUSH 11`, in I, with the value of the serialized binary inscription ID of D, serialized as the 32-byte `TXID`, followed by the four-byte little-endian `INDEX`, with trailing zeroes omitted.
nl: Voeg aan I de tag `11` toe, dat wil zeggen, `OP_PUSH 11`, met de waarde van de geserialiseerde binaire inscriptie-ID van D, geserialiseerd met een TXID van 32 bytes, gevolgd door de `INDEX` van vier bytes in little-endian formaat, waarbij de nullen aan het einde worden weggelaten.

source: _NB_ The bytes of a bitcoin transaction ID are reversed in their text representation, so the serialized transaction ID will be in the opposite order.
nl: _NB_ De bytes van een Bitcoin-transactie-ID zijn omgekeerd in hun tekstuele weergave, zodat de geserialiseerde transactie-ID in de tegenovergestelde volgorde zal zijn.

source: Example
ar: مثال
nl: Voorbeeld

source: An example of an inscription which delegates to `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi0`:
nl: Een voorbeeld van een inscriptie die delegeert naar een andere inscriptie zou er als volgt uit kunnen zien `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi0`:

source: Note that the value of tag `11` is decimal, not hex.
nl: We merken op dat de waarde van de tag `11` in decimale vorm is en niet in hexadecimale vorm.

source: The delegate field value uses the same encoding as the parent field. See [provenance](provenance.md) for more examples of inscription ID encodings;
nl: De waarde van het gedelegeerde veld gebruikt dezelfde codering als het ouderveld. Raadpleeg [proveniencia](provenance.md) voor meer voorbeelden van coderingen van inscriptie-ID's;

source: Inscriptions may include [CBOR](https://cbor.io/) metadata, stored as data pushes in fields with tag `5`. Since data pushes are limited to 520 bytes, metadata longer than 520 bytes must be split into multiple tag `5` fields, which will then be concatenated before decoding.
nl: Inscripties kunnen [CBOR](https://cbor.io/) metadata bevatten, opgeslagen als datapunten in velden met tag `5`. Aangezien datapunten beperkt zijn tot 520 bytes, moet metadata langer dan 520 bytes worden opgesplitst in meerdere tag `5` velden, die vervolgens worden samengevoegd voordat ze worden gedecodeerd.

source: Metadata is human readable, and all metadata will be displayed to the user with its inscription. Inscribers are encouraged to consider how metadata will be displayed, and make metadata concise and attractive.
nl: Metadata is leesbaar voor mensen en alle metadata wordt samen met de inscriptie aan de gebruiker getoond. Inschrijvers worden aangemoedigd om te overwegen hoe metadata zal worden weergegeven, en om metadata beknopt en aantrekkelijk te maken.

source: Metadata is rendered to HTML for display as follows:
nl: Metadata wordt als volgt naar HTML omgezet:

source: `null`, `true`, `false`, numbers, floats, and strings are rendered as plain text.
nl: `null`, `true`, `false`, Getallen, floats en strings worden weergegeven als platte tekst.

source: Byte strings are rendered as uppercase hexadecimal.
nl: Byte-strings worden weergegeven als hexadecimale tekst in hoofdletters.

source: Arrays are rendered as `<ul>` tags, with every element wrapped in `<li>` tags.
nl: Arrays worden weergegeven als `<ul>`-tags, waarbij elk element is ingepakt in `<li>`-tags.

source: Maps are rendered as `<dl>` tags, with every key wrapped in `<dt>` tags, and every value wrapped in `<dd>` tags.
nl: Kaarten worden weergegeven als `<dl>`-tags, waarbij elke sleutel is ingepakt in `<dt>`-tags en elke waarde in `<dd>`-tags.

source: Tags are rendered as the tag , enclosed in a `<sup>` tag, followed by the value.
nl: Tags worden weergegeven als de tag, ingesloten in een `<sup>`-tag, gevolgd door de waarde.

source: CBOR is a complex spec with many different data types, and multiple ways of representing the same data. Exotic data types, such as tags, floats, and bignums, and encoding such as indefinite values, may fail to display correctly or at all. Contributions to `ord` to remedy this are welcome.
nl: CBOR is een complexe specificatie met veel verschillende datatypen en meerdere manieren om dezelfde gegevens weer te geven. Exotische datatypen, zoals tags, floats en bignums, en coderingen zoals onbepaalde waarden, kunnen mogelijk niet correct of helemaal niet worden weergegeven. Bijdragen aan `ord` om dit te verbeteren, zijn welkom.

source: Since CBOR is not human readable, in these examples it is represented as JSON. Keep in mind that this is _only_ for these examples, and JSON metadata will _not_ be displayed correctly.
nl: Aangezien CBOR niet leesbaar is voor mensen, wordt het in deze voorbeelden weergegeven als JSON. Houd er rekening mee dat dit _alleen_ voor deze voorbeelden is, en dat JSON-metadata _niet_ correct zal worden weergegeven.

source: The metadata `{"foo":"bar","baz":[null,true,false,0]}` would be included in an inscription as:
nl: De metadata {"foo":"bar","baz":[null,true,false,0]} zou in een inscriptie worden opgenomen als:

source: And rendered as:
nl: En weergegeven als:

source: Metadata longer than 520 bytes must be split into multiple fields:
nl: Metadata langer dan 520 bytes moet worden opgesplitst in meerdere velden:

source: Which would then be concatenated into `{"very":"long","metadata":"is","finally":"done"}`.
nl: Die vervolgens zou worden samengevoegd tot `{"very":"long","metadata":"is","finally":"done"}`.

source: In order to make an inscription on a sat other than the first of its input, a zero-based integer, called the "pointer", can be provided with tag `2`, causing the inscription to be made on the sat at the given position in the outputs. If the pointer is equal to or greater than the number of total sats in the outputs of the inscribe transaction, it is ignored, and the inscription is made as usual. The value of the pointer field is a little endian integer, with trailing zeroes ignored.
nl: Om een inscriptie te maken op een satoshi die niet de eerste is van de invoer, kan een nulgebaseerd geheel getal, de "pointer" genoemd, worden opgegeven met tag `2`. Dit zorgt ervoor dat de inscriptie wordt gemaakt op de satoshi op de opgegeven positie in de outputs. Als de pointer gelijk is aan of groter dan het totale aantal sats in de outputs van de inscriptietransactie, wordt de pointer genegeerd en wordt de inscriptie op de gebruikelijke manier gemaakt. De waarde van het pointer-veld is een little-endian geheel getal, waarbij de nullen aan het einde worden genegeerd.

source: An even tag is used, so that old versions of `ord` consider the inscription to be unbound, instead of assigning it, incorrectly, to the first sat.
nl: Een even tag wordt gebruikt, zodat oude versies van `ord` de inscriptie als onbeheerd beschouwen, in plaats van deze onterecht toe te wijzen aan de eerste sat.

source: This can be used to create multiple inscriptions in a single transaction on different sats, when otherwise they would be made on the same sat.
nl: Dit kan worden gebruikt om meerdere inscripties in één transactie op verschillende sats te maken, terwijl ze anders op dezelfde sat zouden worden gemaakt.

source: Examples
nl: Voorbeelden

source: An inscription with pointer 255:
nl: Een inscriptie met pointer 255:

source: An inscription with pointer 256:
nl: Een inscriptie met pointer 256:

source: An inscription with pointer 256, with trailing zeroes, which are ignored:
nl: Een inscriptie met pointer 256, waarbij de nullen aan het einde worden genegeerd:

source: The owner of an inscription can create child inscriptions, trustlessly establishing the provenance of those children on-chain as having been created by the owner of the parent inscription. This can be used for collections, with the children of a parent inscription being members of the same collection.
nl: De eigenaar van een inscriptie kan kindinscripties maken, waarmee op een betrouwbare manier de herkomst van die kinderen on-chain wordt vastgesteld als zijnde gemaakt door de eigenaar van de ouderinscriptie. Dit kan worden gebruikt voor collecties, waarbij de kinderen van een ouderinscriptie leden van dezelfde collectie zijn.

source: Children can themselves have children, allowing for complex hierarchies. For example, an artist might create an inscription representing themselves, with sub inscriptions representing collections that they create, with the children of those sub inscriptions being items in those collections.
nl: Kinderen kunnen zelf ook weer kinderen hebben, waardoor complexe hiërarchieën mogelijk worden. Bijvoorbeeld, een artiest kan een inscriptie maken die zichzelf vertegenwoordigt, met sub-inscripties die collecties vertegenwoordigen die ze maken, waarbij de kinderen van die sub-inscripties items in die collecties zijn.

source: To create a child inscription C with parent inscription P:
nl: Om een kindinscriptie C te maken met ouderinscriptie P:

source: Create an inscribe transaction T as usual for C.
nl: Maak een inscriptietransactie T aan zoals gebruikelijk voor C.

source: Spend the parent P in one of the inputs of T.
nl: Besteed de ouderinscriptie P in een van de invoeren van T.

source: Include tag `3`, i.e. `OP_PUSH 3`, in C, with the value of the serialized binary inscription ID of P, serialized as the 32-byte `TXID`, followed by the four-byte little-endian `INDEX`, with trailing zeroes omitted.
nl: Voeg tag `3` toe, d.w.z. `OP_PUSH 3`, aan C, met de waarde van de geserialiseerde binaire inscriptie-ID van P, geserialiseerd als de 32-byte `TXID`, gevolgd door de vier-byte little-endian `INDEX`, waarbij de nullen aan het einde worden weggelaten.

source: An example of a child inscription of `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi0`:
nl: Een voorbeeld van een kindinscriptie van `00102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi0`:

source: Note that the value of tag `3` is binary, not hex, and that for the child inscription to be recognized as a child, `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi0` must be spent as one of the inputs of the inscribe transaction.
nl: Let op dat de waarde van tag `3` binair is, niet hexadecimaal, en dat om de kindinscriptie als kind te laten herkennen, `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi0` moet worden besteed als een van de invoeren van de inscriptietransactie.

source: Example encoding of inscription ID `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi255`:
nl: Voorbeeldcodering van inscriptie-ID: `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi255`:

source: And of inscription ID `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi256`:
nl: En van inscriptie-ID `000102030405060708090a0b0c0d0e0f101112131415161718191a1b1c1d1e1fi256`:

source: Notes
nl: Notities

source: The tag `3` is used because it is the first available odd tag. Unrecognized odd tags do not make an inscription unbound, so child inscriptions would be recognized and tracked by old versions of `ord`.
nl: De tag `3` wordt gebruikt omdat het de eerste beschikbare oneven tag is. Niet-herkende oneven tags maken een inscriptie niet onbeheerd, zodat kindinscripties herkend en gevolgd zouden worden door oude versies van `ord`.

source: A collection can be closed by burning the collection's parent inscription, which guarantees that no more items in the collection can be issued.
nl: Een collectie kan worden gesloten door de ouderinscriptie van de collectie te verbranden, wat garandeert dat er geen verdere items aan de collectie kunnen worden toegevoegd.

source: An important exception to [sandboxing](../inscriptions.md#sandboxing) is recursion. Recursive endpoints are whitelisted endpoints that allow access to on-chain data, including the content of other inscriptions.
nl: Een belangrijke uitzondering op [sandboxing](../inscriptions.md#sandboxing) is recursie. Recursieve eindpunten zijn op een whitelist geplaatste eindpunten die toegang geven tot on-chain gegevens, inclusief de inhoud van andere inscripties.

source: Since changes to recursive endpoints might break inscriptions that rely on them, recursive endpoints have backwards-compatibility guarantees not shared by `ord server`'s other endpoints. In particular:
nl: Aangezien wijzigingen aan recursieve eindpunten inscripties die van deze eindpunten afhankelijk zijn, kunnen breken, hebben recursieve eindpunten garanties voor achterwaartse compatibiliteit die niet gedeeld worden door de andere eindpunten van `ord server`. In het bijzonder:

source: Recursive endpoints will not be removed
nl: Recursieve eindpunten zullen niet worden verwijderd

source: Object fields returned by recursive endpoints will not be renamed or change types
nl: Objectvelden die door recursieve eindpunten worden geretourneerd, zullen niet worden hernoemd of van type veranderen

source: However, additional object fields may be added or reordered, so inscriptions must handle additional, unexpected fields, and must not expect fields to be returned in a specific order.
nl: Echter, extra objectvelden kunnen worden toegevoegd of herordend, dus inscripties moeten extra, onverwachte velden kunnen verwerken en mogen niet verwachten dat velden in een specifieke volgorde worden geretourneerd.

source: Recursion has a number of interesting use-cases:
nl: Recursie heeft een aantal interessante toepassingen:

source: Remixing the content of existing inscriptions.
ar: إعادة مزج محتوى الحالي من الإنسكريبشين.
nl: Het remixen van de inhoud van bestaande inscripties.

source: Publishing snippets of code, images, audio, or stylesheets as shared public resources.
ar: نشر مقتطفات من الشفرة، والصور، والصوت، أو ورقات الأنماط كموارد عامة مشتركة.
nl: Het publiceren van stukjes code, afbeeldingen, audio of stylesheets als gedeelde openbare bronnen.

source: Generative art collections where an algorithm is inscribed as JavaScript, and instantiated from multiple inscriptions with unique seeds.
ar: مجموعات الفن التوليدية حيث يتم توثيق خوارزمية باستخدام JavaScript، ويتم تفعيلها من خلال إنسكريبشين متعددة ببذور فريدة.
nl: Generatieve kunstcollecties waarbij een algoritme wordt ingeschreven als JavaScript en wordt geïnstalleerd vanuit meerdere inscripties met unieke seeds.

source: Generative profile picture collections where accessories and attributes are inscribed as individual images, or in a shared texture atlas, and then combined, collage-style, in unique combinations in multiple inscriptions.
ar: مجموعات صور الملف الشخصي التوليدية حيث يتم تدوين الإكسسوارات والسمات كصور فردية، أو ضمن أطلس للنسيج المشترك، ثم يتم دمجها، على طريقة التراص، في تركيبات فريدة في عدد من الإنسكريبشينس.
nl: Generatieve profielafbeeldingcollecties waarbij accessoires en attributen worden ingeschreven als afzonderlijke afbeeldingen, of in een gedeelde texture atlas, en vervolgens op unieke manieren worden gecombineerd, collage-stijl, in meerdere inscripties.

source: The recursive endpoints are:
nl: De recursieve eindpunten zijn:

source: `/content/<INSCRIPTION_ID>`: the content of the inscription with `<INSCRIPTION_ID>`
nl: `/content/<INSCRIPTION_ID>`: de inhoud van de inscriptie met `<INSCRIPTION_ID>`

source: `/r/blockhash/<HEIGHT>`: block hash at given block height.
nl: `/r/blockhash/<HEIGHT>`: de block hash op de gegeven blockhoogte.

source: `/r/blockhash`: latest block hash.
nl: `/r/blockhash`: laatste block hash.
